{
 "id": 1661,
 "name": "even-more-miley-can-you-handle-this",
 "title": "Even More Miley (Can You Handle This?)",
 "author": "Morgan Levy",
 "date": "2009-03-31T13:21:00-05:00",
 "tags": [
  "miley cyrus"
 ],
 "categories": [],
 "excerpt": "Nashvillians, duck and cover – Miley Cyrus will be appearing, like, forreal, in the flesh, at the Green Hills Davis-Kidd bookstore on April 9 (which, in case you weren’t keeping track, is just a mere handful of days away). She will signing copies of her new memoir, Miles To Go, and a ticket into the signing will cost you $25 (in addition to the $10-25 Davis-Kidd Gives Back Program membership fee)! What a steal! Now, you may be surprised to […]",
 "contentEncoded": "<p><img class=\"alignleft\" style=\"float: left; margin-left: 5px; margin-right: 5px;\" src=\"http://i41.tinypic.com/wcimvs.jpg\" alt=\"\" width=\"287\" height=\"427\"></p>\n<p>Nashvillians, duck and cover &#x2013; Miley Cyrus will be appearing, like, forreal, in the flesh, at the <a href=\"http://www.daviskidd.com/Default.aspx?StoreId=5&amp;TabIndex=0&amp;Tabid=1&amp;p=y\" target=\"_blank\">Green Hills Davis-Kidd bookstore on April 9</a> (which, in case you weren&#x2019;t keeping track, is just a mere handful of days away). She will signing copies of her new memoir, <em>Miles To Go</em>, and a ticket into the signing will cost you $25 (in addition to the $10-25 Davis-Kidd Gives Back Program membership fee)! What a steal!</p>\n<p>Now, you may be surprised to learn that when tickets first went on sale, <a href=\"http://musiccitytv.com/2009/03/27/only-50-folks-buy-tix-for-miley-cyrus-book-signing/\" target=\"_blank\">they only sold 50 of &#x2019;em</a>. We don&#x2019;t care enough to call to find out if they&#x2019;re any closer to selling out now, but standby tickets will be available in the event that it does.</p>\n<p>Ever so conveniently, Miley and her daddy will be appearing at the <a href=\"http://musiccitytv.com/2009/03/24/yes-miley-and-billy-ray-cyrus-will-be-here-for-screening/\" target=\"_blank\">Hannah Montana movie premiere</a> in Green Hills the same evening, but you can&#x2019;t get in. Oh well!</p>"
}