{
 "id": 1689,
 "name": "since-were-not-snowed-in-more-music-tuesday-edition",
 "title": "Since We&#x2019;re Not Snowed In: More Music Tuesday Edition",
 "author": "Morgan Levy",
 "date": "2009-04-07T08:30:00-05:00",
 "tags": [
  "ben folds",
  "joy williams",
  "jukebox the ghost",
  "live music",
  "mass hysteria",
  "ryman auditorium",
  "snow in nashville",
  "snuggies",
  "TAP",
  "the civil wars",
  "the vital sign",
  "toby penner",
  "twitter"
 ],
 "categories": [],
 "excerpt": "If you can manage to dig your way out of the mountains of snow that accumulated overnight (okay okay, so we actually haven’t seen any snow in Green Hills, but it sure sounded like a big deal) tonight, there are a few places that you may want to turn your attention. Because what’s a Tuesday night in Nashville without a bunch of options for great live music? Ben Folds with Jukebox the Ghost at The Ryman. 7:30pm, $25.50-$45.50 (tickets). A […]",
 "contentEncoded": "<p style=\"text-align: center;\"><img class=\"aligncenter\" src=\"http://farm4.static.flickr.com/3231/2298837043_58dd6d5cc2.jpg\" alt=\"\"></p>\n<p>If you can manage to dig your way out of the mountains of snow that accumulated overnight (okay okay, so we actually haven&#x2019;t seen any snow in Green Hills, but it sure sounded like a big deal) tonight, there are a few places that you may want to turn your attention. Because what&#x2019;s a Tuesday night in Nashville without a bunch of options for great live music?</p>\n<p><strong>Ben Folds with Jukebox the Ghost at The Ryman.</strong> <em>7:30pm, $25.50-$45.50 (<a href=\"http://www.ticketmaster.com/event/1B004258FD245D36?artistid=778058&amp;majorcatid=10001&amp;minorcatid=1\" target=\"_blank\">tickets</a>)</em>. A rare hometown show for one Ben Folds, we snapped up the cheap tickets and are excited to see him for the first time in a very long time. According to uh, <a href=\"http://twitter.com/TheRyman/status/1465699219\" target=\"_blank\">The Ryman&#x2019;s Twitter</a>, new tickets were released late yesterday, but it seems like plenty are still available.</p>\n<p><strong><a href=\"http://www.facebook.com/event.php?eid=60800692803\" target=\"_blank\">The Vital Sign at The Five Spot</a></strong>. <em>8pm, free</em>. Do you know why we are telling you to go to this show? We are telling you to go to this show because it is 100% legitimately sponsored by SNUGGIES, which means it&#x2019;s going to be hilarious. And we know it&#x2019;s going to be sponsored by Snuggies due to the large quantity of facebook updates we have received about it. Apparently, if we attend, we can potentially win a new <em>designer leopard print Snuggie</em>. OMG, y&#x2019;all. Wear a Snuggie.</p>\n<p><strong><a href=\"http://www.facebook.com/event.php?eid=67957794133\" target=\"_blank\">The Civil Wars, The Champion &amp; His Burning Flame, Micah Tawlks &amp; Joseph LeMay at the French Quarter Cafe</a></strong>. <em>7:30pm, $5</em>. Do you know why we are telling you to go to <em>this</em> show? We are telling you to go to this show because we&#x2019;re all about The Civil Wars&#x2019; one released song, &#x201C;Falling,&#x201D; which can be found on <a href=\"http://www.youtube.com/watch?v=tkxFA7nzLFg\" target=\"_blank\">YouTube</a> and <a href=\"http://www.reverbnation.com/thecivilwars\" target=\"_blank\">ReverbNation</a> (free download). It&#x2019;s like magic!</p>\n<p><em>Photo by </em><a href=\"http://www.flickr.com/photos/inhisgrace/2298837043/\" target=\"_blank\"><em>inhisgrace</em></a><em>.</em></p>"
}