{
 "id": 7495,
 "name": "bright-early-blast-from-the-past-edition",
 "title": "Bright &amp; Early: Blast From The Past Edition",
 "author": "Christy Frink",
 "date": "2011-07-21T09:30:00-05:00",
 "tags": [
  "50 cent",
  "ADA",
  "americans with disabilities act",
  "bankruptcy",
  "beer festival",
  "criminal justice center",
  "emissions testing",
  "heat wave",
  "james robertson parkway",
  "legislative plaza",
  "metro water services",
  "nashville shores",
  "office of emergency management",
  "sinkhole",
  "suspicious package",
  "war memorial building",
  "young buck"
 ],
 "categories": [],
 "excerpt": "Good morning, Nashville. Everyone in Tennessee (and probably most people outside of Tennessee, by now) knows that there are some unfortunate things that go down at our state’s Legislative Plaza. However, we did not realize that the actual plaza and War Memorial Building aren’t even ADA-compliant. Despite completing some hefty renovations within the past five years, no one thought to bring the buildings up to standard. Take it from House Speaker Beth Harwell who scooted around in a wheelchair for […]",
 "contentEncoded": "<p><a href=\"http://www.flickr.com/photos/davemadethis/5357723591/in/pool-715021@N24/\"><img class=\"aligncenter\" src=\"http://farm6.static.flickr.com/5161/5357723591_b6aa8701a5.jpg\" alt=\"\" width=\"500\" height=\"500\"></a></p>\n<p>Good morning, Nashville. Everyone in Tennessee (and probably most people outside of Tennessee, by now) knows that there are some unfortunate things that go down at our state&#x2019;s Legislative Plaza. <a href=\"http://wpln.org/?p=29000\" target=\"_blank\">However, we did not realize that the actual plaza and War Memorial Building aren&#x2019;t even ADA-compliant</a>. Despite completing some hefty renovations within the past five years, no one thought to bring the buildings up to standard. Take it from House Speaker Beth Harwell who scooted around in a wheelchair for a day just to see what it was like trying to navigate the plaza and found it to be quite a challenge.&#xA0;A feds say we have two years to make some changes to these buildings and bring them up to par with the regulations set forth in the Americans with Disabilities Act, which was passed all&#xA0;the way back in 1990. Like, children who were born in 1990 can mostly drink now&#x2013;that&#x2019;s how long ago 1990 was. But we digress!</p>\n<ul>\n<li><strong>Something in the water. </strong>If you think our tap water has been tasting a little, er, &#x201C;earthy&#x201D; lately, you&#x2019;re not alone. <a href=\"http://www.newschannel5.com/story/15119580/metro-water-customers-complain-of-bad-taste\" target=\"_blank\">Metro Water Services has received numerous complaints and they say the heat wave and lack of rainfall are to blame, as higher temperatures cause a bloom of blue-green algae that makes the water taste weird</a>. They stress that there are zero health effects involved, but they will be adding some activated carbon to the process in hopes of getting rid of the funky taste.</li>\n<li><strong>OEM battles the heat. </strong>The Office of Emergency Management kicked things into high gear this week,&#xA0;<a href=\"http://www.wkrn.com/story/15118675/oem-deploys-mobile-units-in-nashville-to-provide-bottle-water\" target=\"_blank\">sending out teams of volunteers to check on folks and pass out bottles of water in hopes of preventing any heat-related tragedies</a>. The city, Red Cross and Salvation Army have also opened up cooling centers for people who can&#x2019;t otherwise escape the heat.</li>\n<li><strong>Bits &amp; pieces. </strong><a href=\"http://www.newschannel5.com/story/15119377/sinkhole-road-closures-hurting-local-businesses\" target=\"_blank\">Sinkhole!</a> &#x2026; The Dickerson Road and Antioch Pike emissions stations <a href=\"http://www.wkrn.com/story/15114509/nashville-emissions-station-adds-sat-hours\" target=\"_blank\">will now be open on Saturdays</a> &#x2026; <a href=\"http://www.outandaboutnewspaper.com/article/4936\" target=\"_blank\">There&#x2019;s a new beer festival in town</a> &#x2026; We&#x2019;re glad <a href=\"http://www.newschannel5.com/story/15116279/nashville-shores-extending-summer-hours\" target=\"_blank\"><em>someone</em> is benefitting from this heat wave</a> &#x2026; A suspicious backpack outside the Criminal Justice Center <a href=\"http://www.newschannel5.com/story/15116089/police-investigate-suspicious-package-outside-cjc\" target=\"_blank\">shut down James Robertson Parkway yesterday</a> &#x2026; <a href=\"http://www.tennessean.com/article/20110718/NEWS01/307180008/2275/RSS05\" target=\"_blank\">Franklin&#x2019;s African American population is definitely on the decline</a> according to the latest census data &#x2026; 50 Cent has filed a bankruptcy objection <a href=\"http://nashvillepost.com/blogs/postbusiness/2011/7/15/rapper_50_cent_files_young_buck_bankruptcy_objection\" target=\"_blank\">in response to Nashville rapper Young Buck&#x2019;s plan to pay back his label, G-Unit</a>.</li>\n</ul>\n<p><em>Photo by <a href=\"http://www.flickr.com/photos/davemadethis/5357723591/in/pool-715021@N24/\" target=\"_blank\">Dave Delaney</a></em>.</p>"
}