{
 "id": 3128,
 "name": "belcourt-does-a-little-sundance-2010-film-festival-goes-nationwide",
 "title": "Belcourt Does A Little Sundance: 2010 Film Festival Goes Nationwide",
 "author": "Morgan Levy",
 "date": "2009-11-04T16:32:00-06:00",
 "tags": [
  "2010",
  "belcourt theatre",
  "film",
  "sundance film festival",
  "tickets"
 ],
 "categories": [],
 "excerpt": "We’re grinning from ear to ear as we bring you this news – Nashville’s very own Belcourt Theatre has been selected as one of eight independent theatres nationwide to host the brand-new expanded Sundance Film Festival USA. On January 28, 2010, eight filmmakers will take their films on the road for “a night of ideas across the country,” stopping at The Belcourt and in theatres in Ann Arbor, MI (Michigan Theater), Brookline, MA (Coolidge Corner Theatre), Brooklyn, NY (BAM), Chicago, IL […]",
 "contentEncoded": "<p style=\"text-align: center;\">\n</p><p style=\"text-align: center;\"><img class=\"aligncenter\" src=\"http://farm4.static.flickr.com/3244/2394017068_673a9c1cc2.jpg\" alt=\"\"></p>\n<p style=\"text-align: left;\">We&#x2019;re grinning from ear to ear as we bring you this news &#x2013; Nashville&#x2019;s very own <a href=\"http://www.indiewire.com/article/sundance_fest_goes_nationwide_for_one_night_only/\" target=\"_blank\">Belcourt Theatre has been selected as one of eight independent theatres nationwide</a> to host the brand-new expanded Sundance Film Festival USA. On January 28, 2010, eight filmmakers will take their films on the road for &#x201C;a night of ideas across the country,&#x201D; stopping at The Belcourt and in&#xA0;theatres in Ann Arbor, MI (Michigan Theater), Brookline, MA (Coolidge Corner Theatre), Brooklyn, NY (BAM), Chicago, IL (Music Box Theatre), Los Angeles, CA (Downtown Independent), Madison, WI (Sundance Cinemas Madison) and San Francisco, CA (Sundance Kabuki Cinemas).</p>\n<p style=\"text-align: left;\">Theatres will host a screening and Q&amp;A session with the filmmaker, as well as a pre-show program featuring highlights from the real Sundance in Utah. Specific films and filmmakers have yet to be announced, but we&#x2019;ll keep you updated. Tickets will go on sale Friday, December 11.</p>\n<p>Congrats to The Belcourt!</p>\n<p><em>Photo by </em><a href=\"http://www.flickr.com/photos/jhritz/2394017068/\" target=\"_blank\"><em>jhritz</em></a><em>.</em></p>"
}