{
 "id": 3132,
 "name": "clear-the-roads-cool-springs-chuys-open-for-business-and-heading-for-the-boro",
 "title": "Clear The Roads, Cool Springs: Chuy&#x2019;s Open For Business (And Heading For The &#x2018;Boro)",
 "author": "Morgan Levy",
 "date": "2009-11-04T17:03:00-06:00",
 "tags": [
  "cool springs chuy&apos;s",
  "murfreesboro chuy&apos;s",
  "nashville chuy&apos;s",
  "tex-mex",
  "what the hell is chuy&apos;s"
 ],
 "categories": [],
 "excerpt": "Nashville, we have a confession to make. We got to try out the new Chuy’s in Cool Springs before its official grand opening on Monday evening, and we forgot to fill you in. Our feeble excuse? Food coma. Chuy’s really doesn’t need reviewing (we were actually late for our reservation because we couldn’t squeeze our car in among the Texas license plates). The place was jam-packed with loyal Chuy’s Facebook fans enjoying a free meal, and we could barely navigate […]",
 "contentEncoded": "<p style=\"text-align: center;\"><img class=\"aligncenter\" src=\"http://i34.tinypic.com/688lqq.jpg\" alt=\"\"></p>\n<p>Nashville, we have a confession to make. We got to try out the new <a href=\"http://chuys.com/\" target=\"_blank\">Chuy&#x2019;s</a> in Cool Springs before its official grand opening on Monday evening, and we forgot to fill you in. Our feeble excuse? Food coma.</p>\n<p>Chuy&#x2019;s really doesn&#x2019;t need reviewing (we were actually late for our reservation because we couldn&#x2019;t squeeze our car in among the Texas license plates). The place was jam-packed with loyal <a href=\"http://www.facebook.com/chuysnashville\" target=\"_blank\">Chuy&#x2019;s Facebook fans</a> enjoying a free meal, and we could barely navigate through them to the bar to order a tasty Chuy&#x2019;s &#x2018;Rita. And at the grand opening on Tuesday, things weren&#x2019;t any different &#x2013; our undercover Chuy&#x2019;s operative reports that he waited 45 minutes for a table.</p>\n<p>If you&#x2019;ve gotten this far and are completely baffled, you must not be from Texas (it&#x2019;s okay, neither are we). Chuy&#x2019;s is a funky tex-mex restaurant with a cultish following, and their first location outside of Texas just happens to be (almost) in town (as if Cool Springs traffic needed to get any worse). Check out our <a href=\"http://nashvillest.com/2009/05/05/chuys-bringing-elvis-tex-mex-to-cool-springs-comings-goings/\" target=\"_blank\">first post about Chuy&#x2019;s coming to Tennessee</a> to fill in some of the blanks.</p>\n<p>Chuy&#x2019;s must see a bright future in Middle Tennessee &#x2013; Plans are already in the works for a <a href=\"http://www.murfreesboropost.com/chuys-restaurant-to-open-on-broad-street-cms-20210\" target=\"_blank\">Murfreesboro location to open</a>.&#xA0;The Murfreesboro restaurant will be the second in Tennessee and the 17th location overall for the chain. The &#x2018;Boro Chuy&#x2019;s will move in at the former Davy Crockett&#x2019;s building on Northwest Broad Street, and will be open for business in Spring 2010.</p>\n<p><em>Photo via </em><a href=\"http://www.facebook.com/photo.php?pid=3344300&amp;id=81925186839\" target=\"_blank\"><em>Chuy&#x2019;s Nashville</em></a><em> on Facebook.</em></p>"
}