{"id":"102","name":"gems-from-the-nashville-craigslist-money-cant-buy-love","title":"Gems From The Nashville Craigslist: Money Can&#x2019;t Buy Love","author":"Morgan Levy","date":"2008-05-19T15:30:00-05:00","tags":["craigslist","money","Nashville","nashville craigslist","rich bigdollars"],"categories":["News"],"contentEncoded":"<div id=\"greet_block\"><noscript><div class=\"greet_block wpgb_cornered\"><div class=\"greet_text\"><div class=\"greet_image\"><a href=\"http://nashvillest.com/feed/rss/\" rel=\"nofollow\"><img src=\"http://nashvillest.com/wp-content/plugins/wp-greet-box/images/rss_icon.png\" alt=\"WP Greet Box icon\"></a></div>Hello there! If you&apos;re new to Nashvillest, you might want to <a href=\"http://feeds.feedburner.com/nashvillest\" rel=\"nofollow\"><strong>subscribe to our RSS feed</strong></a> to make sure you don&apos;t miss anything! We&apos;re also on <a href=\"https://twitter.com/#!/nashvillest\" target=\"blank\"><strong>Twitter</strong></a> if you&apos;d like to join us there!<div style=\"clear:both\"></div><div class=\"greet_block_powered_by\">Powered by <a href=\"http://omninoggin.com/projects/wordpress-plugins/wp-greet-box-wordpress-plugin/\" title=\"WP Greet Box WordPress Plugin\" style=\"text-decoration:none;\">WP Greet Box</a> <a href=\"http://omninoggin.com/\" title=\"WordPress Plugin\" style=\"text-decoration:none;\">WordPress Plugin</a></div><div style=\"clear:both\"></div></div></div></noscript></div><p>There&#x2019;s nothing better than a good, aimless browsing of the Nashville Craigslist. It&#x2019;s something about knowing that these people are living in our fair city, that we could have been standing with them in the checkout line at Target last week, that makes it so endlessly entertaining. Safe to say, this one wasn&#x2019;t standing in line at Target with us&#x2026;</p><blockquote><p><strong>Do You Need a Good Looking RICH Guy??????????? &#x2013; 30 (Nashville)</strong></p><p>I am so rich. Goodness, gracious. My, my, my. I am so, very, very wealthy. How many dollars do I have? That&#x2019;s a question only my team of ten fat accountants can answer, because they have golden calculators which I bought for them with my money. And what is on those golden calculators? Numbers. And those numbers equal the dollars in my bank accounts, which are huge.</p><p>I have many vehicles which I use to travel across the world and to many exotic destinations where most people cannot go, because they are so poor. They have very little in dollars, but I, myself, I have very many dollars. Also, I am sexy for a man. I like to think that if I was a woman, I would be a playboy model. But since I am a man I am like the opposite of all that, the man version.</p><p>In my vehicles I have stored many bottles of rare, delicious wines. These wines are hundreds of years old and covered in dust and cobwebs, which means that they are the most delicious kind, and that they were grown from grapes which were so succulent and juicy that the poor grape-pickers of France wanted to eat them right then and there. But they were whipped, by my shift-leader vintner, who makes sure that the best grapes in my vineyard go only into the wine. That&#x2019;s right, my great grandfather, who was also rich, owned the vineyard where this wine was made. And it&#x2019;s really strong too, it can get you wasted quickly.</p><p><span id=\"more-102\"></span></p><p>I am a big time gamer in the real estate market. I speculate and consolidate my wins and losses into pure profit, keeping my blue chips in the black, playing the lady stock market, teasing and tempting her, always with my eyes on the wall street journals and calling my broker on my diamond plated iphone, which I have the most expensive plan of. I call Steve Jobs on it, and when he answers, I&#x2019;m like, &#x201C;Who are you? I don&#x2019;t know who you are because I am so rich and cool, and only nerds know who you are.&#x201D;</p><p>Then I hang up on him and laugh, lighting a big fat stogie with memoirs of Winston Churchill.</p><p>But I have a tender side. Sometimes, I see a hobo. And when I see the hobo, I think to myself, &#x201C;This man is poor. His monetary value is low, and my monetary value is high, and it&#x2019;s a shame that he is himself. What can I do?</p><p>I ask the hobo if he would rather have booze or money to buy booze. If he says he wants the money, I don&#x2019;t give it to him because I know he&#x2019;ll buy booze with it. But if he says he wants the booze, I give him the money because I value honesty, even among lying hobos.</p><p>You may be asking yourself at this point, why is this rich man posting on a message board when he can have any woman he wants at any time he wants her, just by showing her how much money he has in his shoe? The answer is that I want to date someone who doesn&#x2019;t know that I am rich. I want to be anonymous. Only when we have fallen in love will I reveal to you that I am rich. That is why we must meet through this message board.</p><p>On our first date, I will wear normal clothes like from Wal-mart, that most people wear. And I will turn on the music on my stereo, when I&#x2019;m picking you up, and it will play &#x201C;Jamie&#x2019;s Cryin&#x2019;&#x201D;, just like normal people listen to. I&#x2019;ll sing along as I drive you to the local Sonic and buy you a cherry limeade, being careful not to tip the carhop so you won&#x2019;t think that I have more money than I&#x2019;m letting on.</p><p>By this time you&#x2019;ll be thinking that I&#x2019;m just like you, poor and smelly. But then we&#x2019;ll drive back to a hotel, only you will think we are going to Motel 6. But then we will pull up to the Marriott, and I&#x2019;ll smile knowingly. You might think that I have won the lottery recently, but I won&#x2019;t let on. Then when we get to the room I&#x2019;ll order room service, again, not telling you that I&#x2019;m richer than a donkey&#x2019;s ass, just coolly ordering some duck l&#x2019;orange and some fries.</p><p>Finally, you&#x2019;ll be dying to know how I can afford such luxury. At that point I&#x2019;ll be like, &#x201C;It&#x2019;s because I am rich.&#x201D; and then I&#x2019;ll pull off my flannel and be wearing a tuxedo underneath, and you&#x2019;ll be like, &#x201C;Oh my God! You ARE rich.&#x201D; And then a helicopter will pull up to the window, with my butler Jenkins leaning out, holding a bottle of Chablis and a towel on his arm.</p><p>&#x201C;Evening Sir!&#x201D; he&#x2019;ll say in his trademark way, and I&#x2019;ll say, &#x201C;Jenkins! Let&#x2019;s go to Borneo tonight, eh? Can the GoldenDollarSign,&#x201D; (the name of my helicopter) &#x201C;get us there in time for cocktails?&#x201D;</p><p>When we arrive in Borneo we&#x2019;ll land on top of my tallest skyscraper, and I&#x2019;ll propose to you, handing you a ring made of pure platinum, with 0% impurities.</p><p>I can&#x2019;t wait to surprise you with that ring. I&#x2019;m looking at it now. Send me an email with a picture if this could be you.</p><p>Yours,<br>Rich Bigdollars (Not my real last name.)</p></blockquote><p>Now, we&#x2019;re thinking it doesn&#x2019;t get much better than this. But wait &#x2013; it does. Because some Nashvillians&#x2026; took it <em>seriously.</em></p><blockquote><p><strong>RE: Do You Need a Good Looking RICH Guy??????????? &#x2013; 30 (Nashville)</strong></p><p>Ladies, do yourselves a favor. This guy is an ass. He&#x2019;s disrespectful and you&#x2019;re better than that! I e-mailed him telling him he&#x2019;d not find someone that was quality if he was so focused on money and he agreed and kept on showing his true egocentric colors.</p></blockquote><blockquote><blockquote><p><strong>Re:RE:Do You Need a Good Looking RICH Guy???????????  (Nashville)</strong></p><p>Hmmm YOU are ONE lonely man!!! Jesus loves YOU!<br>What IF you died tonight-where would YOU go?<br>What does it prosper a MAN to gain the whole world and lose his soul???<br>Here you are bragging but deep down inside you are crying out for a woman to really love you for you. I will pray that you will see the light!<br>I just want YOU to know dear sir I see through you and your pain.<br>Start praying and Jesus will change YOU and YOUR ways and bring YOU the RIGHT woman that YOU so desire.<br>MONEY cant buy love and it certainly cant buy YOU a place in HEAVEN! God bless you dear man and I just want YOU to know I love you and I will be praying for you! Be blessed! Have a good night!!!</p></blockquote></blockquote><p>Finally, our kind of person steps in, and all is right.</p><blockquote><blockquote><blockquote><p><strong>RE: Do You Need a Good Looking RICH Guy??????????? &#x2013; 30 (Nashville)</strong></p><p>Are you people THAT dense????  Its called sarcasm. Which, by the way, was HILARIOUS!</p></blockquote></blockquote></blockquote><p>Related posts:<ol><li><a href=\"http://nashvillest.com/2008/06/02/gems-from-the-nashville-craigslist-superheroes-get-lonely-too/\" rel=\"bookmark\" title=\"Permanent Link: Gems From The Nashville Craigslist: Superheroes Get Lonely Too\">Gems From The Nashville Craigslist: Superheroes Get Lonely Too</a></li><li><a href=\"http://nashvillest.com/2008/06/10/gems-from-the-nashville-craigslist-find-out-who-your-friends-are/\" rel=\"bookmark\" title=\"Permanent Link: Gems From The Nashville Craigslist: Find Out Who Your Friends Are\">Gems From The Nashville Craigslist: Find Out Who Your Friends Are</a></li><li><a href=\"http://nashvillest.com/2008/05/26/gems-from-the-nashville-craigslist/\" rel=\"bookmark\" title=\"Permanent Link: Gems From The Nashville Craigslist: YOU ATE MY CALZONE\">Gems From The Nashville Craigslist: YOU ATE MY CALZONE</a></li><li><a href=\"http://nashvillest.com/2008/07/29/that-just-might-work-gems-from-the-nashville-craigslist/\" rel=\"bookmark\" title=\"Permanent Link: That Just Might Work [Gems From The Nashville Craigslist]\">That Just Might Work [Gems From The Nashville Craigslist]</a></li><li><a href=\"http://nashvillest.com/2008/07/21/gems-from-the-nashville-craigslist-haiku-hotel/\" rel=\"bookmark\" title=\"Permanent Link: Gems From The Nashville Craigslist: Haiku Hotel\">Gems From The Nashville Craigslist: Haiku Hotel</a></li></ol></p>\t\t\t\t\t\t\t\t\t\t\t<!--END .entry-content .article-->"}