{
 "id": "1041",
 "name": "crema-coffee-classes-guest-posts",
 "title": "Crema Coffee Classes [Guest Posts]",
 "author": "Morgan Levy",
 "date": "2008-10-01T11:00:00-05:00",
 "tags": [
  "classes",
  "coffee",
  "coffeeshop",
  "crema",
  "downtown",
  "drew&apos;s brews",
  "espresso",
  "guest posts",
  "starbucks"
 ],
 "categories": [],
 "contentEncoded": "<p style=\"text-align: center;\"><img class=\"aligncenter\" src=\"http://farm4.static.flickr.com/3182/2372302398_61f10f23fc.jpg\" alt=\"\"></p>\n<p><em>Guest post by our friend Jon Arnold, who irresponsibly neglects <a href=\"http://www.thenashvillain.com\" target=\"_blank\">several</a> of his own <a href=\"http://jonarnoldmakesmusic.blogspot.com\" target=\"_blank\">websites</a></em><em>&#x2026; Thanks Jon!</em></p>\n<p>If you spend much time on First Avenue downtown, you&#x2019;re sure to have also spent some time at two places: one, the weird roller coaster statue, and two, <a href=\"http://www.crema-coffee.com\" target=\"_blank\">Crema Coffee</a>.&#xA0; Nashvillest has sung its praises of Crema before, but shop proprietor and barista supreme Rachel Lehman is taking it to a new level this fall with espresso technique classes.</p>\n<p>My wife and I were fortunate enough to sneak into the Espresso 101 class and quite literally stand behind the Crema bar for a couple hours.&#xA0; Rachel took us through her barista training manual, giving us the ins and outs of her shop, just like she would with a new employee.&#xA0; Her insights are thoughtful and truly show her love of the craft of coffee; to that end she told us some tips of the trade, like how best to tamp your portafilter and how fine to grind your beans.</p>\n<p>Once we finished, she gave us a personal walkthrough of her espresso station and showed us how she customized her portafilters (forcing Rachel and her staff to make a *perfect* shot each time), how she uses only the finest from <a href=\"http://www.drewsbrewscoffee.com\" target=\"_blank\">Drew&#x2019;s Brews</a> local roasting shop, and how attention to detail makes a great espresso.&#xA0; We tried some espresso that she lovingly pulled for us.&#xA0; It was smooth, rich and fragrant, and had a chocolaty-thick yet fruity sweetness to it.&#xA0; Delicious and perfect (partly due to Drew&#x2019;s roasting, Rachel admits), she then went on to explain how subtle changes in method can absolutely and irrevocably ruin a shot of espresso.</p>\n<p>And boy, I do mean ruin.&#xA0; When she adjusted the grind, tamp and dose of the espresso, her portafilters sprayed brewed coffee everywhere, not to mention making a bitter, burnt shot.&#xA0; Literally the only difference was the human elements of choice and approach &#x2014; a serious thought to ponder next time you enter a Starbucks.</p>\n<p>Luckily for everyone, Rachel videotaped a similar training session and posted it <a href=\"http://crema-coffee.com/2008/09/11/crema-college-of-coffee-how-to-dose-tamp-espresso\" target=\"_blank\">on her site</a> &#x2013; check it out!&#xA0; Rachel also let us know there&#x2019;s still a few seats open for the other two classes in October and November, which focus on brewing techniques and coffee tasting, respectively. Visit <a href=\"http://www.crema-coffee.com\" target=\"_blank\">Crema&#x2019;s site</a> to sign up!</p>\n<p><em>Photo by </em><a href=\"http://www.flickr.com/photos/benlehman/2372302398/in/set-72157602404921497/\" target=\"_blank\"><em>CREMA &#x2013; Coffee</em></a><em>. </em></p>"
}