{
 "id": "110",
 "name": "cupcake-showdown-gigis-cupcakes-vs-dulce-desserts",
 "title": "Cupcake Showdown: Gigi&#x2019;s Cupcakes vs. Dulce Desserts",
 "author": "Morgan Levy",
 "date": "2008-05-19T14:00:00-05:00",
 "tags": [
  "cupcakes",
  "dessert",
  "dulce desserts",
  "gigi&apos;s cupcakes",
  "music row",
  "Nashville",
  "peanut butter cup cupcake",
  "princess cupcake",
  "red velvet cake",
  "rocky road cupcake",
  "whole foods"
 ],
 "categories": [
  "Food &amp; Drink"
 ],
 "contentEncoded": "<p><a href=\"http://nashvillest.com/wp-content/uploads/2008/05/151561817_308888ab04.jpg\"><img class=\"aligncenter size-full wp-image-111\" title=\"151561817_308888ab04\" src=\"http://nashvillest.com/wp-content/uploads/2008/05/151561817_308888ab04.jpg\" alt=\"\" width=\"500\" height=\"375\"></a></p>\n<p><em>[Ed. Note: A big thanks to <a href=\"http://teawithtangerine.wordpress.com/\" onclick=\"javascript:_gaq.push([&apos;_trackEvent&apos;,&apos;outbound-article&apos;,&apos;teawithtangerine.wordpress.com&apos;]);\" target=\"_blank\">Marion Millard</a>, who was so kind as to write our first real Nashvillest food review this week! We look forward to having the excuse to try all the incredible local food, drink and dessert selections - But for now, reading about it is the next best thing.] </em></p>\n<p>Music Row workers have a couple of options for a quick pick-me-up dessert.  There&#x2019;s <a href=\"http://www.dulcedesserts.com/\" onclick=\"javascript:_gaq.push([&apos;_trackEvent&apos;,&apos;outbound-article&apos;,&apos;www.dulcedesserts.com&apos;]);\" target=\"_blank\">Dulce Desserts</a> in Edgehill Village, or the trendy new <a href=\"http://gigiscupcakesusa.com/\" onclick=\"javascript:_gaq.push([&apos;_trackEvent&apos;,&apos;outbound-article&apos;,&apos;gigiscupcakesusa.com&apos;]);\" target=\"_blank\">Gigi&#x2019;s Cupcakes</a> off 21st. Decisions, decisions.</p>\n<p>Dulce Desserts was up first. They aren&#x2019;t really in JUST the cupcake business, but their creations are so delectable that you wouldn&#x2019;t even suspect that they aren&#x2019;t their main source of revenue. Walking into their tiny store next to a Pilates studio (the irony) you&#x2019;re overwhelmed by the gorgeous gigantic cakes sitting on the counter that you almost don&#x2019;t notice the array of cupcakes in the case underneath. My coworker and I stare at the menu board, attempting to make a decision. Unfortunately, Dulce was sold out of most of their gourmet cupcakes, so we were forced into settling for the $2.00 red velvet cupcakes&#x2013; smaller in size but equally as beautiful to look at.</p>\n<p><span id=\"more-110\"></span></p>\n<p>I was hesitant to ruin such a lovely culinary creation by chomping into it, especially since the white dollop of frosting was dusted with (hopefully edible) silver glitter.  Now, I judge cupcakes by a few factors:</p>\n<ol>\n<li>Moistness of cake</li>\n<li>Quality of frosting</li>\n<li>Easiness of eating (fork vs. hand)</li>\n<li>Appearance</li>\n</ol>\n<p><a href=\"http://nashvillest.com/wp-content/uploads/2008/05/img00127.jpg\"><img class=\"alignright alignnone size-medium wp-image-113\" style=\"border: 0pt none; margin: 3px 8px; float: right;\" title=\"img00127\" src=\"http://nashvillest.com/wp-content/uploads/2008/05/img00127-239x300.jpg\" alt=\"\" width=\"186\" height=\"234\"></a>Dulce Desserts hands down passed all 4 tests. The red velvet cake was absolutely fantastic and wasn&#x2019;t dry like other red velvet cakes I&#x2019;ve tasted.  I was also impressed by the frosting &#x2013; unlike traditional red velvet cakes, this had a whipped vanilla frosting that was so light that I didn&#x2019;t feel sick from sugar overdose after all was said and done. I&#x2019;ve already mentioned the appearance of it (naturally, A+), but the only area the cupcake faltered slightly was in easiness of eating.  Since this wasn&#x2019;t of the &#x201C;gourmet&#x201D; line, the cupcake was smaller, and the frosting amount complimented it perfectly &#x2013; but when attempting to eat the cake out of my hand, I had trouble biting into both the frosting and the cake part without getting frosting up my nose.  Just a minor complaint that was completely forgotten later when reminiscing about the amazing cupcake experience. With the lovely memory of Dulce Desserts in the back of my mind, I looked forward to Gigi&#x2019;s with great expectations.</p>\n<p>I&#x2019;ve got to say, Gigi&#x2019;s definitely had the <em>look</em> down well. I entered the cute outpost by Off the Grill and my jaw dropped at the vast array of colorful concoctions before my eyes. Which to choose? Midnight Madness? Cookies &amp; Cream? Red Velvet? Peanut Butter Cup? Bingo!</p>\n<p><a href=\"http://nashvillest.com/wp-content/uploads/2008/05/img00124.jpg\"><img class=\"alignleft alignnone size-medium wp-image-112\" style=\"border: 0pt none; margin: 3px 8px; float: left;\" title=\"img00124\" src=\"http://nashvillest.com/wp-content/uploads/2008/05/img00124-300x240.jpg\" alt=\"\" width=\"272\" height=\"217\"></a>Each cupcake, at $3.00 a pop, was boxed up in cute little to-go containers and sealed with a sticker. I grabbed a fork on the way out, knowing instantly that these definitely were not the kind of cupcakes you just bite into. These are practically slices of cake, with 5x more frosting.</p>\n<p>And how did these cupcakes score? First of all, the cake part was a little dry, not unpleasantly so, but still enough to notice. I enjoyed the chocolate flavor of my peanut butter cup, but still wished it had a bit more moisture to it. The frosting was an absolutely amazing gob of peanut butter and sugar, but I couldn&#x2019;t finish it and was feeling the aforementioned sugar overdose 20 minutes later. I did taste the frosting from Gigi&#x2019;s red velvet cupcake, and it was a cream cheese based frosting that passed the test. Again, these cupcakes were almost too pretty to eat but once in my mouth, I forgot that complaint.</p>\n<p>For all the hoopla about cupcakes these days, I was a little disappointed by my selection at Gigi&#x2019;s.  Maybe it was an off batch, maybe I just selected the wrong flavor &#x2013; Friends swear by the Princess and Rocky Road selections. The cupcakes definitely look awesome, but I&#x2019;m not enough of a sugar addict to appreciate the richness of the frosting. I&#x2019;ll have to take the economic stimulus check back to Gigi&#x2019;s for a second chance. Next up &#x2013; Those monster cupcakes hidden in the baked goods display case at Whole Foods.</p>\n<p><em>Photo by <a href=\"http://flickr.com/photos/santos/151561817/\" onclick=\"javascript:_gaq.push([&apos;_trackEvent&apos;,&apos;outbound-article&apos;,&apos;flickr.com&apos;]);\" target=\"_blank\">santos</a>.</em></p>\n\n\n\n\n<p>Related posts:<ol><li><a href=\"http://nashvillest.com/2008/12/02/franklin-cupcake-showdown-ivey-cake-vs-curious-gourmet-guest-posts/\" rel=\"bookmark\" title=\"Permanent Link: Franklin Cupcake Showdown: Ivey Cake vs. Curious Gourmet [Guest Posts]\">Franklin Cupcake Showdown: Ivey Cake vs. Curious Gourmet [Guest Posts]</a></li>\n<li><a href=\"http://nashvillest.com/2008/09/04/coffee-cupcakes-update/\" rel=\"bookmark\" title=\"Permanent Link: Coffee &amp; Cupcakes Update\">Coffee &amp; Cupcakes Update</a></li>\n</ol></p>\t\t\t\t\t\t\t\t\t\t\t<!--END .entry-content .article-->"
}