{
 "id": "1157",
 "name": "krave-frozen-yogurt-were-getting-closer-to-pinkberry-every-day",
 "title": "Krave Frozen Yogurt: We&#x2019;re Getting Closer To Pinkberry Every Day",
 "author": "Morgan Levy",
 "date": "2008-10-22T07:00:00-05:00",
 "tags": [
  "abbott martin",
  "bandywood",
  "frozen yogurt",
  "green hills",
  "hill center",
  "krave",
  "pinkberry",
  "provence",
  "tasti d-lite",
  "yogurt oasis"
 ],
 "categories": [],
 "contentEncoded": "<p style=\"text-align: center;\"><img class=\"aligncenter\" src=\"http://farm2.static.flickr.com/1082/1466784332_9d1bac7873.jpg\" alt=\"\"></p>\n<p>We&#x2019;ve been eyeballing it for weeks, tucked away between Blockbuster and Blimpie in that shopping center on Abbott Martin and Bandywood (also home to the Wine Shoppe at Green Hills). Signs had slowly been appearing that seemed to indicate a new Pinkberry-style frozen yogurt shop opening soon. And we&#x2019;re proud to announce that it has finally opened, quietly over this past weekend. 9pm on a 50-degree October night was the perfect time to check out the brand new Krave Frozen Yogurt, so we bundled up in sweatpants and jackets and hopped in the car for the .3 mile trip.</p>\n<p>Krave is, to put it simply, perfect. Unlike <a href=\"http://nashvillest.com/2008/08/12/reviews-yogurt-oasis-been-there-done-that/\" target=\"_blank\">Yogurt Oasis</a>, there are plenty of fresh fruit toppings to go around: Peaches, cantaloupe, blueberries, raspberries, strawberries, kiwi, mango, banana and more, plus a dozen or so dry toppings that include marshmallows, chocolate chips, granola and fruit loops.</p>\n<p>We decided to try both the pomegranate yogurt and the mango yogurt. Says Christy, about her mango yogurt with fresh blueberry, strawberry and a chewy/crunchy granola:</p>\n<blockquote><p>MmmMmm, that was good. Very refreshing. Tasted like summer.</p></blockquote>\n<p>Sometimes, she&#x2019;s profound.</p>\n<p>Morgan&#x2019;s pomegranate yogurt with fresh cantaloupe, kiwi and raspberries was tart and flavorful, but a small taste of Christy&#x2019;s yogurt set mango up as a clear winner. The flavor was that of fresh mango, while the pomegranate yogurt took on a more artificial pomegranate flavor. But it was still <em>really</em> good. We also sampled the original plain yogurt which was nearly identical to Pinkberry&#x2019;s in flavor, but all of Krave&#x2019;s yogurts were much icier than Pinkberry&#x2019;s traditional thick and creamy style yogurt. We preferred the icier version, and it&#x2019;s definitely easier on a lactose-sensitive stomach. Just keep that in mind.</p>\n<p>We&#x2019;ll wrap up by mentioning that Krave is really, really cute. Plenty of seating, plenty of space, and the same bright color scheme that frozen yogurt shops everywhere have claimed as their own. A small plain frozen yogurt with 3 toppings will run you $3.99, and the flavored yogurt with 3 toppings is just $1 extra. They only take cash right now, so come prepared. Welcome to Nashville, Krave!</p>\n<p><em>Krave Frozen Yogurt<br>\n2109 Abbott Martin Road<br>\nHours: Mon-Thurs 11am-10pm, Fri-Sat 11am-11pm, Sun 11am-6pm</em></p>\n<p>Photo by <a href=\"http://flickr.com/photos/mvjantzen/1466784332/\" target=\"_blank\">M.V. Jantzen</a>.</p>"
}