{
 "id": "1300",
 "name": "wife-swap-gems-from-the-nashville-craigslist",
 "title": "Wife Swap? [Gems From The Nashville Craigslist]",
 "author": "Morgan Levy",
 "date": "2008-11-24T16:00:00-06:00",
 "tags": [
  "gems from the nashville craigslist",
  "husband",
  "lazy",
  "wife swap"
 ],
 "categories": [],
 "contentEncoded": "<p style=\"text-align: center;\"><img class=\"aligncenter\" src=\"http://farm1.static.flickr.com/59/183203849_bdb68dc0a5.jpg\" alt=\"\"></p>\n<p>There&#x2019;s a market for everything on Craigslist, including wife swaps. We&#x2019;re tempted to submit this one to <a href=\"http://www.passiveaggressivenotes.com/\" target=\"_blank\">passiveaggressivenotes.com</a>! Ouch.</p>\n<blockquote>\n<h3><a href=\"http://nashville.craigslist.org/bar/932567385.html\" target=\"_blank\">****WIFE SWAP ANYONE??**** (Nashville)</a></h3>\n<p>Im looking for another wife (physical appearance as far from important) for the day to swap with my beautiful lazy wife. My house is in serious disarray and somehow she is unable to make the smallest dent in cleaning it. I spent half my one day off of work this week helping her get started cleaning our home and after working a 16 hour shift come home to a newly chemically tanned wife laying in bed with a house twice as dirty as we left it. This day happens to be my birthday and she promised me that she would finish cleaning it as this is the one thing I asked for when asked what I wanted for my birthday. I even proceeded to call and check on her progress thru out the day twice and each time she happened to be taking a break due to exhaustion from highly detailed cleaning. Actually one of the two times I had to have my sisters boyfriend come to the house and physically check on her because i was worried and she failed to answer the phone only to find out that she and one of our sons were so into playing a video game together she was unable to pull herself away to answer it. Just needed to vent because it seems to help my wife who spends at least two hours on craigslist a day!</p></blockquote>\n<p><em>Photo by <a href=\"http://flickr.com/photos/integerpoet/183203849/\" target=\"_blank\">integerpoet</a>. </em></p>"
}