{"id":"1416","name":"garden-gun-magazine-nods-to-nashville","title":"Garden &amp; Gun Magazine Nods To Nashville","author":"Morgan Levy","date":"2009-01-05T11:00:00-06:00","tags":["fried","garden gun magazine","hot chicken","martin&apos;s bar-b-que joint","nolensville","pork neck bones and rice","prince&apos;s hot chicken","redneck taco","silver sands","southern food","the sands"],"categories":[],"contentEncoded":"<p style=\"text-align: center;\"><img class=\"aligncenter\" src=\"http://farm4.static.flickr.com/3172/2796201407_70f6572581.jpg\" alt=\"\"></p><p>In the current issue of <em>Garden &amp; Gun Magazine</em>, they list <a href=\"http://gardenandgun.com/article/100-southern-foods?page=0%2C0\" target=\"_blank\">100 Southern Foods You Absolutely, Positively Must Try Before You Die</a>, and Nashville is, interestingly enough, home to a whopping four, plus a couple sorta-Nashville spots too (edited at 12:40pm, thanks to Paul Nicholson for the correction). What Nashville delicacies does&#xA0;<em>Garden &amp; Gun</em> deem worthy of their list? It may come as no surprise that the Hot Fried Chicken at Prince&#x2019;s Hot Chicken Shack made the cut, but Nashville&#x2019;s other claims to fame on the list are as follows:</p><ul><li>Pork Neck Bones &#x2018;n Rice from Silver Sands</li><li>Hot Fish Sandwich at Bolton&#x2019;s Spicy Chicken Shack</li><li>Fried Green Tomatoes at Arnold&#x2019;s Country Kitchen</li><li>The Redneck Taco at Martin&#x2019;s Bar-B-Que Joint in Nolensville</li><li>Praise The Lard Biscuits at Beacon Light Tearoom in Bon Aqua</li></ul><p>And what do they have to say about these Southern delights? &#xA0;Good question.</p><blockquote><p>Hot Fried Chicken<br>Prince&#x2019;s Hot Chicken Shack<br>Nashville, Tennessee<br>I fear the apocalyptic burn of the skillet-cooked and cayenne-swabbed chicken dished by Andre Prince Jeffries the way I fear the wrath of the Lord. So should you. One taste of a Prince&#x2019;s drumstick rouses me from a twelve-pack stupor. (615-226-9442)</p></blockquote><blockquote><p>Pork Neck Bones and Rice<br>The Sands<br>Nashville, Tennessee<br>A steam-table warhorse, dishing gut-punch eats for twenty-first-century field hands, the Sands excels at pot food, like cartilaginous neck bones with a stout and soulful gravy, served over white rice or sauerkraut, sopped by buttermilk flatbread or hot-water cornbread. (615-742-1652)</p></blockquote><blockquote><p>Redneck Taco<br>Martin&#x2019;s Bar-B-Que Joint<br>Nolensville, Tennessee<br>I don&#x2019;t like the slur, but I love the sandwich. How to do it the way Pat Martin does it: Take an oversize hoecake. Pile it high with threads of hickory-smoked whole hog. Gild the whole of it with slaw and sauce. Rake in the acclaim. (martinsbbqjoint.com; 615-776-1856)</p></blockquote><blockquote><p>Hot Fish Sandwich<br>Bolton&#x2019;s Spicy Chicken and Fish<br>Nashville, Tennessee<br>Most hot-fish vendors fry whiting fillets, stack them on mustard-swabbed white bread, pile on pickle and onion slices, and dribble hot sauce. But Bolton Matthews and Dollye Ingram drag their fish through a hail of &#x201C;secret&#x201D; spices that taste suspiciously like straight-up cayenne. Sniff before you bite, and a six-sneeze fit follows.</p></blockquote><blockquote><p>Fried Green Tomatoes<br>Arnold&#x2019;s Country Kitchen<br>Nashville, Tennessee<br>That&#x2019;s craggy Jack Arnold, wearing a foulard bow tie and overalls, shuttling pans of collard greens from the kitchen. His wife, Rose, works the register, dealing butter pats from her cornbread deck, pouring sweet tea by the gallon. Kahlil, their son, a hipster with a megawatt smile, runs his knife through a haunch of garlic-studded roast beef, draping slices onto plates heaped with creamed potatoes and braised collards, spooning oily jus over all. Set in a cinderblock building on the industrial fringe of downtown Nashville, the Arnold family restaurant sets the standard for Southern meat-n-threes. Button-down bureaucrats on a break from paper pushing. Tar-splattered roofers. Bed-headed Vanderbilt coeds craving a taste of home. All slide their trays along the steam-table track, angling for an order of herb-battered fried green tomatoes. Fresh from the oil, sour-sweet, and brittle as can be, they taste like indictments of the lowest-common-denominator norm. (615-256-4455)</p></blockquote><blockquote><div class=\"dsq-comment-body\"><div id=\"dsq-comment-message-4913760\">Praise the Lard Biscuits<br>Beacon Light Tea Room<br>Bon Aqua, Tennessee<br>They stew down preserves every week, apple in the fall, blueberry in the summer. Preserves, however, are mere gilding for the biscuits. Silver dollar size and lard cut, they arrive, six to the order, in wicker baskets, begging to be ravished with butter. (931-670-3880)</div></div></blockquote><div>We&#x2019;ve only tried Prince&#x2019;s and Bolton&#x2019;s &#x2013; Can anyone testify to these other dishes&#x2019; greatness?</div><div><em>Photo by </em><a href=\"http://flickr.com/photos/morganlevy/2796201407/\" target=\"_blank\"><em>morganlevy</em></a><em>.</em></div>"}