{
 "id": "1471",
 "name": "this-weekend-its-all-women-all-the-time-you-wish",
 "title": "This Weekend: It&#x2019;s All Women, All The Time [You Wish]",
 "author": "Morgan Levy",
 "date": "2009-01-21T11:00:00-06:00",
 "tags": [
  "all about women",
  "nashville convention center"
 ],
 "categories": [],
 "contentEncoded": "<p style=\"text-align: center;\"><img class=\"aligncenter\" src=\"http://i43.tinypic.com/2afcp5f.jpg\" alt=\"\"></p>\n<p>This Saturday, all ladies of Middle Tennessee are invited to the free <a href=\"http://allaboutwomentn.org/\" target=\"_blank\">All About Women</a> conference/event/experience-ish thingy at the Nashville Convention Center. Women of all ages are can take a break from the toils of their daily lives (whatever they may be) and learn how to fix a toilet. No, seriously, there are definitely classes on how to fix a toilet at this thing. Thankfully, women seeking some <em>real</em> relaxing (ix-nay on the oilet-tay ixing-fay) can participate in a long list of mildly entertaining activities and performances (and a few more that are a real drag). Straight from the press release&#x2026;<em>mostly</em>:</p>\n<ul style=\"margin-top: 0in;\" type=\"disc\">\n<li><strong>Divabetics</strong>,      a pop music-style diabetes education stage show, featuring fun      &#x201C;Boalicious&#x201D; and &#x201C;Chair Cha Cha&#x201D; workouts, healthy      lifestyle tips, interactive games, diabetes education and prize giveaways.</li>\n<li><strong>Cancer      Queens</strong>, a cancer prevention musical revue.</li>\n<li><strong>Ms      Cheap,</strong> aka Mary Hance, with creative tips for frugal living.</li>\n<li><strong>WKRN-Channel      2&#x2019;s Lisa Patton</strong>, hosts an evening program for young women.</li>\n<li><strong>Vanderbilt Medical Center&#x2019;s Highway To Health</strong>, with glucose, cholesterol, blood pressure, BMI, CO, eye screening and more.</li>\n<li><strong>All About Health</strong>, with local business providing a variety of services such as medical consultations, skin and carpal tunnel analysis,&#xA0; pressure point exams, spinal assessments , hand facials, foot therapy, zero gravity massage and pain relief. <em>Did someone say massage?</em></li>\n<li><strong>Up There, Down There Stage</strong>, which we&#x2019;ll leave to your imagination. Dead serious. Okay, we can&#x2019;t resist: &#x201C;The Up There, Down There stage will allow women to ask the experts about everything &#x2018;up there&#x2019; and &#x2018;down there,&#x2019; such as Matters of the Heart, Bedroom Basics (sleep and sex), Aging Beautifully and &#x2018;I&#x2019;d like to buy a B&#x2019; (bowel and bladder).&#x201D; Ooooookay.</li>\n<li><strong>All About Home with Home Depot</strong>, where ladies will get to lay tile, caulk and weatherstrip, patch and paint, repair a toilet, install a faucet, gain basic knowledge of tools and the skills necessary to use them safely, learn how to switch 2-prong outlets to 3-prong outlets and install window security. Yay!</li>\n<li><strong>Mamas World</strong>, where mothers can discover if they are smarter than other mothers, win free kiddie books and some other child development stuff.</li>\n<li> <strong>The Men&#x2019;s Health Network will be on hand to help explain, well, men. </strong>&#x2018;Nuff said.</li>\n<li><strong>All About Life</strong>, with financial management classes and resources, DUI goggle fittings, circuit training with Curves, personal fire escape plans, etc, etc, etc.</li>\n<li><strong>All About Me</strong>, where ladies can WORK OUT! Participate In Zumba, Hip Hop Funk, Boa Blast workout, Abs, Yoga for the Rest of Us, Hula Hoops and more on the Active Lifestyles stage. There will also be resume and interview workshops, and some stress-relief stuff. The end!</li>\n</ul>\n<p>It&#x2019;s your call. We figure that wandering around the place couldn&#x2019;t hurt anything, as long as you skip the workouts and the caulking&#x2026; Or maybe that&#x2019;s even your thing! Everything is free (even parking), so hit up the Nashville Convention Center between 9am-9pm on Saturday to check it out. A full schedule of classes and performances is <a href=\"http://allaboutwomentn.org/index.php?option=com_content&amp;view=article&amp;id=9&amp;Itemid=14\" target=\"_blank\">here</a>, and the rest of the events will be happening all day.</p>"
}