{"id":"1474","name":"election-madness-part-deux-get-out-and-vote-english-only","title":"Election Madness, Part Deux: Get Out And Vote! [English Only]","author":"Christy Frink","date":"2009-01-22T06:30:00-06:00","tags":["english first","english only","eric crafton","nashville english","special election"],"categories":[],"contentEncoded":"<p style=\"text-align: center;\"><a href=\"http://flickr.com/photos/buschap/2260006019/\" target=\"_blank\"><img class=\"aligncenter\" src=\"http://farm3.static.flickr.com/2183/2260006019_32a967d584.jpg?v=0\" alt=\"\"></a></p><p>Today&#x2019;s the big election day for the English Only special ballot initiative, so be sure to take advantage of it this morning since you probably chipped in for the $350K it&#x2019;s costing us to have it in the first place. Polls open at 7am today and will remain open until 7pm, which means you&#x2019;ve got plenty of time to swing by after work if you&#x2019;re not into the morning thing. You&#x2019;ll be voting at your assigned polling place (the same one you went to for the Presidential Election if you didn&#x2019;t early-vote) and if you&#x2019;re unsure, you can find out where you&#x2019;re registered from the <a href=\"http://www.nashville.gov/VOTE/\">Davidson County Election Commission,</a> which also provides the full text of both amendments. For those looking to dig a little deeper, check out <a href=\"http://www.nashvilleenglishfirst.com/\">Nashville English First</a> (the folks behind the initiatives) and <a href=\"http://www.nashvilleforallofus.org\" target=\"_blank\">Nashville For All Of Us</a> (a coalition of organizations and businesses who oppose them) for more detailed information and analyses.</p><p>If you notice anything funky going on at the polls (and it does happen from time to time), contact the legal hotline immediately at 238-6300. Translation issues should be directed to the Tennessee Immigrant and Refugee Rights Coalition at 414-1030.</p><p>Happy voting!</p><p><em>Photo by <a href=\"http://flickr.com/photos/buschap/2260006019/\" target=\"_blank\">buschap</a>.</em></p>"}