{
 "id": "1571",
 "name": "why-not-wine-wheres-our-two-buck-chuck",
 "title": "Why Not Wine: Where&#x2019;s Our Two Buck Chuck?",
 "author": "Morgan Levy",
 "date": "2009-03-02T11:00:00-06:00",
 "tags": [
  "grace&apos;s plaza wine and spirits",
  "red white and food",
  "tn alcohol laws",
  "trader joe&apos;s",
  "two buck chuck",
  "why not wine",
  "wine in grocery stores",
  "wine legislation",
  "wine shoppe at green hills"
 ],
 "categories": [],
 "contentEncoded": "<p><img class=\"alignleft\" style=\"margin: 5px; float: left;\" src=\"http://i44.tinypic.com/2uzs5ev.jpg\" alt=\"\">We admit it, we felt the sting of Tennessee&#x2019;s current alcohol legislation a little harsher than usual when Trader Joe&#x2019;s opened across the street from the Nashvillest HQ, painfully vacant of that 8th-wonder-of-the-world, Two Buck Chuck, and we know that many of our readers felt the same bitter pain. While it&#x2019;s fun to sit around and whine about it on the internet, there are some other options that are more fun AND productive. Today is <a href=\"http://redwhiteandfood.wordpress.com/\" target=\"_blank\"><em>Red White and Food Blog Day</em></a>, so if you&#x2019;re passionate about bringing wine to grocery stores in Tennessee, jump on board! Red White and Food has a <a href=\"http://www.redwhiteandfood.com/contests\" target=\"_blank\">bunch of fun things</a> happening on ye olde internets, and they make it easy to get involved in the campaign.</p>\n<p>Of course, we know that not everyone thinks that wine in grocery stores is a good idea. Check out the <a href=\"http://www.stopteendrinkingtn.org/about.aspx\" target=\"_blank\">major</a> <a href=\"http://www.twsra.com/\" target=\"_blank\">opposition</a> and make your own call. And even if legislation changes to allow wine into grocery stores, we always encourage our readers to support local businesses. The experts at the <a href=\"http://www.getfinewine.com/\" target=\"_blank\">Wine Shoppe At Green Hills</a> and <a href=\"http://www.graceswine.com/\" target=\"_blank\">Grace&#x2019;s Plaza Wine &amp; Spirits</a> are our favorites, and they can sure pick out a heckuva bottle of wine. No grocery store in town could ever fill that special wine-y place in our hearts quite like they do.</p>"
}