{
 "id": "1574",
 "name": "saving-local-arts-why-we-need-tennessee-rep-bailouts",
 "title": "Saving Local Arts: Why We Need Tennessee Rep [Bailouts]",
 "author": "Christy Frink",
 "date": "2009-03-03T11:24:00-06:00",
 "tags": [
  "arts",
  "bailout",
  "local theater",
  "tennessee rep",
  "tennessee repertory theater",
  "tpac"
 ],
 "categories": [],
 "contentEncoded": "<p style=\"text-align: center;\"><a href=\"http://flickr.com/photos/edificewrecks/3275603798/\" target=\"_blank\"><img class=\"aligncenter\" src=\"http://farm4.static.flickr.com/3467/3275603798_feb135e58a.jpg?v=0\" alt=\"\" width=\"472\" height=\"472\"></a></p>\n<p>We definitely can&#x2019;t claim to be theater buffs around here, but we&#x2019;ll never forget the folks who gave us our first taste of Nashville&#x2019;s local professional theater scene: the <a href=\"http://www.tennesseerep.org/\" target=\"_blank\">Tennessee Repertory Theater</a>. Back in October, the Rep began a series of <a href=\"http://www.tennesseerep.org/lookin.php\" target=\"_blank\">look-ins, or sneak peeks</a>, for their shows which <a href=\"http://nashvillest.com/2008/10/03/this-weekend-sweeney-todd-opens-at-tpac/\" target=\"_blank\">gave the community a chance to pull back the curtains and see what really goes into making a theater production happen</a>. A few weeks before the opening night of <em>Sweeney Todd</em>, we headed over to the NPT&#x2019;s studio A to hear from the director, see the costumes, take in a few scenes while they were still in rehearsal, and even see the infamous (and fully functional) Barber Chair up close. And when opening night rolled around at TPAC, we were able to watch the show like we actually knew what we were doing.</p>\n<p>That said, the Tennessee Rep (like all of us) is feeling the crunch of the economy and is <a href=\"http://www.tennesseerep.org/challenge_grant.php\" target=\"_blank\">at risk of having to shut things down completely</a>. We don&#x2019;t make many pleas here at Nashvillest, but this one hits pretty close to home.&#xA0; Local theater and arts, though maybe not as familiar, is as much a part of the Nashville fabric as coffeehouses, country music, and Jack Daniel&#x2019;s. <strong>In order to keep it going, an anonymous donor has offered up $100,000 to save the Rep if they&#x2019;re able to raise the other $100,000.</strong> So far we&#x2019;ve seen local businesses chipping in, folks offering to match others&#x2019; donations, and tons of members of the local arts community pulling together in every way to try and make this happen.</p>\n<p>Even though we&#x2019;re all pretty broke right now, <a href=\"http://www.tennesseerep.org/challenge_grant.php\" target=\"_blank\">we hope you&#x2019;ll consider giving a few bucks</a> to salvage one of the most lovable parts of Nashville. We know we will.</p>\n<p><em>Photo by <a href=\"http://flickr.com/photos/edificewrecks/3275603798/\" target=\"_blank\">s. reilly</a>.</em></p>"
}