{
 "id": "1687",
 "name": "nashvillest-guide-to-dining-out-doing-it-cheap",
 "title": "Nashvillest Guide To Dining Out &amp; Doing It Cheap",
 "author": "Morgan Levy",
 "date": "2009-04-08T15:00:00-05:00",
 "tags": [
  "50% off",
  "budget",
  "cheap",
  "copper kettle",
  "dining out",
  "discount gift cards",
  "discount gift certificates",
  "food &amp; dining",
  "half price",
  "nashville restaurants",
  "urban flats"
 ],
 "categories": [],
 "contentEncoded": "<p style=\"text-align: center;\"><img class=\"aligncenter\" src=\"http://farm1.static.flickr.com/123/414577345_bdbd1e1cb9.jpg\" alt=\"\"></p>\n<p>Though there are many websites that exist to help cut dining costs by passing out tips &amp; pointers on what foods to order, what times to visit, what coupons to bring, what specials to request and what entrees to split, that&#x2019;s just not us. We&#x2019;re all about pinching pennies, but we like to enjoy a great meal out a few times a week. Fortunately for us, it&#x2019;s pretty easy in Nashville to get a completely satisfying meal at some of our favorite places at up to half the price, without scrimping and cutting corners and sharing your delicious morsels of food. And we&#x2019;re going to tell you how. We&#x2019;ve covered some of these sites before (<a href=\"http://nashvillest.com/2009/01/15/wkrn-offers-cheapo-eats-and-other-sundry-services/\" target=\"_blank\">here</a> and <a href=\"http://nashvillest.com/2008/12/05/super-cheap-eats-from-clear-channel/\" target=\"_blank\">here</a>), but we&#x2019;re rounding it all up and slapping together a quick Nashvillest Guide To Dining Out &amp; Doing It Cheap.&#xA0;</p>\n<p><strong><a href=\"http://halfoffdepot.com/nashville/\" target=\"_blank\">Half Off Depot</a></strong>: Our new favorite of the bunch, Half Off Depot has half price gift certificates to the new Gulch hotspot Urban Flats, as well as half price gift certificates for the Copper Kettle. Who could turn that down?</p>\n<p><strong><a href=\"http://tennessean.myshopify.com/\" target=\"_blank\">Crave &amp; Save</a></strong>: <em>The Tennessean</em>&#x2018;s half-off spot on the internet. Current deals are a little on the random side, such as half off some hotels, spas, and indoor rock climbing facilities. Oh, and half off gift certificates to the Nashville Palace. Wow.&#xA0;</p>\n<p><a href=\"http://wkrn.halfoffnashville.com/\" target=\"_blank\"><strong>Half-Off Nashville Thursday</strong></a>:&#xA0;Local ABC affiliate WKRN offers half-price gift certificates for a variety of local dining and services. Current deals include half price at several spas, Woody&#x2019;s Steakhouse, Cafe Coco&#x2019;s Italian Market and more. New deals may become available on Thursday mornings.&#xA0;</p>\n<p><strong><a href=\"http://www.nashvillegreatdeals.com/intro.php\" target=\"_blank\">Clear Channel Nashville Great Deals</a></strong>: Current half price deals include the Nashville Zoo and McFaddens, among others.&#xA0;</p>\n<p><strong><a href=\"http://www.riverrewards.com/intro.php\" target=\"_blank\">River Rewards</a></strong>: Half price deals from 107.5 The River&#x2019;s Woody &amp; Jim, current specials include Woody&#x2019;s Steakhouse, NYNY Pizza, Peabody Corner Marketplace and more. New deals may become available on Friday mornings.&#xA0;</p>\n<p><a href=\"http://www.gerryshalfoff.com/intro.php\" target=\"_blank\"><strong>Gerry&#x2019;s Half Off</strong></a>: Coming up, we&#x2019;re looking at half price Blue Coast Burrito, Maggie Moos and Fulin&#x2019;s gift certificates, which is pretty much our dream collection of half price gift certificates. New deals may become available on Friday mornings.&#xA0;</p>\n<p><strong><a href=\"http://www.originalsgc.com/Merchant2/merchant.mv?Screen=CTGY&amp;Store_Code=originals&amp;Category_Code=12009nash25x\" target=\"_blank\">Nashville Originals</a></strong>: Four times a year, Nashville Originals (aka the best of the best) holds a discount gift certificate sale where lucky earlybirds can score 30-40% off gift certificates on the absolute best dining that Nashville has to offer. We love those sweet moments four times a year.&#xA0;</p>\n<p><strong><a href=\"http://www.focusnashville.com/focus_participant/7_1_0.cfm\" target=\"_blank\">Focus Nashville</a></strong>: Where they pay you to sit in a room and eat fast food. Seriously, if you&#x2019;re down with being a guinea pig, sign up with Focus Nashville and they&#x2019;ll call on you for a variety of food-related studies, which usually involve you getting free food and a tidy little paycheck on top of it. <em>Thanks to Chris C. for the tip</em>!</p>\n<p><a href=\"http://www.nashvillecitipass.com/\" target=\"_blank\"><strong>Nashville CitiPass</strong></a><strong> &amp; </strong><a href=\"http://www.entertainment-savings-offers.com/nashville/book/\" target=\"_blank\"><strong>Nashville Entertainment Book</strong></a>: If you&#x2019;re a diligent coupon-user who frequently dines with at least one other person, these books are perfect. Containing mostly buy-one-get-one-free coupons for entrees at hundreds of local &amp; chain businesses, you&#x2019;ll save what you spent on the book after using just one or two coupons. We love &#x2019;em!</p>\n<p><strong><a href=\"http://www.restaurant.com/rdc_site.net/listings.aspx?StateID=&amp;zip=37215&amp;x=0&amp;y=0\" target=\"_blank\">Restaurant.com</a></strong>: The steepest of discounts, but the slimmest of pickings. Restaurant.com can be quite the hassle, but once you get the hang of reading the fine print and figuring out what works, gift certificates valued at more than double the price for $3-$10 is something we could get used to. Most certificates are only valid during certain hours, on certain things, and definitely don&#x2019;t include tips or tax or alcohol, so pay attention. Do a quick google search before you order and you&#x2019;re likely to find that you can get your $3-$10 gift certificate for up to 80% off.&#xA0;</p>\n<p><em>Photo by </em><a href=\"http://www.flickr.com/photos/toastforbrekkie/414577345/\" target=\"_blank\"><em>toastforbrekkie</em></a><em>.</em></p>"
}