{
 "id": "1714",
 "name": "landing-at-the-perch-new-coffee-crepery-in-brentwood",
 "title": "Landing At The Perch, New Coffee &amp; Crepery In Brentwood",
 "author": "Morgan Levy",
 "date": "2009-04-14T07:59:00-05:00",
 "tags": [
  "brentwood",
  "crepes",
  "franklin rd",
  "grand opening",
  "heather chandler kressaty",
  "independent coffee shop",
  "john kressaty",
  "leopard forest zimbabwean coffee",
  "old hickory blvd",
  "starbucks",
  "the perch",
  "the skin bar",
  "williamson county"
 ],
 "categories": [],
 "contentEncoded": "<p style=\"text-align: center;\"><img src=\"http://i40.tinypic.com/30vnknm.jpg\" alt=\"\" width=\"500\" height=\"340\"></p>\n<p>We dropped in at tiny new Brentwood coffee shop <a href=\"http://twitter.com/ThePerchTN\" target=\"_blank\">The Perch</a> yesterday morning, to see if they could stack up to our other local favorites (which is a tall order indeed). Upon stepping in and asking a few questions, we realized that they&#x2019;ve got something very different going on, and it&#x2019;s not just because they&#x2019;re the only independent coffee shop in the Brentwood area. And you know how much we love lists! So without further ado, a list of 4 Reasons Why The Perch Is Different And We Love It:</p>\n<p>1. <strong>They make crepes</strong>. A brand new addition as of this past Thursday, The Perch offers several different crepes in both sweet and savory variations. We were tempted by the mention of nutella, but decided to save the crepes for our next trip.</p>\n<p>2. <strong>They brew Leopard Forest Zimbabwean coffee</strong>, which comes straight from the sustainable farm in Zimbabwe, goes directly to a roaster in South Carolina, and arrives on The Perch&#x2019;s doorstep the very next day after roasting. With brews dubbed &#x201C;Total Eclipse,&#x201D; &#x201C;Scottish Truffle&#x201D; and &#x201C;Zimbabwean Peaberry&#x201D; (among others), the Leopard Forest coffee is just a little pinch of something different. And by &#x201C;pinch,&#x201D; we mean that The Perch is the only coffee shop in Tennessee that carries this coffee.</p>\n<p>3. <strong>They&#x2019;re not Starbucks</strong>. We&#x2019;ve spent a considerable amount of our days in the Brentwood locale, and until now the only option for coffee outside of a cubicle was Starbucks. Now, a Starbucks signature drink may be your thing&#x2026; So hop on over to The Perch, where a room full of ex-Starbucks employees can probably whip it up for you, but they just might convince you to try one of their tasty-sounding signature drinks. We&#x2019;re talking about creative combinations of every flavor imaginable, from &#x201C;Best Chocolate Bar, EVER&#x201D; (chocolate, caramel, toffee nut) to &#x201C;Orange Creamsicle&#x201D; (candied orange and white chocolate) to &#x201C;White Lightning&#x201D; (vanilla with no less than four shots of espresso).</p>\n<p>4. <strong>They&#x2019;re cheap</strong>. People, a double americano cost $1.53 including tax. Need we say more?</p>\n<p>We won&#x2019;t go through the fuss of making a list about the things we don&#x2019;t like about The Perch&#x2026; Namely because there aren&#x2019;t enough. But we did immediately notice the sparse amount of seating, a problem which owner John Kressaty plans to remedy by incorporating a front porch, adding a few more tables inside when business picks up, and even expanding through the wall into an extra room next door in The Skin Bar (a business which he and his wife, Heather Chandler-Kressaty, started about two years ago).</p>\n<p>Expect a grand opening celebration at The Perch early this summer, but don&#x2019;t wait &#x2019;till then to drop in. They&#x2019;ve already expanded their hours due to popular demand, which certainly says something good about the two-week-old coffee shop.</p>\n<p><em>The Perch is located at 117A Franklin Rd. in Brentwood, right past the intersection of Old Hickory, and their hours are Monday-Friday 6:30am-5pm and Saturday, 8am-4pm. </em></p>"
}