{
 "id": "1734",
 "name": "tales-from-the-nashville-film-fest-how-william-shatners-gonzo-ballet-stole-our-hearts",
 "title": "Tales From The Nashville Film Fest: How William Shatner&#x2019;s Gonzo Ballet Stole Our Hearts",
 "author": "Christy Frink",
 "date": "2009-04-18T21:23:00-05:00",
 "tags": [
  "andrew swant",
  "ben folds",
  "bobby ciraldo",
  "gonzo ballet",
  "henry rollins",
  "margo sappington",
  "milwaukee ballet",
  "naff09",
  "nashville film festival",
  "pat buckley",
  "william shatner"
 ],
 "categories": [],
 "contentEncoded": "<p><object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" width=\"400\" height=\"300\" codebase=\"http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0\"><param name=\"flashvars\" value=\"offsite=true&amp;lang=en-us&amp;page_show_url=%2Fphotos%2Fnashvillest%2Fsets%2F72157617010034096%2Fshow%2F&amp;page_show_back_url=%2Fphotos%2Fnashvillest%2Fsets%2F72157617010034096%2F&amp;set_id=72157617010034096&amp;jump_to=\"><param name=\"allowFullScreen\" value=\"true\"><param name=\"src\" value=\"http://www.flickr.com/apps/slideshow/show.swf?v=70933\"><embed type=\"application/x-shockwave-flash\" width=\"400\" height=\"300\" src=\"http://www.flickr.com/apps/slideshow/show.swf?v=70933\" allowfullscreen=\"true\" flashvars=\"offsite=true&amp;lang=en-us&amp;page_show_url=%2Fphotos%2Fnashvillest%2Fsets%2F72157617010034096%2Fshow%2F&amp;page_show_back_url=%2Fphotos%2Fnashvillest%2Fsets%2F72157617010034096%2F&amp;set_id=72157617010034096&amp;jump_to=\"></object></p>\n<p>On Friday night, your Nashvillest editors had the chance to spend the evening with William Shatner at the premiere for <em>William Shatner&#x2019;s Gonzo Ballet</em>&#x2013;a documentary about, well, ballet and Shatner. Though we&#x2019;re not the biggest ballet fans in the world, we do remember rocking out to Shatner&#x2019;s <em>Has Been</em> record in the dorm room when it first came out in 2004 and we were pretty excited when we heard he&#x2019;d be here in town for the <a href=\"http://www.nashvillefilmfestival.org/\" target=\"_blank\">Nashville Film Festival</a>.</p>\n<p>The premise for the film is pretty simple: Choreographer Margo Sappington created the ballet <em>Common People</em> set to six of the tracks from William Shatner&#x2019;s spoken word album Has Been and had it performed by the Milwaukee Ballet. Directors Pat Buckley, Bobby Ciraldo, and Andrew Swant take viewers behind the scenes to figure out why Sappington chose this record as the backdrop for a ballet, how it all came together, and probably most interestingly, what drove Shatner to make such a weird record in the first place. A Ben Folds collaboration? A Pulp cover? An entire track of Shatner and Henry Rollins screaming at each other? With ballet? The explanation has to be good.</p>\n<p><span id=\"more-1734\"></span>The documentary dissects the ballet one song at a time beginning with opening number &#x201C;Common People.&#x201D; Sappington gives us some insight into the creative process, performers rave about how fun it was to dance around to William Shatner for a few months, Ben Folds and Henry Rollins talk about what it&#x2019;s like to work with Shatner, but nothing grabbed our ears and hearts quite like Shatner himself. Throughout the film, Shatner tells the stories behind the songs like no one else can, ranging from hilarious to downright endearing. We hear tales of one night stands, conversations on park benches, loving and losing, being famous, and fizzling out into a has-been.</p>\n<p>Through all the charismatic storytelling, one common theme emerges: William Shatner savors everything in life, no matter how awesome or ugly. He enjoys being old as much as he liked being young, and he&#x2019;s alright with his has-been status because &#x201C;everyone&#x2019;s got to stop doing something sometime, even if you just die!&#x201D; No matter how hard we&#x2019;ve laughed at him and his dumb Priceline commercials over the years, he&#x2019;s probably laughed harder. Basically, if life dares to give William Shatner any lemons, he&#x2019;ll make one hell of a glass of lemonade. And if this is the stuff that makes up <em>Has Been</em>, no wonder we loved it so much.</p>\n<p>With a philosophy like that, it only makes sense that Sappington would want to draw out all the energy, feeling, and vivaciousness and translate it into a dynamic, living artform. Spliced between the interview segments are beautifully-filmed excerpts from the ballet itself, demonstrating just how well the dance really does enhance the narrative of the album. It&#x2019;s intimate, it&#x2019;s genuine, and it gives us one thing we weren&#x2019;t really expecting from a washed-up former Captain Kirk: Inspiration.</p>\n<p>Overall, Nashvillest gives it two thumbs up. We&#x2019;re not sure when it&#x2019;ll become available on DVD, but you&#x2019;ll definitely want to keep an eye out as it travels around the film festival circuit.</p>\n<p><em>Photos by <a href=\"http://www.flickr.com/photos/nashvillest/sets/72157617010034096/\" target=\"_blank\">us</a>!</em></p>"
}