{
 "id": "1750",
 "name": "nashvillest-psa-that-parking-lot-in-back-of-the-pancake-pantry-charges-for-parking-now-sort-of",
 "title": "Nashvillest PSA: That Parking Lot In Back Of The Pancake Pantry Charges For Parking Now, Sort Of",
 "author": "Morgan Levy",
 "date": "2009-04-22T15:18:00-05:00",
 "tags": [
  "free parking",
  "hillsboro village",
  "nashvillest psa",
  "paid parking",
  "pancake pantry",
  "parking lot",
  "parking tickets",
  "value parking"
 ],
 "categories": [],
 "contentEncoded": "<p style=\"text-align: center;\"><img class=\"aligncenter\" src=\"http://farm1.static.flickr.com/43/108250707_f83d2a395d.jpg\" alt=\"\"></p>\n<p>We&#x2019;ve been informed that it is our duty to tell you that the free parking lot in back of the Pancake Pantry in Hillsboro Village is no longer free, sort of. The first 45 minutes are still free, but you have to print out a parking receipt from the brand new shiny machine and display it on your dash, similar to the lots with pay stations downtown. With several readers complaining about tickets already, we figured y&#x2019;all might want to know.</p>\n<p>And if you&#x2019;ve already found yourself stuck with a parking ticket, it sounds like <a href=\"http://www.valueparking.net/id10.html\" target=\"_blank\">Value Parking</a> might NOT be The Evilest Parking Company Of All Time. <a href=\"http://www.valueparking.net/id10.html\" target=\"_blank\">They actually sound relatively understanding</a>:</p>\n<blockquote><p><em>Did you receive a violation notice at the Hill Lot, even though you were parked there for a brief time?&#xA0; Or did you not realize that even though the first 45 minutes are free, you still need to have a receipt from the paystation on your dashboard? </em></p>\n<p><em>That&#x2019;s OK &#x2026; we don&#x2019;t penalize our patrons for honest mistakes.&#xA0; Please contact us if you wish to dispute a violation.</em></p></blockquote>\n<p>Seems that there&#x2019;s a glimmer of hope after all. But next time, just read the big sign in the parking lot, okay?</p>\n<p><em>Photo by <a href=\"http://www.flickr.com/photos/rknickme/108250707/\" target=\"_blank\">rknickme</a>.</em></p>"
}