{"id":"1758","name":"mayor-deans-long-boring-speech-explained-state-of-metro","title":"Mayor Dean&#x2019;s Long &amp; Boring Speech Explained [State Of Metro]","author":"Christy Frink","date":"2009-04-23T19:56:00-05:00","tags":["Add new tag","bikeways","convention center","green","green ribbon committee","greenways","karl dean","keith urban","leed","metro nashville public school","mnps","nclb","nicold kidman","no child left behind","pedestrian","police precints","revenue","riverfront","state of metro","walkways"],"categories":[],"contentEncoded":"<p><img class=\"alignleft size-full wp-image-1759\" style=\"border: 0pt none; margin: 3px; float: left;\" title=\"img_4976\" src=\"http://nashvillest.com/wp-content/uploads/2009/04/img_4976.jpg\" alt=\"\" width=\"239\" height=\"295\">Today, Mayor Dean gave the annual State of Metro address out in front of the new bus terminal on Charlotte, joined by the likes of Keith Urban and some girl doing sign language. We understand that most of you don&#x2019;t have 30 minutes to sit around and watch our fearless leader Mayor Karl Dean wax poetic about what&#x2019;s going on in our city or maybe you just lack the attention span. Either way, we at Nashvillest like to know what&#x2019;s in store for Music City in the coming year, so we&#x2019;ve boiled it down to the highlights.</p><p><span id=\"more-1758\"></span> First of all, any city whose State of Metro address boasts Keith Urban as an opening act is alright with us. And any Australian country star who cracks jokes mid-song about that new convention center that everyone&#x2019;s been fighting about is also alright with us. All that aside, Dean started right off by telling us one thing we already knew: The economy seriously sucks. Revenue is down, everyone including the city is broke, and we&#x2019;ll be making cuts in every area of Metro government this year. He promised, however, that we definitely won&#x2019;t be seeing an increase in property tax no matter how bad things get. We&#x2019;ll see how that holds up.</p><p>As for the rest:</p><ul><li>Madison and southeast Nashville, respectively, will be getting two new police precincts which they apparently really needed judging by all the cheering. Good news is that our crime rates are the lowest they&#x2019;ve been in 20 years.</li><li>Metro will be funding the construction of a &#x201C;28th Avenue connector&#x201D; that kind of intrigues us. Eventually it should connect Baptist Hospital to Fisk, TSU, and Meharry and also Centennial Park to Hadley.</li><li>There will be riverfront development, and it won&#x2019;t just happen on the East Bank. But maybe most of it will happen on the East Bank. We think.</li><li>Mayor Dean wants to make Nashville the greenest city in the southeast by following some of the recommendations given to him in that <a href=\"http://www.nashville.gov/mayor/green%5Fribbon/docs/summary_report_0904.pdf\" target=\"_blank\">gigantic report by the Green Ribbon Committee</a> last week. First things first, though- Howard School will be the first Metro building to get completely retrofitted and LEED certified, which will be happening to all of Metro&#x2019;s buildings over the next few years. Also, Peeler and Warner parks will be expanding once they can buy up some more land. This sounds like it&#x2019;ll be part of the effort to get us some more green space, along with more greenways&#x2013;a problem for which they&#x2019;ve hired some private consultants to help sort out.</li><li>That pesky convention center came up a few times and Mayor Dean predictably used the opportunity to reinterate his support for the initiative by telling us it&#x2019;ll bring in a ton of jobs and tourism and tax revenue. He said it should come in real handy in 2013 when it opens and the recession is (we hope!) over.</li><li>Last but not least, Metro Schools. He admitted that they pretty much suck, didn&#x2019;t express a whole lot of hope for them meeting No Child Left Behind standards now or in the future at the rate they&#x2019;re going, and hinted at some aggressive reform efforts in the works&#x2013;namely the addition of two alternative, specialized high schools, a whole slew of career-focused afterschool programs, and charter schools.</li></ul><p>Bottom line? We have a great city and we want to make it cooler so that people like Keith and Nicole will keep moving here and raving about it, but we&#x2019;ve got a lot of work to do and we don&#x2019;t have much money to do it. We&#x2019;re not sure we heard anything groundbreaking, but we&#x2019;re eager to see what the next year holds for us.</p><p><em>Photo by <a href=\"http://www.flickr.com/photos/scribebytrade/3458427438/in/set-72157617070440186/\" target=\"_blank\">scribebytrade</a>.</em></p>"}