{
 "id": "1769",
 "name": "tonight-invisible-childrens-the-rescue",
 "title": "Tonight: Invisible Children&#x2019;s THE RESCUE",
 "author": "Morgan Levy",
 "date": "2009-04-25T11:27:00-05:00",
 "tags": [
  "child soldiers",
  "global night commute",
  "invisible children",
  "joseph kony",
  "nashville invisible children",
  "peaceful demonstration",
  "the rescue",
  "uganda",
  "war"
 ],
 "categories": [],
 "contentEncoded": "<p><img class=\"alignleft\" style=\"float: left; margin: 5px;\" src=\"http://i40.tinypic.com/4q0r4z.jpg\" alt=\"\" width=\"300\" height=\"450\"></p>\n<p>Three years ago, we had the opportunity to take part in Invisible Children&#x2019;s <a href=\"http://en.wikipedia.org/wiki/Global_Night_Commute\" target=\"_blank\">Global Night Commute</a>, an evening where over 2,500 people gathered in Franklin, TN to raise awareness for the children of Uganda who must walk miles every night to sleep safely and avoid capture. The amount of participation from Nashville, Franklin, and the surrounding community was overwhelming &#x2013; We were even joined by 500 teens in formal attire, walking three miles barefoot after their high school proms to attend. Franklin&#x2019;s Global Night Commute ended up having one of the highest turnouts nationwide, second only to San Diego, where Invisible Children is headquartered.&#xA0;</p>\n<p>Tonight, they&#x2019;re doing it again. <a href=\"http://therescue.invisiblechildren.com/en/#/nashville/\" target=\"_blank\">Invisible Children&#x2019;s THE RESCUE</a>&#xA0;participants will gather across from Centennial Park at Nachez Trace and West End at 3pm to &#x201C;abduct&#x201D; themselves in solidarity with Uganda&#x2019;s abducted child soldiers. They will march to Bicentennial Mall (a 2.5 mile walk), where they will wait to be &#x201C;rescued&#x201D; until 9:30pm. Participants will then march to First Baptist Church to spend the night outside.&#xA0;This is intended to be a peaceful demonstration to media, lawmakers and other influential individuals in over 100 cities tonight.</p>\n<p>Over 500 participants are registered on Invisible Children&#x2019;s website, and over 800 have RSVP&#x2019;d on Facebook. If that&#x2019;s any indication of the numbers that will show up tonight, Nashville is well on its way to repeating the scene we saw in 2006. More info on <a href=\"http://www.facebook.com/event.php?eid=55378047073&amp;ref=ts\" target=\"_blank\">Facebook</a> for those interested in participating.</p>\n<p>&#xA0;</p>"
}