{
 "id": "1773",
 "name": "elenas-cafe-bubble-tea-in-brentwood-hooray",
 "title": "Elena&#x2019;s Cafe: Bubble Tea In Brentwood, Hooray!",
 "author": "Morgan Levy",
 "date": "2009-05-04T10:00:00-05:00",
 "tags": [
  "boba tea",
  "brentwood",
  "bubble tea in nashville",
  "chile burrito",
  "elena&apos;s cafe",
  "fat straw",
  "pearl milk tea",
  "thai tea"
 ],
 "categories": [],
 "contentEncoded": "<p style=\"text-align: center;\"><img class=\"aligncenter\" src=\"http://farm1.static.flickr.com/29/46177671_8917b46e05.jpg\" alt=\"\"></p>\n<p>We checked out <a href=\"http://www.yelp.com/biz/elenas-cafe-brentwood\" target=\"_blank\">Elena&#x2019;s Cafe</a> in Brentwood this past weekend after noticing a sign for bubble tea in front during a recent trip to the neighboring Chile Burrito. Immediately, we were disappointed that we didn&#x2019;t arrive hungry for lunch, because their menu looked incredible &#x2013; A broad selection of sandwiches, wraps, salads and lunch or dinner plates with a Russian and slightly Mediterranean flair was the theme, and a fresh plate of baklava sat on the counter, distracting us as we tried ordering bubble tea. It goes without saying that we&#x2019;ll be back as soon as possible to try the food.</p>\n<p>Elena&#x2019;s carries a wide assortment of flavors for bubble tea &amp; smoothies.&#xA0; Some of the more unusual options are red bean, bubblegum, avocado and Thai cream soda.&#xA0; After at least ten minutes of indecisiveness, we decided on Thai milk bubble tea and a more adventurous avocado bubble smoothie. Both were delicious, but the Thai tea was the clear winner. The avocado smoothie (along with many of the other flavors) is made from a powdered flavoring, leaving a slight chalky feeling in the mouth, but the Thai tea was made from a delicious concentrate.</p>\n<p>Elena&#x2019;s Cafe immediately one-ups a certain other bubble tea place in town in two big ways: Price &amp; convenience. They accept credit cards! Each size of bubble tea is $0.50 cheaper than the corresponding sizes at Fat Straw, at $2.99 for 16oz and $3.50 for 24oz. We still love Fat Straw, but we&#x2019;ve certainly found a second home for our bubble tea fix at Elena&#x2019;s.</p>\n<p><em>Photo by <a href=\"http://www.flickr.com/photos/bro0ke/46177671/\" target=\"_blank\">bro0ke</a>. Editor&#x2019;s note: Photo not of Elena&#x2019;s Cafe bubble tea.</em></p>"
}