{"id":"1799","name":"today-is-a-local-taco-day-in-sylvan-park-comings-goings","title":"Today Is The Local Taco Day In Sylvan Park [Comings &amp; Goings]","author":"Morgan Levy","date":"2009-05-04T16:37:00-05:00","tags":["comings &amp; goings","grand opening","local restaurants","sylvan park","the local taco"],"categories":[],"contentEncoded":"<p style=\"text-align: center;\"><img class=\"aligncenter\" src=\"http://i42.tinypic.com/1z5jhxz.jpg\" alt=\"\" width=\"455\" height=\"370\"></p><p><a href=\"http://thelocaltaco.com/\" target=\"_blank\">The Local Taco</a>. No, it&#x2019;s not a type of taco indigenous to Nashville (but that would definitely be interesting). It&#x2019;s a new taco hut in Sylvan Park in the former home of the neighborhood&#x2019;s beloved Goldie&#x2019;s Deli. Think SATCO&#x2019;s a la carte order-at-the-front style, but with way less frat parties and way more neighborhood get-togethers. The Local Taco specializes in an interesting fusion of old southern and simple traditional Mexican fare, and that means if you were wondering where to get barbeque in your taco (or fried chicken, shrimp, tilapia, smoked beef brisket and jalenpeno cole slaw, for that matter), The Local Taco is the place to be. In addition to tacos, there will be enchiladas, salads, sides, cheese dip and other staples.</p><p>Owner John Ko has us just about giddy with glee over his concept. He plans to use local ingredients when possible, and is committed to becoming part of the Sylvan Park neighborhood community. And when we went to try out The Local Taco this past weekend, let&#x2019;s just say that something else had us giddy with glee. Here&#x2019;s a hint: It starts with &#x201C;frozen&#x201D; and ends with &#x201C;margaritas.&#x201D; Though the space inside is limited, the freshly-remodeled building is home to an absolutely fabulous porch, and we envision many <span style=\"text-decoration: line-through;\">margaritas</span> tacos &amp; enchiladas enjoyed there in our future.</p><p>The Local Taco throws open their doors today at 4501 Murphy Road, and will be open Monday-Saturday from 10am-11pm.</p><p><em>Photo by Nashvillest.</em></p>"}