{
 "id": "1937",
 "name": "very-ugly-painting-for-sale-gems-from-the-nashville-craigslist",
 "title": "Very Ugly Painting For Sale [Gems From The Nashville Craigslist]",
 "author": "Morgan Levy",
 "date": "2009-06-16T10:30:00-05:00",
 "tags": [
  "big lots artwork",
  "columbia",
  "funny craigslist ads",
  "gems from the nashville craigslist",
  "very ugly painting for sale"
 ],
 "categories": [],
 "contentEncoded": "<p>There&#x2019;s really nothing like a Craigslist straight-shooter with a sense of humor! <em>Thanks to Shana for the submission!</em></p>\n<blockquote>\n<h3><a href=\"http://nashville.craigslist.org/art/1219901832.html\" target=\"_blank\">Very ugly painting for sale &#x2013; $75 (Columbia)</a></h3>\n<p><img src=\"http://i42.tinypic.com/2r7ugj4.jpg\" alt=\"\"></p>\n<div>I should believe in the things I put on Craigslist, but please I am not blind. You see this crap style and wonder, what kind of moron would pay $500.00 for this. Well not me, I bought it from a furniture store going out of business because my ex wife took everything and I thought the art work at Big Lots was to uppity. Why is it $75.00 you ask? The frame is well worth that + another $75. This picture is magic for a single guy, lets say you are kicking it in the club, the produce section, the Y, or anywhere else that you score. You scored and you want the lady to leave, you want to watch TV, you do not want to cuddle, talk, or even tap it again you just want to be left alone. Start talking about how this painting moves you and that the artist must be expressing the pain of a bad economy, lack of health care, or many other things that harm our existence. Start talking about how this artist is daring and that this painting will be worth a fortune one day. She will leave fast, I mean real fast.Also who ever keeps flagging this for removal stop! I am not offering to kill anyone, advertise erotic services, run over an unwanted stray animal, or offer a typing job from home that pays $3,500 a week for 10 hours work. I am selling an ugly painting that had benefit in my life and it may hold the same benefit for someone else. Unless of course you were dumb enough to fall for pick up lines that occur at the Y, the produce section, or the club and then told to leave and this brings up to many painful memories there is this arrow that points to the left on your web browser that will navigate you away from this page. Trust me, it works!<p></p>\n</div>\n</blockquote>"
}