{"id":"2523","name":"save-the-sign-vote-now-for-the-donut-dens-new-sign","title":"Save The Sign: Vote Now For The Donut Den&#x2019;s New Sign","author":"Morgan Levy","date":"2009-08-26T12:00:00-05:00","tags":["donut den","save the sign","vote for new donut den sign","where is the donut den&apos;s sign?"],"categories":[],"contentEncoded":"<p style=\"text-align: center;\"><img class=\"aligncenter\" src=\"http://i31.tinypic.com/wuow7t.jpg\" alt=\"\"></p><p>If you&#x2019;re just catching up on the whole Donut-Den-sign-debacle, you probably haven&#x2019;t driven through Green Hills recently. In place of their usual brightly-lit signature sign, the Donut Den (and every other shop in the Hillsboro Plaza) is sporting a bland white temporary sign during renovations. Word got out that the developers and owners were considering updating the sign to a more modern, &#x201C;Green Hills&#x201D; design, and all hell broke loose. Anyway, it&#x2019;s probably no secret where we stand &#x2013; We want our tacky neon sign back! Brookside Properties, the developer responsible for <span style=\"text-decoration: line-through;\">tearing down the sign in the first place</span> updates to the Hillsboro Plaza has decided to give the community a voice in the sign debate by taking a vote in the <em>Green Hills News</em>, that weekly paper that gets stuck in our ditch more often than not. The current issue can be found online <a href=\"http://www.gcanews.com/1.pdf\" target=\"_blank\">here</a>, and we&#x2019;ve included the new sign sketches in this post. While neither of these renderings appear to include fluorescent lights, we can at least get close!</p><p>To vote for your favorite sign, there are a few options. First, fax! Fax your votes to 298-1015. What&#x2019;s that? Fax is too fast, you say? Try snail mail! Mail your vote to 2323 Crestmoor Road, Nashville, TN 37215. Oh, and there&#x2019;s that other option of emailing your vote in to <a href=\"mailto:vote@gcanews.com\" target=\"_blank\">vote@gcanews.com</a>, but that would be too easy. Try calling the &#x201C;Ticked Off Hotline&#x201D; at 298-5597.&#xA0;Save the sign!</p><p><em>[Hat tip to </em><a href=\"http://blogs.nashvillescene.com/bites/2009/08/vote_in_a_rival_publication_fo.php\" target=\"_blank\">Bites</a><em> for the info.]</em></p>"}