{"id":"2861","name":"collective-buying-power-website-groupon-comes-to-nashville","title":"Collective Buying Power Website Groupon Comes To Nashville","author":"Morgan Levy","date":"2009-10-05T12:00:00-05:00","tags":["collective buying power","discount gift certificates","flyte","groupon"],"categories":["Culture &amp; Arts","Food &amp; Drink","News"],"contentEncoded":"<p><img class=\"alignleft\" style=\"margin: 5px;\" src=\"http://i35.tinypic.com/2ih1hn8.png\" alt=\"\" width=\"359\" height=\"157\">What the heck is a Groupon, you ask? Well, we&#x2019;re happy to share the info &#x2013; after all, that&#x2019;s <a href=\"http://www.groupon.com/r/uu271413\" onclick=\"javascript:pageTracker._trackPageview(&apos;/outbound/article/www.groupon.com&apos;);\" target=\"_blank\">the whole idea behind Groupon</a>. Birthed in Chicago and now making consumers in 25 cities very happy, Groupon harnesses collective buying power to bring us spectacular, city-specific deals at prices lower than we could even imagine, and they launched their first Nashville deal today. In short (er, long&#x2026;):</p><blockquote><p><a href=\"http://www.groupon.com/r/uu271413\" onclick=\"javascript:pageTracker._trackPageview(&apos;/outbound/article/www.groupon.com&apos;);\" target=\"_blank\">Groupon</a> is a combination of the words&#xA0;<em>group</em> and&#xA0;<em>coupon</em>. Each day, we offer an unbeatable deal on the best of Nashville: restaurants, spas, sporting events, theater, and more. By promising businesses a minimum number of customers, we get discounts you won&#x2019;t find anywhere else. We call it &#x201C;collective buying power&#x201D;!</p><p>If you want to get the deal, just click&#xA0;<em>BUY</em> before the offer ends at midnight. If the minimum number of people (20 for today&#x2019;s deal) sign up by the end of the day, you&#x2019;ll get a printable gift certificate in your inbox the next morning that you can use whenever you want (well, at least until the deal expires-today&#x2019;s expires in six months). If not enough people join, no one gets the deal (and you won&#x2019;t be charged), so invite your friends to make sure you get the discount!</p><p>It&#x2019;s nice to wake up to something new every day. Some people get their daily fix from desk calendars with a cute puppy and a funny caption every morning. Groupon&#xA0;is like a desk calendar, except the puppy is an unbeatable discount and the funny caption is a profound reflection on the flowers and needles growing from life&#x2019;s cactus. We selflessly share our deep insights, hoping that you will join our mob of consumers, thus strengthening our collective buying power and commanding even better deals.</p></blockquote><p>From the looks of the 182 (and counting) folks who have already cashed in on today&#x2019;s $20-for-a-$50-gift-certificate-at-Flyte Groupon deal, Nashville was ready for something like this. Sign up for daily deal notifications from Groupon <a href=\"http://www.groupon.com/r/uu271413\" onclick=\"javascript:pageTracker._trackPageview(&apos;/outbound/article/www.groupon.com&apos;);\" target=\"_blank\">here</a>, and follow <a href=\"http://www.twitter.com/grouponbna\" onclick=\"javascript:pageTracker._trackPageview(&apos;/outbound/article/www.twitter.com&apos;);\" target=\"_blank\">@GrouponBNA</a> on Twitter. And as a bonus, Groupon is really, really fun to say. Groupon!</p><p>No related posts.</p>\t\t\t\t\t\t\t\t\t\t\t<!--END .entry-content .article-->"}