{
 "id": "463",
 "name": "nashville-newcomers-ugly-mugs",
 "title": "Nashville Newcomers: Ugly Mugs",
 "author": "Morgan Levy",
 "date": "2008-06-23T15:00:00-05:00",
 "tags": [
  "coffee shops",
  "drew&apos;s brews",
  "east nashville",
  "Nashville",
  "portland brew",
  "tennessee",
  "the sugar bar",
  "ugly mugs"
 ],
 "categories": [],
 "contentEncoded": "<p><a href=\"http://nashvillest.com/wp-content/uploads/2008/06/uglymugs.jpg\"><img class=\"aligncenter size-medium wp-image-468\" title=\"Print\" src=\"http://nashvillest.com/wp-content/uploads/2008/06/uglymugs-300x284.jpg\" alt=\"\" width=\"300\" height=\"284\"></a></p>\n<p>We love us some coffee shops in Nashville. Even with dozens already established and thriving (and no, we&#x2019;re not including Starbucks in that count), there&#x2019;s always room for newcomers in our coffee scene. We&#x2019;d have to be crazy to complain about having one more excuse to get caffeinated.</p>\n<p><a href=\"http://www.uglymugsnashville.com/\" target=\"_blank\">Ugly Mugs Coffee &amp; Tea</a> is our latest excuse. We talked with them last week to get the scoop on what they have planned, and it sounds exciting. Owners Jarod and Courtney are all about creating and contributing to the local community, and they&#x2019;re bridging the cultural gaps with coffee. They&#x2019;re not going to focus on roasting or cooking in house (they will serve <a href=\"http://www.drewsbrews.com\" target=\"_blank\">Drew&#x2019;s Brews</a> and food from <a href=\"http://www.thesugarbar.com/\" target=\"_blank\">The Sugar Bar</a>). Instead, they&#x2019;re going to focus on environment &#x2013; creating a positive atmosphere for everyone. Moms with kids will have storytime in the mornings. Music fans will have a venue in the evenings. And in between, a hodgepodge of cafe seating, couches, booths, bars and benches (not to mention the free wi-fi) will accommodate the bloggers, entrepreneurs, students, businesspeople and the date nights alike.</p>\n<p>Ugly Mugs will be open 7 days a week, with later hours than some of our favorite coffee shops &#x2013; a definite plus. We&#x2019;ll let you know when they open their doors this summer, hopefully next month (and we&#x2019;ll have a Nashvillest meetup). Check out <a href=\"http://uglymugscoffeeandtea.squarespace.com/\" target=\"_blank\">their blog</a> to read more about the plans for Ugly Mugs.&#xC2;&#xA0;</p>"
}