{"id":"4799","name":"flood-faq-clearing-up-the-information-disaster-flood-2010","title":"Flood FAQ: Clearing Up The Information Disaster [Flood 2010]","author":"Morgan Levy","date":"2010-05-05T09:00:00-05:00","tags":["flood 2010","flood faq","flood help","nashville flood"],"categories":[],"contentEncoded":"<p style=\"text-align: center;\"><a href=\"http://www.flickr.com/photos/victorjames615/4576948355/\"><img class=\"aligncenter\" src=\"http://farm5.static.flickr.com/4069/4576948355_7079fc2001.jpg\" alt=\"\" width=\"500\" height=\"428\"></a></p><p><strong>Q. How can I help? I have [insert item to be donated] in my trunk and [insert shelter name] won&#x2019;t answer their phone/told me to go away! My boss is giving me the day off work but I don&#x2019;t know how to volunteer!<br></strong>A. &#xA0;March yourself on over to our post entitled <a href=\"http://nashvillest.com/2010/05/03/so-nashville-is-flooded-how-can-i-help/\" target=\"_blank\">So Nashville Is Flooded&#x2026; How Can I Help?</a> and take a look around, then call up your neighbors and friends to see if they need anything. Nashville is full of fantastic people, and they need your help. We&#x2019;ll also take this opportunity to remind you that <a href=\"http://www.hon.org/HomePage/index.php/home.html\" target=\"_blank\">Hands On Nashville</a> is heading up all official, FEMA-funded relief efforts, so <a href=\"http://www.hon.org/HomePage/index.php/home.html\" target=\"_blank\">sign up to volunteer</a> through them and you can&#x2019;t go wrong!</p><p><strong>Q. I need help! I was a victim of the flood! Where can I go? What should I do?<br></strong>A. If you are displaced and need housing, the Red Cross is operating several shelters in the immediate and outlying areas. <a href=\"http://www.middletennredcross.org/general.asp?SN=8513&amp;OP=10707&amp;IDCapitulo=78T3Z2WSK0\" target=\"_blank\">Go here</a> for a complete list. Many of the hotels in the area are willing to cut you a special deal as a victim of flooding, so just call and ask. Start with the <a href=\"http://www.starwoodhotels.com/sheraton/search/hotel_detail.html?propertyID=1236\" target=\"_blank\">Sheraton</a>. If you&#x2019;re overwhelmed with all of that, <strong>call the United Way at 2-1-1 </strong>and they&#x2019;ll hook you up. You can also apply for FEMA aid beginning Wednesday May 5 at <a href=\"http://www.DisasterAssistance.gov\" target=\"_blank\">DisasterAssistance.gov</a> or by calling 1-800-621-3362 (1-800-462-7585 for the hearing and speech impaired). These numbers will operate from 7am-10pm, 7 days a week until further notice.</p><p><strong>Q. My house is a mess&#x2026; Where do I even start on cleaning this up?<br></strong>A. &#xA0;Start with <a href=\"http://www.nchh.org/Portals/0/Contents/FloodCleanupGuide_screen_.pdf\" target=\"_blank\">this helpful guide on cleaning up a flooded home</a>. Other useful tips on cleanup can be found <a href=\"http://www.chriscrimmins.com/2010/05/02/so-my-house-flooded-now-what/\" target=\"_blank\">here</a> and <a href=\"http://www.certifiedcleaners.org/ts_storm-damage-restoration.shtml\" target=\"_blank\">here</a>, and you can find some general guidelines on dealing with mold <a href=\"http://www.epa.gov/mold/table1.html\" target=\"_blank\">here</a>. Invaluable family photos need saving? Try following the tips <a href=\"http://www.mycmsite.com/sites/susanadamson/include?pageToInclude=recoverphotos.jsp&amp;section=advice\" target=\"_blank\">here</a>. Saved stuff that needs to be stored? <a href=\"http://www.StorPlaceSelfStorage.com/\" target=\"_blank\">StorPlace Self Storage</a> will give you a free month. Most importantly, don&#x2019;t hesitate to ask for help. There is a community of people out there waiting to help you, all you have to do is ask!</p><p><strong>Q. What about the animals? Is someone taking care of them?<br></strong>A. Yes! <a href=\"http://happytaleshumane.com/wordpress/\" target=\"_blank\">Happy Tales Humane</a> in The Factory in Franklin can temporarily take in small-to-medium sized dogs of displaced homeowners. <a href=\"http://www.animalarkanimalhospital.com/\" target=\"_blank\">Animal Ark Animal Hospital</a> is doing the same for dogs and other types of pets. <a href=\"http://www.nashvillehumane.org/events/event.php?eventname=How%20Can%20I%20Help%20NHA%3Cbr%3EWith%20Flood%20Efforts?%3Cbr%3E%20Here&apos;s%20How...\" target=\"_blank\">Nashville Humane Society</a> is collecting donated pet food and supplies to distribute. <a href=\"http://www.aarf-tn.com/\" target=\"_blank\">AARF</a> in Cookeville has also offered to take in displaced animals if the need arises. And if your pet was injured, <a href=\"http://www.browndogfoundation.org/\" target=\"_blank\">Brown Dog Foundation</a> is offering up to $300 to stabilize and/or treat displaced, injured pets.</p><p><strong>Q. Oopsie&#x2026; Where can I get a free/inexpensive tetanus shot?<br></strong>A. Community centers across the city are giving free tetanus shots after 12pm every day and until at least 4pm. Go <a href=\"http://health.nashville.gov/webdocs/public_announcements/20100505tetanusclinics.htm\" target=\"_blank\">HERE</a> to find the locations.</p><p><strong>Q. How can I conserve water? I need to shower!<br></strong>A. Take a Navy shower. Seriously. Don&#x2019;t water your flowers, wash your car, do your laundry or dishes (aren&#x2019;t we all looking for an excuse to avoid chores?) and definitely don&#x2019;t get out the garden hose and start washing away debris from the flood. Conserve. Be conservative with your water usage. <a href=\"http://www.coolpeoplecare.org/feature/what-one-half-looks-like/\" target=\"_blank\">Cool People Care</a> has an entertaining and informative list of ways to help you do your part. Need more help? Great tips <a href=\"http://www.romesticity.com/2010/05/7-ways-to-conserve-more-water-than-you-even-knew-you-were-using.html\" target=\"_blank\">here</a> and <a href=\"http://www.romesticity.com/2010/05/4-more-ways-to-converse-water-ellas-addendum.html\" target=\"_blank\">here</a>. We&#x2019;re all smelly by now, no one will notice if you don&#x2019;t shower.</p><p><strong>Q. How do I get rid of all this crap in my house/yard/car/new water fixture in the backyard? When/where/how will Metro pick up flood debris?</strong><br>A. &#xA0;<a href=\"http://www.nashville.gov/pw/news/2010/100502.asp\" target=\"_blank\">Separate your crap into four piles</a> &#x2013; One for white goods and metal (appliances, etc), one for construction and demolition debris (lumber, windows, etc), another for vegetation (brush, limbs and yard waste) and yet another for household trash (including carpet). There is no current pickup schedule, but go ahead and get that stuff out by the curb. Not in the alley, not trucked over to the Metro Convenience Center, <em>by the curb</em>. If you don&#x2019;t follow the instructions, your stuff won&#x2019;t get picked up. So do what we&#x2019;re telling you to do, please. PS: If your trash or recycling bin was washed away in the flood, bag, tie and clearly label your trash and recycling (separated, of course). Then call 880-1000 for a replacement bin.</p><p><strong>Q. Is [insert name of road] closed/open?<br></strong>A. &#xA0;All interstates and most main roads have reopened, and will continue to do so as the waters recede. It&#x2019;s hard for even TDOT to keep up with the reopenings &#x2013; And that&#x2019;s a great thing, because it means our roads are reopening rapidly! Check out <a href=\"http://www.tdot.state.tn.us/tdotsmartway/default.htm\" target=\"_blank\">their closures map</a> anyway, follow @<a href=\"http://twitter.com/tn511\" target=\"_blank\">TN511</a> and @<a href=\"http://twitter.com/nashtraffic\" target=\"_blank\">NashTraffic</a> on Twitter, and try <a href=\"http://maps.nashville.gov/roadclosures/\" target=\"_blank\">Nashville.gov&#x2019;s road closures map</a> too.</p><p><strong>Q. Is there a gas shortage? I got an email forward about it, so it must be true!<br></strong>A. The truth? <strong>There will be a gas shortage&#x2026; if you create one</strong>. Some gas shipments have been delayed, but there is plenty to go around. Please don&#x2019;t panic and start hoarding gas, because <a href=\"http://nashvillest.com/2008/09/20/nashville-in-the-news-no-one-can-figure-out-this-gas-thing/\" target=\"_blank\">we all remember (and wish we could forget) the last time that happened</a>.</p><p><strong>Q. I heard they were cutting off the water supply! The same coworker that told me there was a gas shortage told me so!<br></strong>A. No. The answer is no. Unless your information is coming from Metro Water, don&#x2019;t worry about it, and certainly don&#x2019;t hoard water. Then we&#x2019;ll have a problem, and it will be your coworker&#x2019;s fault.</p><p><strong>Q. Um, Nashvillest, I emailed/tweeted you 17 minutes ago and you haven&#x2019;t replied back with an answer to my question. What gives? I need an answer! Didn&#x2019;t anyone tell you there&#x2019;s a FLOOD?<br></strong>A. We&#x2019;re just two people with full-time day jobs trying to help out this city that we love in the best way that we can. If we haven&#x2019;t replied to you, it means that we don&#x2019;t know the answer BUT we are working hard to figure it out. Don&#x2019;t hesitate to ask questions, but please be patient if we can&#x2019;t answer your question immediately. Help us out by referring your friends &amp; family to this FAQ or our <a href=\"http://nashvillest.com/2010/05/03/so-nashville-is-flooded-how-can-i-help/\" target=\"_blank\">How Can I Help?</a> post when they are in need of information.</p><p><strong>If your question isn&#x2019;t answered here (it probably isn&#x2019;t), feel free to leave it in the comments so that either us or others can help you out. </strong></p><p><em>Photo by </em><a href=\"http://www.flickr.com/photos/victorjames615/4576948355/\" target=\"_blank\"><em>Vic James Photography</em></a><em>.</em></p>"}