{"id":"4852","name":"donate-nashville-connecting-people-in-need-with-neighbors-who-care-flood-2010","title":"Donate Nashville: Connecting People In Need With Neighbors Who Care [Flood 2010]","author":"Christy Frink","date":"2010-05-08T20:12:00-05:00","tags":["centresource","cool people care","crisis","donate nashville","donations","flood 2010","nashville flood","nashville symfony","united way of metropolitan nashville"],"categories":[],"contentEncoded":"<p style=\"text-align: center;\"><a href=\"http://www.donatenashville.org\"><img class=\"aligncenter\" src=\"http://i41.tinypic.com/25ku6pv.png\" alt=\"\" width=\"472\" height=\"184\"></a></p><p style=\"text-align: left;\">Here at Nashvillest, we&#x2019;re really excited to announce the launch of a tool that we and many other volunteers in the community have worked hard to pull together this week: <a href=\"http://www.donatenashville.org\" target=\"_blank\">DonateNashville.org</a>.&#xA0;Donate Nashville is Craigslist-style online tool to connect folks who have time or resources with those who need help recovering and rebuilding.</p><p>We&#x2019;ve been absolutely floored by the outpouring of kindness from folks all over Tennessee (and really, all over the country) wanting to send supplies, donate money, or do a million other creative things. And by &#x201C;floored,&#x201D; we mean that it has become impossible for us to answer every e-mail and tweet, even though we continue to find ourselves overwhelmed and touched by each one of them. With this new project, we&#x2019;re aiming to create searchable database of disaster-relief supplies, volunteers and requests for help. Donate Nashville brings together members of the Nashville community in real time to meet the most practical of each other&#x2019;s needs &#x2013; one connection at a time.</p><p>The site is focused on two basic things: &#x201C;<strong>I Need</strong>&#x201D; and &#x201C;<strong>I Have</strong>&#x201D;:</p><ul><li><strong>I Need</strong>: Users who are in need of a hand or      material donations can list those needs. Volunteer requests can be entered      by date, time, neighborhood and number of volunteers, and can be searched      by volunteers willing to help during a specific date and time. Material      donations can be entered, allowing users to first search the database to      make an instant connection if items are available or to create a new      listing.</li><li><strong>I Have</strong>: Users with time or material      donations can list what they have to offer. When a volunteer enters a time      donation, the engine will search the &#x201C;I Need&#x201D; section for any open      volunteer opportunities available during the specified time. &#xA0;When material donations are      entered, they are added to a database of available resources to be matched      with people searching for those needs.</li></ul><p>If materials or time are not available on the site, Donate Nashville points folks to existing resources like <a href=\"http://www.hon.org\" target=\"_blank\">Hands On Nashville</a> and <a href=\"http://tn211.mycommunitypt.com/\" target=\"_blank\">United Way&#x2019;s 2-1-1 service</a>.&#xA0;In order to maintain confidentiality, users can choose between showing or hiding their contact information, much like Craigslist. When matches are found, people can contact each other directly or through the Donate Nashville website.</p><p><strong>The thing is, it only works if you guys use it. </strong>We would really love to see it become a valuable tool for you guys in the months to come, because we&#x2019;re going to need all the help we can get to stay organized. We don&#x2019;t trust ourselves to keep everything straight in our own inbox! So whether it&#x2019;s a sump pump, a truckload of bottled water, a pack of underwear, or your Sunday afternoon, head over to <a href=\"http://www.donatenashville.org\" target=\"_blank\">DonateNashville.org</a> and add it to the pot. And if you need something, add that too.</p><p>Donate Nashville was developed by members of the Nashville Tech Community,<a href=\"http://www.unitedwaynashville.org/\" target=\"_blank\"> The United Way of Metropolitan Nashville</a>, <a href=\"http://coolpeoplecare.org/\" target=\"_blank\">Cool People Care</a> and your editors here at Nashvillest.</p><p><em>To learn more, contribute and keep up with Donate Nashville&#x2019;s efforts, visit </em><a href=\"http://www.donatenashville.org\"><em>www.donatenashville.org</em></a><em> or follow us on Twitter <a href=\"http://www.twitter.com/donatenashville\" target=\"_blank\">@DonateNashville</a> or on our </em><a href=\"http://www.facebook.com/home.php?#!/pages/Donate-Nashville/12417857759940\"><em>Facebook fan page</em></a><em>.</em></p>"}