{
 "id": "5130",
 "name": "bright-early-ready-or-not-here-they-come-edition",
 "title": "Bright &amp; Early: Ready Or Not, Here They Come Edition",
 "author": "Christy Frink",
 "date": "2010-06-07T09:45:00-05:00",
 "tags": [
  "cmapocalypse 2010",
  "flu pandemic",
  "gaylord",
  "governor phil",
  "guns in bars",
  "las vegas",
  "mnps",
  "oil spill",
  "opryland",
  "override",
  "seafood shortage",
  "tennessee credit union",
  "vanderbilt",
  "venetian",
  "veto"
 ],
 "categories": [],
 "contentEncoded": "<p style=\"text-align: center;\"><a href=\"http://www.flickr.com/photos/brandonjames/2566244406/\"><img class=\"alignnone\" src=\"http://farm4.static.flickr.com/3116/2566244406_6095501988.jpg\" alt=\"\" width=\"416\" height=\"278\"></a></p>\n<p style=\"text-align: left;\">Good morning, Nashville. We can&#x2019;t believe it&#x2019;s been over a month since our city flooded, but with most of downtown back open for business, <a href=\"http://www.wkrn.com/global/story.asp?s=12601803\" target=\"_blank\">we&#x2019;ve never been more ready for the 200,000 possibly sunburned, possibly mulleted, but definitely smiling faces that are expected to pour into Nashville this week for CMApocalypse 2010</a>. Some fans rolled into town as early as this weekend and so far they seem to be pretty impressed by our cleanup job. Heck,<em> we&#x2019;re </em>impressed by our cleanup job. And anyway, we&#x2019;ll be doing our best to keep you guys on top of all the road closures and free stuff and CMApocalypse Bingo and whatever else you need to make it through the week in one piece.</p>\n<ul>\n<li><strong>The irony!</strong> <a href=\"http://business.nashvillepost.com/2010/06/04/vegas-soaking-up-flood-affected-groups/\" target=\"_self\">Many of the conferences that were supposed to happen at Opryland over the next few months have been diverted from Music City to Sin City</a>. One hotel in Vegas says they&#x2019;ve already recruited 30 different groups whose conferences need a new place to land.</li>\n<li><strong>No seafood for you.</strong> Like us, lots of you have probably been glued to the oil spill coverage since it happened last month. <a href=\"http://www.wkrn.com/global/story.asp?s=12603829\" target=\"_blank\">And though the oil won&#x2019;t be making it this far inland, it might cause us a bit of a seafood shortage</a>. Since much of our fish and oysters come from the Gulf here in Tennessee, we might have a problem on our hands&#x2013;but still a pretty small problem compared to the rest of the disaster.</li>\n<li><strong>Bits &amp; pieces. </strong>Hard to believe there are still people alive who survived the 1918 flu pandemic, but <a href=\"http://www.tennessean.com/article/20100607/NEWS01/6070333/-1/RSS05\" target=\"_blank\">Vandy wants to use those folks to find ways to prevent another outbreak</a> &#x2026; <a href=\"http://nashvillecitypaper.com/content/city-news/schools-earning-big-bucks-corporate-sponsors\" target=\"_blank\">Metro Schools are looking to pick up some more corporate sponsors</a>, much like their existing partnership with Tennessee Credit Union &#x2026; The <a href=\"http://www.wkrn.com/global/story.asp?s=12599391\" target=\"_blank\">Tennessee House voted to override Governor Phil&#x2019;s Guns In Bars veto</a>, along with the Senate.</li>\n</ul>\n<p style=\"text-align: left;\"><em>Photo by <a href=\"http://www.flickr.com/photos/brandonjames/2566244406/\" target=\"_blank\">B to the T</a>.</em></p>"
}