{
 "id": "521",
 "name": "nashville-newcomers-fresh-blends-juice-smoothie-bar",
 "title": "Nashville Newcomers: Fresh Blends Juice &amp; Smoothie Bar",
 "author": "Morgan Levy",
 "date": "2008-06-30T19:00:00-05:00",
 "tags": [
  "community",
  "east nashville",
  "fresh blends",
  "health",
  "juice bar",
  "local",
  "smoothie bar",
  "ugly mugs",
  "wheatgrass",
  "wild oats"
 ],
 "categories": [],
 "contentEncoded": "<p><a href=\"http://nashvillest.com/wp-content/uploads/2008/06/picture-11.png\"><img class=\"aligncenter size-full wp-image-523\" title=\"picture-11\" src=\"http://nashvillest.com/wp-content/uploads/2008/06/picture-11.png\" alt=\"\" width=\"500\" height=\"177\"></a></p>\n<p>East Nashville, we hope you&#x2019;re prepared for the upcropping of brand new (awesome) local businesses. When we talked to <a href=\"http://nashvillest.com/2008/06/23/nashville-newcomers-ugly-mugs/\" target=\"_blank\">Ugly Mugs</a> the other day, they let us know about <a href=\"http://myfreshblends.com/\" target=\"_blank\">Fresh Blends</a>, a new juice bar located next door to their new space (1888 Eastland Ave). We gave Fresh Blends a call, and they graciously answered some of our questions about their plans for the juice bar. Welcome to the neighborhood, Fresh Blends!</p>\n<p><em>Q&amp;A with Fresh Blends owner David Edwards</em></p>\n<p><strong>Q. When do you plan to open?</strong></p>\n<p>A. We should be opening in mid-July. We are hoping to open sometime between July 12th and 19th, although nothing is set in stone yet.</p>\n<p><strong>Q. Will there be grand opening event? Will you have a soft opening?</strong></p>\n<p>A. We will soft open in the middle of the week for a few days and then have a grand opening event on the first Saturday that we are open. We will be giving out samples throughout the day and we will also have items to giveaway, such as free t-shirts and gift cards.</p>\n<p><strong>Q. Tell us about your ingredients&#x2026; will you be using local or organic produce at Fresh Blends?</strong></p>\n<p>A. Our wheatgrass is organically grown locally. We hope to offer a seasonal local smoothie or juice, but that will not be on the menu in the beginning. Unlike some of our competitors, all of our fruit will be individually quick frozen when fresh. We will not be using any syrups or fruits soaked in corn syrup. Our smoothies will only be sweetened with honey and 100% juice.</p>\n<p><strong>Q. What gave you the inspiration to open Fresh Blends? Do you have a background in this type of business?</strong></p>\n<p><span id=\"more-521\"></span></p>\n<p>A. My partner Tony Reall has a background in health and wellness, having worked for the YMCA of Middle Tennessee for a total of 5 years. My first job was working in a local smoothie shop in a health club in Metairie, Louisiana. There, we focused on workout smoothies that included protein and other enhancements. After college, I returned to my roots somewhat, working at Wild Oats as a cashier. I would also help out in their smoothie and juice bar from time to time. Working there I was able to see a healthy approach to smoothie making and also learn the benefits of vegetable and wheatgrass juice.</p>\n<p>While working together at the YMCA, Tony and I realized that there was a need for this type of business in the community. The options for a quick, healthy alternative snack or meal were extremely limited and nearly non-existant. After several conversations, the idea for Fresh Blends was born.</p>\n<p><strong>Q. Why did you pick East Nashville for the location, instead of high-traffic areas in Green Hills or Cool Springs?</strong></p>\n<p>A. We both live in and are committed to East Nashville and felt that there was a need for a smoothie and juice location. As residents of this area, we recognize the loyalty of East Nashvillians to their neighborhood. Although areas of Nashville such as Green Hills are great, we feel that the community in East Nashville is very supportive of local small businesses.</p>\n<p><strong>Q. Do you plan to be involved in the community, or will you just stick with making great drinks?</strong></p>\n<p>A. We do plan on being heavily involved in the community. Both my partner and I live in East Nashville and worked at the East Nashville YMCA for 3 years. We are deeply committed to seeing this community succeed. We have already sponsored a youth soccer team and are planning to be a part of the Tomato Arts Festival. We are also working to develop partnerships with other local businesses.</p>\n<p><strong>Q. What are the plans for your space &#x2013; will it be an atmosphere similar to a coffee shop (plenty of seating, some music, comfortable for a casual meeting) or will it be more of a walk-up space to grab a drink and go?&#xA0;</strong></p>\n<p>A. We will have some seating inside, but most of our business will be grab and go. For customers that do want to hang out, we will also have outdoor patio seating.</p>\n<p><strong>Q. Will you be serving anything other than juice &amp; smoothies?&#xA0;</strong></p>\n<p>A. In addition to juices and smoothies, customers will also be able to purchase pre-packaged items such as protein bars, healthy snacks, water and energy drinks.</p>\n<p>We love everything about Fresh Blends already. Stay tuned for more details and a Nashvillest field trip.</p>"
}