{"id":"5440","name":"earlybird-next-big-nashville-tickets-lineup-announced-nbn-10","title":"Earlybird Next Big Nashville Tickets, Lineup Announced [NBN &#x2019;10]","author":"Morgan Levy","date":"2010-08-02T13:30:00-05:00","tags":["leadership music digital summit","nbn10","next big nashville"],"categories":[],"contentEncoded":"<p style=\"text-align: center;\"><img class=\"aligncenter\" src=\"http://i31.tinypic.com/e67rfa.png\" alt=\"\"></p><p>If you somehow missed last week&#x2019;s big lineup announcement from Next Big Nashville, allow us to fill you in on the awesome. They&#x2019;ve released the names of just under half of the 2010 artists &amp; bands over on the <a href=\"http://www.nbnsummit.com/blog/the-2010-music-lineup/\" target=\"_blank\">Next Big Nashville site</a> and&#xA0;<a href=\"http://twitter.com/nextbig\" target=\"_blank\">Twitter account</a>, and we don&#x2019;t need more convincing (as if we needed any) &#x2013; We&#x2019;re in.</p><blockquote><p><em>Yeasayer, WAVVES, Ponys, David Bazan, A Place to Bury Strangers, Javelin, The Hood Internet, Garotas Suecas, Moon Duo, The Mynabirds, Otouto, Casiotone for the Painfully Alone, Peelander-Z, Elf Power and many more. In total, 150+ acts will play over four nights in Nashville&#x2019;s premiere music venues.</em></p><p><em>Nationally recognized artists will appear with a full slate of established and emerging names from Nashville and the Southeast including Tallest Trees, Griffin House, Madi Diaz, Kyle Andrews, Bryan Cates, Glossary, The Infamous Stringdusters, Keegan DeWitt, Futurebirds, Gift Horse, Roadside Graves, Andrew Belle, Katie Herzig, Megan McCormick, Kopecky Family Band, The Apache Relay, Mikky Ekko, The Protomen, The Non Commissioned Officers, How I Became the Bomb, Uncle Skeleton, Fly Golden Eagle, Mother/Father, Roman Candle, The Silver Seas, Majestico, The Bridges, Taxicab Racers, Courtney Jaye, Tyler Bryant, Heypenny, Evan P Donohue, The Deep Fried 5, The Distribution, The Coolin&#x2019; System, DeRobert &amp; The Half Truths, Biscuits and Gravy, The Kingston Springs, The Clutters, FlashMob, Bryan Cates, The Honeymoon Thrillers, And the Relatives, Andy Davis, Like Candy Red and many more. Record labels, organizations and brands will also present showcases, VIP events and exclusive after parties.</em></p></blockquote><p><em>Where can I sign up</em>, right? <a href=\"http://www.nbnsummit.com/blog/tickets-on-sale-soon/\" target=\"_blank\">Earlybird wristbands and VIP badges are available</a> at a discounted rate until August 10, so get in on the action early to save some cash. Wristbands are just $40 for four nights of music (the price will go up to $50 after August 10), and VIP badges are $215 (regular price $250) and get you access to the entire festival, conference, VIP parties and special VIP swag. <a href=\"http://nbnsummit.eventbrite.com/\" target=\"_blank\">Get your tickets here</a>.</p>"}