{"id":"5463","name":"i-propped-your-hood-up-with-my-fake-leg-gems-from-the-nashville-craigslist","title":"&#x201C;I Propped Your Hood Up With My Fake Leg&#x201D; [Gems From The Nashville Craigslist]","author":"Morgan Levy","date":"2010-08-02T08:00:00-05:00","tags":["gems from the nashville craigslist","hendersonville","missed connections","nashville craigslist"],"categories":[],"contentEncoded":"<p style=\"text-align: center;\"><a href=\"http://www.flickr.com/photos/emsef/3785444554/\" target=\"blank\"><img class=\"aligncenter\" src=\"http://farm3.static.flickr.com/2570/3785444554_a46fb9bcdb.jpg\" alt=\"\"></a></p><p>While we can&#x2019;t vouch for its authenticity, this Missed Connection is near the top of our list of favorite Gems From The Nashville Craigslist. How could it not be? It has all the elements of a brilliant Missed Connection &#x2013; A prosthetic leg, Jolly Ranchers, the Hendersonville police, Redbox. Enjoy!</p><blockquote><h2><a href=\"http://nashville.craigslist.org/mis/1869223306.html\" target=\"_blank\">I propped your hood up with my fake leg and jumped your car. Need back &#x2013; m4w &#x2013; 36 (Hendersonville, TN)</a></h2><p><em>I&#x2019;m not sure you&#x2019;d remember as I consider myself rather average looking and I know that you bein&#x2019; so beautiful n&#x2019; all have men approach you all day, but I was the young man who propped up your hood with my fake leg and jumped your car.</em></p><p><em>I was surprised how quickly you drove off after we managed to get it started, though. You seemed pretty excited and I reckon I would be too, but my leg was caught in the hood as you peeled out backwards out of the Dodge&#x2019;s Store parkin lot. Coincidentally, 3 police cars sped into the parkin lot just after you turned the corner. I was blown away with how quickly Hendersonville police respond for people who need a jump. They asked me all about you and I told &#x2019;em how pretty you were. Eyes like jolly ranchers, I told &#x2019;em. They must be lonely people, those police officers, askin&#x2019; so many questions about some stranger. Though, you didn&#x2019; seem like no stranger to me. You seemed nice.</em></p><p><em>So, if you read this, maybe you could send me an E-mail or something and we could meet up at a Red Box or something and I could get my leg back.</em></p></blockquote><p>Photo by <a href=\"http://www.flickr.com/photos/emsef/3785444554/\" target=\"blank\">gingerbeardman</a>.</p>"}