{"id":"6128","name":"bright-early-2012-is-just-around-the-corner-yall-edition","title":"Bright &amp; Early: 2012 Is Just Around The Corner Y&#x2019;all Edition","author":"Christy Frink","date":"2010-11-30T10:30:00-06:00","tags":[],"categories":[],"contentEncoded":"<p style=\"text-align: center;\"><a href=\"http://www.flickr.com/photos/7653512@N03/5218685436/in/pool-715021@N24/\"><img class=\"aligncenter\" src=\"http://farm5.static.flickr.com/4132/5218685436_9a640e19b1.jpg\" alt=\"\" width=\"500\" height=\"375\"></a></p><p style=\"text-align: left;\">Good morning, Nashville. If you woke up this morning in need of a freak natural disaster to worry about, we have you covered. <a href=\"http://www.tennessean.com/article/20101130/NEWS01/11300329/-1/RSS05\" target=\"_blank\">Seismic experts have determined that there is a 25-40% chance that a major earthquake could happen along the New Madrid fault line sometime within the next 50 years</a>. The New Madrid Seismic Zone extends from Memphis to southern Illinois and several small tremors have shaken the region in the past few years. TEMA has been busy preparing an earthquake preparedness and response plan as a result, though, so there is that! But with statements like &#x201C;We&#x2019;d be plunged into darkness,&#x201D; and &#x201C;All communications will be out,&#x201D; and &#x201C;Tennesseans will need to be self-sufficient for at least 72 hours without food, water or shelter,&#x201D; flying around, things don&#x2019;t sound very promising. Oh, and there will be an earthquake drill at 10:15 AM on April 28th (<em>if we even make it that far, with the way our state is supposed to be swallowed into the earth and all!</em>) so mark your calendars.</p><ul><li><strong>Must be doing something right.</strong> On a much brighter note, <a href=\"http://www.commercialappeal.com/news/2010/nov/30/tennessee-no-longer-dropout-factory/\" target=\"_blank\">Tennessee&#x2019;s graduation rate reportedly jumped from 59.6% in 2002 to 74.9% in 2008</a>, meaning that our schools are no longer worthy of the &#x201C;dropout factory&#x201D; designation bestowed upon them in years past.</li><li><strong>It&#x2019;s sort of like Frogger.</strong> Folks are still <a href=\"http://www.wkrn.com/Global/story.asp?S=13583190\" target=\"_blank\">wary of using the fancy new crosswalk that stretches across seven lanes of Broadway from the Exxon Tiger Mart to the Tennessean office building despite all of the neon yellow signage and blinking lights warning drivers to yield to pedestrians</a>. And can you blame them?</li><li><strong>Bits &amp; pieces.</strong> Congrats to the Overton High School marching band who <a href=\"http://www.wkrn.com/Global/story.asp?S=13578480\" target=\"_blank\">flew to Hawaii over the weekend to play in a parade commemorating the 69th anniversary of the Pearl Harbor attacks</a> &#x2026; FEMA will be <a href=\"http://wpln.org/?p=22117\" target=\"_blank\">buying out 81 flood-damaged properties ahead of schedule, for once</a> &#x2026; <a href=\"http://www.wsmv.com/news/25952427/detail.html\" target=\"_blank\">Local talk show host Steve Gill is calling for the assassination of WikiLeaks founder Julian Assange</a>, calling him a &#x201C;terrorist&#x201D; &#x2026; Last week, <a href=\"http://www.wkrn.com/Global/story.asp?S=13583681\" target=\"_blank\">Antioch residents reported a wild boar of some sort roaming around the town</a> &#x2026; The Tennessee State Supreme Court <a href=\"http://wpln.org/?p=22121\" target=\"_blank\">halted four executions while they look into new lethal injection procedures</a>.</li></ul><p style=\"text-align: left;\"><em>Photo by <a href=\"http://www.flickr.com/photos/7653512@N03/5218685436/in/pool-715021@N24/\" target=\"_blank\">jodestick</a>.</em></p>"}