{"id":"6131","name":"the-new-brew-on-the-block-meet-jackalope-brewing-company-nashville-newcomers","title":"The New Brew On The Block: Meet Jackalope Brewing [Nashville Newcomers]","author":"Morgan Levy","date":"2010-11-30T12:30:00-06:00","tags":["beer","jackalope brewing company","nashville newcomers"],"categories":[],"contentEncoded":"<p style=\"text-align: center;\"><a href=\"http://nashvillest.com/wp-content/uploads/2010/11/jackalope-logo-trademark.jpg\"><img class=\"size-full wp-image-6132 aligncenter\" title=\"jackalope logo trademark\" src=\"http://nashvillest.com/wp-content/uploads/2010/11/jackalope-logo-trademark.jpg\" alt=\"\" width=\"285\" height=\"377\"></a></p><p>Last week, the news of <a href=\"http://www.jackalopebrew.com/\" target=\"_blank\">Jackalope Brewing Company</a> burst into Nashville and set the internets a-buzzin&#x2019; with chatter about the new brewery on the block (beer has a funny way of doing that). From the sound of things, big plans are in store for Jackalope &#x2013; Tennessee&#x2019;s first female-run commercial brewery will include a beautiful taproom space on 8th Ave and four house-brewed craft beers on tap with a rotating seasonal/experimental beer, with a projected opening date in spring 2011.</p><p>We decided to dig a little deeper, to get the story about the women behind the beer and the beer behind the name. We chatted with owners Robyn Virball and Bailey Spaulding&#xA0;about their favorite beers, Jack Daniel&#x2019;s beer and beet beer&#x2026; But what do you expect? They own a brewery!</p><p>Nashville, meet Jackalope.</p><p><strong>Tell us a little bit about yourselves. Where are you from? How did the two of you meet?</strong></p><p>[Robyn] Bailey and I are both New Englanders, I&#x2019;m from New Hampshire and Bailey&#x2019;s from Vermont.  We became friends eight years ago; Bailey was a junior at Harvard doing a semester abroad program at the University of St. Andrews in Scotland, which I attended for all four years of undergrad. Bailey moved down to Nashville to go to Vanderbilt Law School (she is actually a licensed Tennessee attorney), and started brewing while in law school.  I had been up in Boston working in sales and business development and was ready for a change, and Bailey had been talking about wanting to follow this brewery dream for a couple of years, so I told her that if she really wanted to go for it, I would move down and help her start the brewery.  That&#x2019;s basically how we got to where we are.</p><p><strong>When and where did your love affair with beer begin? </strong></p><p>[Robyn] My answer first, which is much shorter: For me, I think living in Scotland kick started my love of beer.  It was there that I really learned there was much more to beer than the Bud Light you were used to drinking at frat parties.  It really opened my eyes and palate to a whole range of beers and that&#x2019;s where the appreciation began.<br>As for favorite beers, I love Green Flash&#x2019;s West Coast IPA (out of San Diego) and Dogfish Head&#x2019;s 90 Minute IPA , I also really enjoyed Otter Creek&#x2019;s Quercus Vitis Humulus.</p><p>Bailey&#x2019;s answer: I think growing up in Vermont had a big influence on my love of beer.  Even though I wasn&#x2019;t drinking beer yet, the craft beer scene was growing there and I got used to locally made brews being around, and people being excited about it.  Then for my twentieth birthday, a friend of mine gave me a &#x201C;beer of the day&#x201D; calendar, that described a different world class beer every day.  That was when I really realized that there was an art and creativity to craft beer-making.  I ripped out and saved every Scottish one, so when I was there and actually able to order beer at the pubs (a novel event for a 20 year-old), I tried all of the ones I could find.</p><p>I&#x2019;ve now been brewing for about four years.  A friend of mine from law school and I got together, went to All Seasons, the awesome homebrew supply store on 8th Ave. South, and bought the equipment and a nut brown recipe.  Even that afternoon we started brainstorming fun ideas for new beers and I knew it was something I would love.</p><p>My favorite beers&#x2026;I like trying new things all the time, but I&#x2019;m partial to the Vermont beers!  Up at home my favorites are Switchback Ale (from the Switchback Brewing Company), and when you can find it, Lawson&#x2019;s Finest Liquids&#x2019; Chinooker&#x2019;d IPA.  I&#x2019;m also a huge fan of Stone&#x2019;s Russian Imperial Stout (out of Escondido, CA).</p><p><strong>Where did the name and idea for Jackalope come from?</strong></p><p>[Robyn] This story comes a little bit at Bailey&#x2019;s expense&#x2026; she actively believed that jackalopes were real creatures for a long time&#x2026;like through college.  She had a family friend who had a pair of stuffed jackalope heads and used to tell her all these stories about how they only lived in Wyoming and were nocturnal, and apparently this all seemed reasonable to Bailey.  Eventually she figured it out, but someone then gave her a tee-shirt with a jackalope on it that said &#x201C;Believe in yourself.&#x201D;  That kind of has become our unofficial motto as we start the brewery.</p><p><strong>Jackalope brews will only be available on tap. Do you have plans to expand distribution eventually? </strong></p><p>We do indeed.  We can definitely expand somewhat while we&#x2019;re still only available on draft, but are currently planning on bottling somewhere between three and five years down the road.</p><p><strong>What do you envision for your taproom space? Will you offer tours of the brewing process?</strong></p><p>We have big plans for the taproom.  I&#x2019;m really excited about it.  We&#x2019;ll be open for about 12 hours a week, on Thursday, Friday and Saturday evenings.  We want it to be a place where people can come and enjoy a pint, and also to be a place that&#x2019;s educational about beer.  We feel sometimes craft beer can be a bit intimidating to people, and we want to create an environment where people feel comfortable asking questions and learning about the different beers.  We will offer tours, we may not do it right away, but after we&#x2019;ve been up and running for a little bit, we&#x2019;ll definitely open our doors and let people have a look around.</p><p><strong>What is the most interesting &#x2018;experimental&#x2019; beer you&#x2019;ve brewed? Can we expect to taste some of that in Nashville next year? </strong></p><p>[Robyn] I think the most interesting experimental beer of ours was a wee heavy Scottish ale that we fermented in a used Jack Daniel&#x2019;s whiskey barrel.  It smelled like whiskey and tasted like beer!  That one was pretty high gravity so it might be a while before it hits the market, but my other favorite was a farmhouse ale brewed with beets.  It was really earthy and bright, bright red.  That one you can expect to see soon!</p><p><strong>Will there be any sort of community involvement or charity aspect of Jackalope? </strong></p><p>We wouldn&#x2019;t be able to exist without the support of our awesome community, so having a way to be involved and give back is really important to us.  One aspect of that will come from the experimental tap, where portions of the proceeds from each beer will go to a different charitable cause that we associate with the beer.  We also will organize groups to partake in activities like Habitat for Humanity housing builds, Hands On Nashville volunteer days, and other local events that support the community.  A major dream for the future would also be work with nearby farmers so that we can create more locally sourced brews&#x2026;whenever we are able to use local ingredients, we will use them.</p><p><strong>What&#x2019;s Jackalope&#x2019;s special twist?</strong></p><p>The short answer is that our beer flavors will be different and unique, based in traditional beer styles, but then given Jackalope&#x2019;s own perspective.  Also, most craft beer available in Nashville is not local, and one of the advantages of being housed here is that we can interact with our consumers.  We really want to get the community interested not only in drinking beer, but in the craft of beer-making itself.  At the taproom we&#x2019;ll offer taste-testings with descriptions of the different brews, as well as explanations of the beer process and beer and food pairings to really make it an interactive place!</p><p><strong>Any last words, thoughts, or things you want to tell people in Nashville? </strong></p><p>We&#x2019;d really love to thank all of the people who have reached out to us with support over the last few months, and particularly over the last few days!  We can&#x2019;t wait to open our doors this spring!</p>"}