{
 "id": "6218",
 "name": "watch-and-learn-nashvillians-driving-on-ice-nashvillest-psa",
 "title": "Watch And Learn: Nashvillians Driving On Ice [Nashvillest PSA]",
 "author": "Christy Frink",
 "date": "2010-12-14T12:00:00-06:00",
 "tags": [
  "driving tips",
  "ice storm",
  "nashvillest psa",
  "safety tips"
 ],
 "categories": [],
 "contentEncoded": "<p><object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" width=\"480\" height=\"385\" codebase=\"http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0\"><param name=\"allowFullScreen\" value=\"true\"><param name=\"allowscriptaccess\" value=\"always\"><param name=\"src\" value=\"http://www.youtube.com/v/IUpoTCSebfM?fs=1&amp;hl=en_US\"><param name=\"allowfullscreen\" value=\"true\"><embed type=\"application/x-shockwave-flash\" width=\"480\" height=\"385\" src=\"http://www.youtube.com/v/IUpoTCSebfM?fs=1&amp;hl=en_US\" allowscriptaccess=\"always\" allowfullscreen=\"true\"></object></p>\n<p>With a possible ice storm in the cards for us tomorrow, we thought it was a good time to pull this video out of the archives and share it with all of you, dear readers, as a reminder of what happens in our city when things are covered in ice. Our favorite part is probably the TDOT truck with the arrow pointing the wrong direction. At any rate, as much as we like to make fun of Nashville drivers around here, we want to <a href=\"http://www.weather.com/activities/driving/drivingsafety/drivingsafetytips/snow.html\" target=\"_blank\">pass along these tips from The Weather Channel for driving safely on ice</a>. Though they might seem pretty basic to you northern and midwestern transplants, the rest of us sometimes need a refresher. Drive safe this week!</p>\n<p><span style=\"font-size: 15.6px;\"><strong>Driving safely on icy roads</strong></span></p>\n<ol>\n<li>Decrease your speed and leave yourself plenty of room to stop. You should allow at least three times more space than usual between you and the car in front of you.</li>\n<li>Brake gently to avoid skidding. If your wheels start to lock up, ease off the brake.</li>\n<li>Turn on your lights to increase your visibility to other motorists.</li>\n<li>Keep your lights and windshield clean.</li>\n<li>Use low gears to keep traction, especially on hills.</li>\n<li>Don&#x2019;t use cruise control or overdrive on icy roads.</li>\n<li>Be especially careful on bridges, overpasses and infrequently traveled roads, which will freeze first. Even at temperatures above freezing, if the conditions are wet, you might encounter ice in shady areas or on exposed roadways like bridges.</li>\n<li>Don&#x2019;t pass snow plows and sanding trucks. The drivers have limited visibility, and you&#x2019;re likely to find the road in front of them worse than the road behind.</li>\n<li>Don&#x2019;t assume your vehicle can handle all conditions. Even four-wheel and front-wheel drive vehicles can encounter trouble on winter roads.</li>\n</ol>\n<p><strong>If your rear wheels skid&#x2026;</strong></p>\n<ol>\n<li>Take your foot off the accelerator.</li>\n<li>Steer in the direction you want the front wheels to go. If your rear wheels are sliding left, steer left. If they&#x2019;re sliding right, steer right.</li>\n<li>If your rear wheels start sliding the other way as you recover, ease the steering wheel toward that side. You might have to steer left and right a few times to get your vehicle completely under control.</li>\n<li>If you have standard brakes, pump them gently.</li>\n<li>If you have anti-lock brakes (ABS), do not pump the brakes. Apply steady pressure to the brakes. You will feel the brakes pulse &#x2014; this is normal.</li>\n</ol>\n<p><strong>If your front wheels skid&#x2026;</strong></p>\n<ol>\n<li>Take your foot off the gas and shift to neutral, but don&#x2019;t try to steer immediately.</li>\n<li>As the wheels skid sideways, they will slow the vehicle and traction will return. As it does, steer in the direction you want to go. Then put the transmission in &#x201C;drive&#x201D; or release the clutch, and accelerate gently.</li>\n</ol>\n<p><strong>If you get stuck&#x2026;</strong></p>\n<ol>\n<li>Do not spin your wheels. This will only dig you in deeper.</li>\n<li>Turn your wheels from side to side a few times to push snow out of the way.</li>\n<li>Use a light touch on the gas, to ease your car out.</li>\n<li>Use a shovel to clear snow away from the wheels and the underside of the car.</li>\n<li>Pour sand, kitty litter, gravel or salt in the path of the wheels, to help get traction.</li>\n<li>Try rocking the vehicle. (Check your owner&#x2019;s manual first &#x2014; it can damage the transmission on some vehicles.) Shift from forward to reverse, and back again. Each time you&#x2019;re in gear, give a light touch on the gas until the vehicle gets going.</li>\n<li><a href=\"http://www.weather.com/activities/driving/drivingsafety/drivingsafetytips/winterize.html#stranded\">More Tips</a></li>\n</ol>"
}