{
 "id": "6602",
 "name": "bright-early-endless-road-edition",
 "title": "Bright &amp; Early: Endless Road Edition",
 "author": "Christy Frink",
 "date": "2011-02-24T10:30:00-06:00",
 "tags": [],
 "categories": [],
 "contentEncoded": "<p style=\"text-align: center;\"><a href=\"http://www.flickr.com/photos/brandonjames/5470304742/in/pool-715021@N24/\"><img class=\"aligncenter\" src=\"http://farm6.static.flickr.com/5014/5470304742_d36e2fb635.jpg\" alt=\"\" width=\"500\" height=\"334\"></a></p>\n<p style=\"text-align: left;\">Good morning, Nashville. Things have been quiet on the Opry Mills front lately, leaving us to to wonder what the timeline for reopening might be. The answer? They still don&#x2019;t know. <a href=\"http://www.tennessean.com/article/20110224/BUSINESS01/102240333/2275/rss05\" target=\"_blank\">The mall and its owner, Simon Property Group, are still locked in a court battle with the insurance company over the insurance money which is slated to go to trial in February 2012. Even if they were to get the money, they&#x2019;d likely spend months completing the renovations</a>. Folks are now questioning whether or not it&#x2019;s even worth reopening when enclosed malls are falling further and further out of style. Meanwhile, all the sales tax revenue is going to surrounding counties like Williamson and Wilson to which Opry Mills&#x2019; tenants have scattered since May.</p>\n<ul>\n<li><strong>He hung his head.</strong> <a href=\"http://www.wsmv.com/news/26973708/detail.html\" target=\"_blank\">Johnny Cash&#x2019;s younger brother Tommy had a mix-up involving his pocket knife that caused a bit of a problem at the Nashville International Airport</a>. Cash says he merely forgot to pack his knife in his shaving kit, and after asking if he could mail it back home, an airport staff member offered to help him get it through security. The airport staffer was later arrested and Cash was questioned upon his arrival in Atlanta.</li>\n<li><strong>Good thing it&#x2019;s not snow, right?</strong> <a href=\"http://http://www.tennessean.com/article/20110224/NEWS01/102240328/2275/rss05\" target=\"_blank\">Nashville is expected to get up to four inches of rain today</a>, but is still only at a &#x201C;slight&#x201D; risk of experiencing the severe weather that West Tennessee will face this afternoon. However, we&#x2019;re being urged to keep an eye out in the event that things do get nasty.</li>\n<li><strong>Bits &amp; pieces.</strong> Ex-Vanderbilt grad student Jeffrey Ewers was <a href=\"http://nashvillecitypaper.com/content/city-news/ex-vanderbilt-student-faces-additional-child-pornography-charges?utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed:+NashvilleCityPaper-CityNews+(Nashville+City+Paper+-+City+News)&amp;utm_content=Google+Reader\" target=\"_blank\">indicted on 10 counts of sexual exploitation of a minor</a> after Cafe Coco staff found a memory card full of child porn he left behind on a table last year &#x2026; The State Senate <a href=\"http://wpln.org/?p=24452\" target=\"_blank\">approved a bill refusing to implement federal health care reform in Tennessee</a> &#x2026; <a href=\"http://www.wsmv.com/news/26977735/detail.html\" target=\"_blank\">Spring Hill accidentally set off their tornado sirens last night</a> and gave residents a bit of a scare &#x2026; <a href=\"http://www.newschannel5.com/story/14086705/vanderbilt-reviewing-bloody-mascot-incident\" target=\"_blank\">Vanderbilt is investigating the Mister C mascot incident</a> that left one fan with a bloody nose.</li>\n</ul>\n<p style=\"text-align: left;\"><em>Photo by <a href=\"http://www.flickr.com/photos/brandonjames/5470304742/in/pool-715021@N24/\" target=\"_blank\">B to the T</a></em>.</p>"
}