{
 "id": "6764",
 "name": "chagos-cantina-brings-a-burst-of-latin-flavor-to-belmont-boulevard-nashvillest-eats",
 "title": "Chago&#x2019;s Cantina Brings A Burst of Latin Flavor To Belmont Boulevard [Nashvillest Eats]",
 "author": "Kevin Heim",
 "date": "2011-03-30T13:00:00-05:00",
 "tags": [
  "chago&apos;s cantina",
  "latin food",
  "margaritas",
  "mexican food",
  "pupusas",
  "tacos"
 ],
 "categories": [
  "Featured",
  "Food &amp; Drink"
 ],
 "contentEncoded": "<p><a href=\"http://www.flickr.com/photos/31037979@N04/5573037592/in/pool-715021@N24/\" onclick=\"javascript:_gaq.push([&apos;_trackEvent&apos;,&apos;outbound-article&apos;,&apos;www.flickr.com&apos;]);\"><img class=\"aligncenter\" src=\"http://farm6.static.flickr.com/5106/5573037592_b296eb311b.jpg\" alt=\"\" width=\"500\" height=\"374\"></a></p>\n<p><strong>Chago&#x2019;s Cantina (Formerly La Fiesta)</strong><br>\n2015 Belmont Blvd<br>\nNashville, TN 37212<br>\n(615) 386-0106</p>\n<p><strong>Rating: </strong><img class=\"alignnone size-full wp-image-6765\" title=\"4stars\" src=\"http://nashvillest.com/wp-content/uploads/2011/03/4stars.png\" alt=\"\" width=\"85\" height=\"16\"><br>\n$15-20 per person</p>\n<p><strong>Our Picks:</strong><br>\n- Grilled Sweet Plantain, pulled pork, beans and Spanish rice<br>\n- Grilled Mahi Mahi with salsa, beans and Spanish rice</p>\n<p>When Chago&#x2019;s Catina first opened up, I was a bit skeptical that it could be any good. If any of you have ever had the traumatic opportunity to eat at the old La Fiesta, you know what bottom-of-the-barrel Mexican food tastes like, and I was worried I was in for a repeat. Oh, how I was wrong. The first sign that this was going to be good was the St. Patrick&#x2019;s Day Special, Drunken Tacos. This regular menu item consists of two tacos, a can of Tecate and a shot of Tequila for only $10. If ever there was a dish that&#x2019;s custom made for a Friday night, this is it.</p>\n<p>The second sign was that the new owners had gone all out redecorating the place with bright paint and I&#x2019;m pretty sure some new TVs. The menu is a mix of the normal Mexican fare and some more eclectic dishes from Latin America. They also clearly label their vegetarian and vegan dishes, so alt eaters, dig in! Unfortunately, most of the vegan dishes are sides, so options are limited.</p>\n<p>Since it was only Thursday, I controlled myself and ordered a dish consisting of grilled sweet plantain, pulled pork, rice and beans. The sweet and savory flavors of the plantain and pork were a bit jarring at first, but I quickly got used to the traditional Latin American pairing. My companion had grilled Mahi Mahi with a spicy salsa on top. It was perfectly cooked with just enough kick in the salsa to make it interesting, but still palatable to most taste buds.</p>\n<p>The service was a bit overbearing with the waitstaff checking up on us every five minutes or so, but I suspect that it&#x2019;s only because they&#x2019;re brand new. Hopefully they&#x2019;ll tone things down just enough to be attentive, but not annoying.</p>\n<p>Overall, Chago&#x2019;s Cantina is HUGE step up from the disappointing La Fiesta. They successfully brought the bold flavors and freshness of Latin American cuisine to Belmont Boulevard at a reasonable price. Our dinner trip to Chago&#x2019;s cost us 26.22 for food alone, before we tipped our omnipresent waiter. (Don&#x2019;t worry, we still tipped him well!)</p>\n<p>This definitely won&#x2019;t be my last trip to Chago&#x2019;s; after all, I still have to try the Drunken Tacos and the liver-killing 30 ounce &#x201C;Chupacabra&#x201D; margarita.</p>\n<p><strong>Editor&#x2019;s Note: </strong><em>Guest author&#xA0;Kevin Heim is a Belmont student who is not in a band. He likes extreme  mini-golf, a good grilled cheese and shooting the paper off of straws.</em></p>\n<p><em>Photo by <a href=\"http://www.flickr.com/photos/31037979@N04/5573037592/in/pool-715021@N24/\" onclick=\"javascript:_gaq.push([&apos;_trackEvent&apos;,&apos;outbound-article&apos;,&apos;www.flickr.com&apos;]);\" target=\"_blank\">Kevin Heim</a></em>.</p>\n\n\n\n\n<p>Related posts:<ol><li><a href=\"http://nashvillest.com/2010/04/20/serious-eats-gets-serious-about-nashville-taco-trucks/\" rel=\"bookmark\" title=\"Permanent Link: Serious Eats Gets Serious About Nashville Taco Trucks\">Serious Eats Gets Serious About Nashville Taco Trucks</a></li>\n</ol></p>\t\t\t\t\t\t\t\t\t\t\t<!--END .entry-content .article-->"
}