{"id":"6846","name":"things-we-like-moovers-shakers-a-soda-parlor-on-wheels","title":"Things We Like: Moovers &amp; Shakers, A Soda Parlor On Wheels","author":"Morgan Levy","date":"2011-04-11T11:00:00-05:00","tags":["food trucks","kickstarter","moovers &amp; shakers","nashvillest milkshakes","soda parlor","their milkshakes bring all the boys to the yard"],"categories":[],"contentEncoded":"<p><a href=\"http://nashvillest.com/wp-content/uploads/2011/04/logo-words.png\"><img class=\"size-full wp-image-6854 aligncenter\" title=\"logo-words\" src=\"http://nashvillest.com/wp-content/uploads/2011/04/logo-words.png\" alt=\"\" width=\"420\" height=\"328\"></a></p><p>Nashville has been bitten by the food truck bug, and badly. It&#x2019;s getting to the point where some folks roll their eyes when they hear about yet another food truck hitting the streets, but not us. We&#x2019;re not going to complain if someone wants to drive delicious food and beverage practically to our doorstep! That said, we <em>did</em> roll our eyes a little when <a href=\"http://www.nashvillescene.com/bites/archives/2011/04/06/moovers-on-the-move-milkshake-truck-looking-for-moolah\" target=\"_blank\">we heard something about two Belmont kids with a Kickstarter campaign</a>. But our rolling eyes were met with no mention of a new CD or dreams of a world tour. Instead, we read that they want to start a mobile soda parlor, and our interest was piqued. And&#xA0;<a href=\"http://www.kickstarter.com/projects/1297858327/moovers-and-shakers-nashvilles-first-mobile-soda-p?ref=live\" target=\"_blank\">we kept reading</a>. And we fell in love with them and their mission to spread happiness around Nashville in whatever way they can.</p><p>Ale Delgado and Hayden Coleman are the two ambitious young entrepreneurs at the helm of <a href=\"http://www.facebook.com/mooversandshakers\" target=\"_blank\">Moovers &amp; Shakers</a>, Nashvillest first mobile soda shop. Good, old-fashioned shakes and floats &#x2013; It&#x2019;s like an ice cream truck for adults, but way less creepy (and we hope they&#x2019;ll play better music). Here&#x2019;s the catch: They&#x2019;ve already won partial funding for Moovers &amp; Shakers from Belmont, but they need more money to buy their truck, get all the appropriate permits and licenses and get shaking. That&#x2019;s where the Kickstarter campaign comes in.</p><p>If you&#x2019;ve ever supported a Kickstarter project before, you know the drill. You donate money, and they offer a different incentive for incremental donations. Give Moovers &amp; Shakers $5, get a coupon for a free shake or soda. Give &#x2019;em $25, they&#x2019;ll name a shake after you. Want to drop the big bucks? For a $500 donation, they&#x2019;ll cater a 50 person event for you. And there are all sorts of options in between, too. There&#x2019;s also a built in safety net for donors &#x2013; If they don&#x2019;t meet their goal of $5,000 in donations by their self-set deadline of April 24, they don&#x2019;t get any of the money, so you can feel safe that your money isn&#x2019;t going to an under-funded project that will fizzle out. Moovers &amp; Shakers has a long way to go in less than two weeks, but if they make their goal, we&#x2019;ll have a mobile milkshake truck in Nashville by May. Right now they have $1,475 pledged, so <a href=\"http://www.kickstarter.com/projects/1297858327/moovers-and-shakers-nashvilles-first-mobile-soda-p\" target=\"_blank\">help &#x2019;em out by adding your pledge to the campaign</a>. You&#x2019;ll feel really good about doing your part to bring milkshakes to the streets of Nashville, we promise!</p><p>We could tell that Ale and Hayden had a fun, lighthearted outlook on life from the minute we started reading (and we loved it), so we sat down to ask them a few questions. Get to know them and Moovers &amp; Shakers (and find out what would be in a Nashvillest shake) below the jump!</p><p><span id=\"more-6846\"></span><strong>What gave you guys the idea for Moovers and Shakers?</strong></p><p><em>ALE</em>: SERENDIPITY: IT&#x2019;S NOT JUST A MOVIE STARRING JOHN CUSACK. My parents recently moved very far away from my childhood home, so when I went home for summer break last year, I spent a lot of time friend-less and alone, watching The Cooking Channel. It had just launched, so I guess they only shot one or two episodes of each show because I watched the Food(ography) episode on ice cream about half a million times and it sparked this craze for soda shops. I thought it was just a summer fling but alas, my love grew deeper with time. So one day, I was sitting in class and my mind started drifting (sorry, Dr. Lalonde!) to food trucks and how maybe a mobile milkshake truck could be a little more feasible (and more awesome). Then, after class, Hayden and I were walking past BLVD, a space on Belmont&#x2019;s campus that they&#x2019;re trying to convert into a new business, and he said, &#x201C;You know what I&#x2019;d love to put in there? An old-fashioned soda shop.&#x201D; To which I said something along the lines of &#x201C;HRRRGHHH, WHAT? THAT&#x2019;S WHAT I&#x2019;VE BEEN THINKING ABOUT ALL CLASS!&#x201D;</p><p><em>HAYDEN</em>: Yeah, when we were walking back from class, I was thinking about this cool soda parlor we had in Gulf Shores, Alabama (which is where I&#x2019;m from).  It was part of this independent pharmacy, and I remember feeling such a cool sense of community and fun when I was there. So when I saw the empty spot at BLVD, I thought, &#x201C;Man, wouldn&#x2019;t it be cool if there was some way to bring that feeling into Belmont?&#x201D; And sure enough, Ale had almost the same idea, and we just decided to go for it!</p><p><strong>Tell us about the truck you&#x2019;re hoping to buy. </strong></p><p><em>HAYDEN</em>: We&#x2019;ve actually been very fortunate as far as the truck is concerned. My mom (who was doing research on this the whole time without even telling me about it) found this company based in Charlotte, North Carolina that converts used step-vans into custom food trucks. They can built it for about any type of business and any type of budget, and they can even ship it to you, which is very convenient because we want to be up and running as soon as possible. The largest issue that we&#x2019;ve had to deal with while finding a truck is the fact that we&#x2019;ve got to pass a health inspection before we can legally operate. So we&#x2019;ve needed to make sure that whatever truck we get is going to be up to code, because I&#x2019;ve heard of too many people who have had to shut down because they didn&#x2019;t go through the Department of Health. In fact, one man in California opened up a mobile food truck and had 1,400 customers on the first day! The very next day he had to close because he didn&#x2019;t have a health permit. Yeah, we don&#x2019;t want that to happen to us, so we&#x2019;re making sure that we don&#x2019;t cut any corners!</p><p><em>ALE</em>: For those who don&#x2019;t know, step-vans are the vehicles that get made into mail trucks and old-fashioned ice cream trucks. We considered going the ice cream van route, but those are harder to outfit. Plus now we&#x2019;ll look less like creepers, which is nice!</p><p><strong>Will this be a full time venture? Just summers? Aren&#x2019;t you kids in school? </strong></p><p><em>ALE</em>: Belmont &#x2019;til we die!</p><p><em>HAYDEN</em>: As of now, our plan is to run full time in the summer, and then try to move into catering and special events in the off-season when we won&#x2019;t have a very regular flow of customers. This way, we can still operate in some capacity while we&#x2019;re in school.</p><p><strong>Not to be Debbie Downer, but what happens if you don&#x2019;t meet your Kickstarter goal? What&#x2019;s Plan B? </strong></p><p><em>ALE</em>: Plan B is a dark and scary place. We still plan on going ahead with Moovers and Shakers even if we don&#x2019;t reach our goal; it&#x2019;s just going to be a lot harder on us and probably delayed for quite a while. Right now, we can make do by ourselves if we reach our Kickstarter. If we don&#x2019;t reach our goal, we&#x2019;ll have to take out a decent-sized loan, which we&#x2019;d really like to avoid since we&#x2019;re both already taking out loans for school. Plus, that&#x2019;ll slow down the whole process and we probably won&#x2019;t be able to open until later in the summer. So please pledge! &#x201C;Not-So-Grand-Opening-In-Another-Month-Or-Two-Where-Are-The-Milkshakes&#x201D; doesn&#x2019;t have the same ring to it.</p><p><strong>Explain Scoops. It&#x2019;s probably the best thing we&#x2019;ve ever heard of &#x2013; spreading random happiness around in a milkshake truck.</strong></p><p><em>ALE</em>: I&#x2019;m so glad you asked about Scoops! They&#x2019;re my favorite part and they don&#x2019;t get nearly enough attention. Over the past year or so, my goal in life has been to be as totally ridiculous as possible. People get so bogged down in their school work, real work, internships, family drama, bad relationships, debts, all kinds of stresses. Lord, my friends and I are going through, what, 1/5-life crises? Unbelievable. But I think that if people get a little whimsy in their days, that&#x2019;ll do wonders. I&#x2019;m a big believer in the little things. So that&#x2019;s what we&#x2019;re trying to do through Scoops, bring back that sense of fun and spontaneity that we had as kids. Maybe you&#x2019;re not gonna go out and start a water balloon fight on your own, but you&#x2019;re definitely gonna be tempted if we hand you water balloons for free and tell you to go play. Maybe you&#x2019;ll think it&#x2019;s really weird and goofy that the people taking your orders are only speaking in rhyme, but later on, you&#x2019;re probably gonna smile about it. That&#x2019;s all we&#x2019;re really trying to do with this whole business; we just want to make people smile.</p><p><strong>If we donate $25 to your Kickstarter campaign, can we get a shake named after us? What do you think a Nashvillest shake would have in it?</strong></p><p><em>ALE</em>: YEAH, YOU CAN! We&#x2019;d love a Nashvillest shake! What I like about Nashvillest is that at first, it seems like a pretty straight-forward news round up, but then you get to reading, hit lines like &#x201C;Some baby clouded leopards were born at the zoo a few days ago and they&#x2019;re so fluffy we wanna die,&#x201D; and realize you&#x2019;re onto something goofy and brilliant. Based on that, my first impulse is a strawberry milkshake backed with pink lemonade, something old-school with a little twist of personality. But hey, that pledge means you get to name it and make us put all your favorite flavors in it, so it&#x2019;s all you, Nashvillest!</p><p>[Editor&#x2019;s Note: We totally donated $25 to get our own shake. Also, the following image makes us laugh.]</p><p><a href=\"http://nashvillest.com/wp-content/uploads/2011/04/mooversshakers.jpg\"><img class=\"alignnone size-full wp-image-6855\" title=\"mooversshakers\" src=\"http://nashvillest.com/wp-content/uploads/2011/04/mooversshakers.jpg\" alt=\"\" width=\"341\" height=\"256\"></a></p>"}