{"id":"6945","name":"riffs-fine-street-food-crafts-creative-caribbean-asian-flavors-on-wheels","title":"Riff&#x2019;s Fine Street Food: Creative Caribbean, Asian Flavors On Wheels","author":"Morgan Levy","date":"2011-05-05T12:00:00-05:00","tags":["food trucks","little filipino","moovers &amp; shakers","musician&apos;s corner","riff&apos;s","riff&apos;s fine street food"],"categories":[],"contentEncoded":"<p><a href=\"http://nashvillest.com/wp-content/uploads/2011/05/Riffs-Logo.png\"><img class=\"size-full wp-image-7054 aligncenter\" title=\"Riffs Logo\" src=\"http://nashvillest.com/wp-content/uploads/2011/05/Riffs-Logo.png\" alt=\"\" width=\"390\" height=\"287\"></a></p><p>Yes, we&#x2019;re writing about another new Nashville food truck. No, we&#x2019;re not apologizing for that. <a href=\"http://riffstruck.com/\" target=\"_blank\">Riff&#x2019;s Fine Street Food</a> is ready to hit the streets this Saturday, and since it&#x2019;s been a week since we wrote about the debut of <a href=\"http://nashvillest.com/2011/04/28/little-filipino-egg-rolls-onto-the-nashville-food-truck-scene/\" target=\"_blank\">Little Filipino</a> and a whopping one day since the debut of <a href=\"http://nashvillest.com/2011/05/04/a-milkshake-truck-update-the-shaking-starts-today/\" target=\"_blank\">Moovers &amp; Shakers</a>, we&#x2019;re ready for some new truck food to fill our bellies.</p><p>The menu at Riff&#x2019;s will lean heavily toward Caribbean and Asian dishes, but it won&#x2019;t stop there. Chefs&#xA0;B.J. Lofback and Carlos Davis are passionate about serving fresh, local, sustainable ingredients and forming partnerships with local farmers, and that makes their menu possibilities endless. They&#x2019;ll be starting out with a few of their Caribbean specialty staples this weekend, but expect to be surprised every time you visit the truck. They sum up their mission better than we ever could:</p><blockquote><p><em>How do you take something from the streets of Bangkok or Oaxaca and expect to do it any justice on the street in Nashville? No more than you can expect to replicate a Jimi Hendrix guitar riff note for note. But what you do is take what you&#x2019;ve learned from those masters and create. Some things will be note for note, and liberties will be taken with others. This is what you can expect from our food. Like a really good cover band the song list will change, but there will be many standards.<br></em></p></blockquote><p>Riff&#x2019;s big debut is this Saturday, May 7 and they&#x2019;re rolling out with two events. They&#x2019;ll have a stand at the Richland Avenue Home &amp; Garden Tour from 11am-5pm, while simultaneously unveiling the truck at the first <a href=\"http://nashvillest.com/2011/04/27/musicians-corner-is-back-for-round-two-free-outdoor-music-this-summer/\" target=\"_blank\">Musician&#x2019;s Corner</a> from 3-6pm! Expect an all-Caribbean menu this weekend, featuring Jerk Chicken with their special homemade jerk seasoning, beans &amp; rice and more. After this weekend, they&#x2019;ll have a regular spot at the Woodbine Farmer&#x2019;s Market on Saturdays and are currently seeking out spots for a Thursday-Saturday lunch route.</p><p>Hungry for some fine street food? Keep up with Riff&#x2019;s whereabouts and what they&#x2019;re serving on <a href=\"http://twitter.com/#!/riffstruck\" target=\"_blank\">Twitter</a> and <a href=\"http://www.facebook.com/riffstruck\" target=\"_blank\">Facebook</a>. And while we&#x2019;re talking about Twitter, you can keep up with all of the local food trucks by following our <a href=\"http://twitter.com/#!/list/nashvillest/nashville-food-trucks\" target=\"_blank\">Nashville Food Trucks Twitter list</a>.</p>"}