{
 "id": "6948",
 "name": "nashvilles-farmers-markets-local-food-movement-continues-to-grow",
 "title": "Nashville&#x2019;s Farmer&#x2019;s Markets: Local Food Movement Continues To Grow",
 "author": "Morgan Levy",
 "date": "2011-05-11T14:00:00-05:00",
 "tags": [
  "12 south farmers market",
  "east nashville farmer&apos;s market",
  "fleur de lis flavors",
  "mas tacos",
  "nashville farmer&apos;s market",
  "riff&apos;s fine street food",
  "taste of belgium",
  "west nashville farmer&apos;s market",
  "woodbine farmers market"
 ],
 "categories": [],
 "contentEncoded": "<p><a href=\"http://www.flickr.com/photos/greystgirl/3687445583/\" target=\"blank\"><img class=\"aligncenter\" src=\"http://farm3.static.flickr.com/2491/3687445583_efbe6303eb.jpg\" alt=\"\"></a></p>\n<p><strong><span style=\"font-weight: normal;\">In the past four years, the local food movement has really taken root in Nashville (yes, pun intended, and no, we&#x2019;re not talking about when they built Whole Foods). Neighborhood farmers markets have been popping up on all sides of town, and this year is no different. The Woodbine Farmers Market, East Nashville Farmers Market and West Nashville Farmers Market all return to their respective communities this month, and 12 South joins them on May 24 with a new farmers market of its very own. It can get confusing trying to keep track of when each market is open, so we&#x2019;ve put together a little guide to Nashville&#x2019;s 2011 farmers markets for you. </span></strong></p>\n<p><strong><a href=\"http://www.eastnashvillemarket.com/\" target=\"_blank\">East Nashville Farmers Market<br>\n</a></strong><em>210 South 10th Street, Wednesdays from 3:30-6:30pm, May 11 &#x2013; October 26.</em></p>\n<p>The East Nashville Farmers Market opens today at the corner of 10th and Russell, and if their grand opening celebration is any indication of what&#x2019;s in store for the rest of the year, we&#x2019;re in for a treat. The grand opening today will have special guests, live music and even a petting zoo.&#xA0;Councilman Mike Jamison and chefs Tandy Wilson, Jeremy Barlow, Laura Wilson and Jen Franzen will be on hand for the ribbon cutting ceremony to kick things off, and more than 30 local vendors will be set up to sell you local produce, dairy, meats, prepared foods and other handmade goods each week. Even East Nashville&#x2019;s own food truck pioneer, Mas Tacos, will be making a now-rare daytime appearance at the market each week. One of the biggest changes this year is that vendors will be set up to accept&#xA0;SNAP/food stamps, making healthy local food more accessible to the community.&#xA0;<em>Keep up with the East Nashville Farmers Market on <a href=\"http://www.facebook.com/eastnashvillefarmersmarket\" target=\"_blank\">Facebook</a> and <a href=\"https://twitter.com/#!/enfarmersmkt\" target=\"_blank\">Twitter</a></em>.</p>\n<p><strong><a href=\"http://www.woodbinefarmersmarket.com/\" target=\"_blank\">Woodbine Farmers Market</a></strong><br>\n<em>Coleman Park Community Center, 384 Thompson Lane, Saturdays from 9am-12pm, May 14 &#x2013; November. </em></p>\n<p>The Woodbine Farmers Market is coming up on its own grand opening, this Saturday from 9am-12pm. The time and date have changed from last year, so take note! Over 20 local vendors will sell everything from the staples &#x2013; produce, meat, dairy &#x2013; to the specialties &#x2013; pasta, coffee, and fancy baked goods. One of Nashville&#x2019;s newest food trucks,&#xA0;<a href=\"http://nashvillest.com/2011/05/05/riffs-fine-street-food-crafts-creative-caribbean-asian-flavors-on-wheels/\" target=\"_blank\">Riff&#x2019;s Fine Street Food</a>,&#xA0;will also be a regular fixture at the market this year. Speaking of Riff&#x2019;s, Chef Carlos Davis will be holding a Teaching Kitchen at the market&#x2019;s grand opening with two cooking demonstrations held at 9:45am and 10:45am. Other grand opening festivities include live music from Robby Hecht and a bilingual (Spanish and English) storytime for the kiddos at 11am. And if you can&#x2019;t make it out this week, be sure to save the date for May 21st&#x2019;s special Green Market Festival and <a href=\"http://www.woodbinefarmersmarket.com/about/special-events-calendar/\" target=\"_blank\">other special events the last Saturday of every month</a>.&#xA0;<em>Keep up with the Woodbine Farmers Market on <a href=\"http://www.facebook.com/pages/Woodbine-Farmers-Market/129796070429823\" target=\"_blank\">Facebook</a> and </em><a href=\"https://twitter.com/#!/woodbinefrmsmkt\" target=\"_blank\"><em>Twitter</em></a><em>. </em></p>\n<p><strong><a href=\"http://www.westnashvillefarmersmarket.com/\" target=\"_blank\">West Nashville Farmers Market</a></strong><br>\n<em>Richland Park, 4601 Charlotte Pike, Saturdays from 9am-12pm, April &#x2013; November</em>.</p>\n<p>The West Nashville Farmers Market has already been open for several weeks. With nearly 30 vendors and a handful of Nashville favorites &#x2013; Bongo Java, The Green Wagon, Bang Candy Company and more &#x2013; this market is settling in for another strong year.&#xA0;It&#x2019;s a Celebration of Strawberries this Saturday at the market &#x2013; buy local, organic strawberries from vendors and participate in the annual strawberry contest. Okay, so we&#x2019;re not really sure what a strawberry contest is, but we&#x2019;re sure they&#x2019;ll tell you.&#xA0;<em>Keep up with the West Nashville Farmers Market on <a href=\"http://www.facebook.com/pages/West-Nashville-Farmers-Market/109065569155752\" target=\"_blank\">Facebook</a> and <a href=\"https://twitter.com/#!/WestNashFrmsMkt\" target=\"_blank\">Twitter</a>.</em></p>\n<p><strong><a href=\"http://www.12southfarmersmarket.com/\" target=\"_blank\">12 South Farmers Market</a></strong><br>\n<em>Sevier Park, 3000 Granny White Pike, Tuesdays from 3:30-6:30pm, May 24 &#x2013; October</em>.</p>\n<p>The newest farmers market on the block, the 12 South Farmers Market will provide locally grown and produced food and goods to the 12 South community. They throw open the doors in just two weeks on May 24, and already have over 20 vendors lined up to participate. In true 12 South form, opening day will double as a Mustache May contest, so bring your best &#x2018;staches and come ready to be judged. Other special events will take place the third week of every month, so mark your calendars! <em>Keep up with the 12 South Farmers Market on </em><a href=\"http://www.facebook.com/pages/12-South-Farmers-Market/102768133140758\" target=\"_blank\"><em>Facebook</em></a><em> and </em><a href=\"https://twitter.com/#!/12SouthFrmsMkt\" target=\"_blank\"><em>Twitter</em></a><em>.</em></p>\n<p><em><strong><span style=\"font-style: normal;\"><a href=\"http://www.facebook.com/pages/Lenox-Village-Farmers-Market/86708711545\" target=\"_blank\">Lenox Village Farmers Market<br>\n</a></span><span style=\"font-weight: normal;\">6901 Lenox Village Drive by Menchie&#x2019;s and LePooch, Saturdays from 8am-1pm, May 28 &#x2013; September 24.</span></strong></em></p>\n<p>The Lenox Village Farmers Market is perhaps the tiniest in the area, but shouldn&#x2019;t go unnoticed. Around a dozen vendors gather each Saturday morning to sell fruits, veggies, Amish cheese and butter, beef, soup, baked goods and more. Non-food vendors are allowed on holiday weekends, and the farmers market is known to support local charities. <em>Thanks to readers Aubrey and&#xA0;MousAny82 for the Lenox Village market info!</em></p>\n<p><strong><a href=\"http://nashvillefarmersmarket.org/\" target=\"_blank\">Nashville Farmers Market</a></strong><br>\n<em>900 Rosa Parks Blvd, open all week year-round from 8am-5pm (merchant hours vary)</em>.</p>\n<p>With all of the excitement of the new neighborhood farmers markets, don&#x2019;t forget the year-round Nashville Farmers Market this summer. After sustaining some pretty significant flood damage last year, the market is all dried out, renovated, and everyone is back open for business and we couldn&#x2019;t be happier about that.&#xA0;We love to spend a Saturday morning meandering around and exploring the different vendors, international markets and ethnic foods. On the weekends you&#x2019;ll find row after row of vendors with produce, meats, cheese, jams, honey, spices, herbs and more in the outdoor market. When you finish your shopping, head inside for a bite to eat from one of the amazing local restaurants &#x2013; If you want Jamaican, Mediterranean, Cajun, Indian or good old fashioned BBQ, it&#x2019;s all there. Top it off with a New Orleans-style snowball from Fleur de lis Flavors or an authentic Belgian waffle from new vendor Taste of Belgium and call it a day well spent. <em>Keep up with the Nashville Farmers Market on </em><a href=\"http://www.facebook.com/pages/Nashville-Farmers-Market/43014469371\" target=\"_blank\"><em>Facebook</em></a><em> and <a href=\"https://twitter.com/#!/nashfarmmarket\" target=\"_blank\">Twitter</a>. </em></p>\n<p><em>Photo by&#xA0;<span id=\"yui_3_3_0_1_13051410312831074\"><a href=\"http://www.flickr.com/photos/greystgirl/3687445583/\" target=\"_blank\">&#x112;va Maria</a>.</span></em></p>"
}