{"id":"7160","name":"the-weekendist-sugar-coma-edition","title":"The Weekendist: Sugar Coma Edition","author":"Morgan Levy","date":"2011-05-20T10:00:00-05:00","tags":["weekendist"],"categories":[],"contentEncoded":"<p><a href=\"http://www.flickr.com/photos/tadsonbussey/4207302973/\" target=\"blank\"><img class=\"aligncenter\" src=\"http://farm3.static.flickr.com/2615/4207302973_77338d2c18.jpg\" alt=\"\"></a></p><p>&#xA0;</p><p>It&#x2019;s time to loosen your belts a notch or two (sorry about that). Between all-you-can-eat cupcakes, a free ice cream social and fEASTing galore, this weekend is a lot to chew on. Here are our top picks for the next few days:</p><p><strong><a href=\"http://www.hon.org/HomePage/index.php/home.html  \" target=\"_blank\">Hands on Nashville&#x2019;s 20th Birthday Ice Cream Social</a></strong>. <em>Friday, May 20 at Bridgestone Arena Plaza, 11am-1pm, free</em>. Hands on Nashville is celebrating its 20th birthday by hosting a giant volunteer appreciation event downtown. Dairy Queen will be on hand with a complimentary Dilly Bar, whatever that is (keep it clean, folks) and other frozen treats.</p><p><strong><a href=\"http://www.facebook.com/cupcakepalooza\" target=\"_blank\">Cupcake-Palooza</a></strong>. <em>Friday, May 20 at Belmont UMC (2007 Acklen), 4:30pm, $15 adults/$5 kids</em>. Got a serious sweet tooth? Think you can devour your weight in frosted treats? Head to Cupcake-Palooza for all you can eat sweets from dozens of cupcakeries and local bakers, including Aunt April&#x2019;s Bakery, Cupcake Collection, Sparkle Cupcakes, The Painted Cupcake, Royal Icing Custom Cakes, Publix and more. Bonus: It&#x2019;s a fundraiser for Books from Birth, so you can feel great about shelling out $15 for an afternoon of utter gluttony. It&#x2019;s for the kids!</p><p><strong><a href=\"http://nashvillefarmersmarket.org/event/night_market\" target=\"_blank\">Night Market</a></strong>. <em>Friday, May 20 at the Nashville Farmer&#x2019;s Market, 6:30-8:30pm, free</em>. It&#x2019;s time for Night Market again, one of our favorite nights of the month! The Nashville Farmers Market opens at night for an evening of shopping under the stars. Sample vendors&#x2019; local wares, eat at one of the many markethouse restaurants, and treat yourself to an adult beverage (or two).</p><p><strong><a href=\"http://www.walkbikenashville.org/tourdenash\" target=\"_blank\">Tour De Nash</a></strong>. <em>Saturday, May 21 at 8am, Vanderbilt parking lots off Nachez Trace, free/$35</em>. Want to get to know Nashville&#x2019;s bike lanes and greenways? Tour de Nash is the perfect intro, offering a 1.5 mile ride for kids, a 15 mile family ride and two more advanced rides (29 or 58 mile routes). The shorter rides are free, the longer rides require a $35 registration fee and come with a Tour de Nash t-shirt.  Get to know your city, and don&#x2019;t forget your helmet!</p><p><strong><a href=\"http://feastivalnashville.com/\" target=\"_blank\">fEASTival Nashville</a></strong>. <em>Saturday, May 21 in East Nashville&#x2019;s Five Points, 12-11pm, free</em>. We&#x2019;re all about festivals here at Nashvillest, and East Nashville sure knows how to throw &#x2019;em. The brand new fEASTival celebrates independent culture and the local community, from music to art to food. They have the day packed full of musical performances, activities for the kids, an Art Village and a Food Village, and we hear that vendors both new and old have very special menus planned.</p><p><strong><a href=\"http://www.nashvillerollergirls.com/\" target=\"_blank\">Nashville Rollergirls vs. Jet City and Vette City</a></strong>. <em>Saturday, May 21 at Municipal Auditorium, 5:30pm, $15</em>.&#xA0;It&#x2019;s no secret that we&#x2019;re kind of obsessed with the Rollergirls around these parts. Their second home bout of the season is this weekend, and they&#x2019;re battling our neighbors from Bowling Green in another double header. We&#x2019;ll be ringside, screaming our lungs out&#x2026; Won&#x2019;t you join us?</p><p><strong><a href=\"http://www.facebook.com/event.php?eid=153799211351803\" target=\"_blank\">12South Neighborhood Movie Night &#x2013; The Goonies</a></strong>. <em>Saturday, May 21 at Sevier Park, 8pm, free</em>. A new movies in the park series? You won&#x2019;t see us complaining, especially if they keep picking such great movies! Head to the first 12South movie in the park to watch <em>The Goonies </em>on the big screen and bond with cicadas.</p><p><strong><a href=\"http://www.nashvillesymphony.org/main.taf?p=1,1,3,3,1&amp;EventID=1011-DOM\" target=\"_blank\">Regions Free Day of Music at the Nashville Symphony</a></strong>. <em>Sunday, May 22 at the Schermerhorn Symphony Center, 12-9pm, free</em>. Whether it&#x2019;s hosting <a href=\"http://nashvillest.com/2011/04/21/sounds-like-summer-nashville-symphony-to-host-free-community-concerts-once-again/\" target=\"_blank\">community outdoor concerts</a> or opening their doors and hosting a big shebang in the Schermerhorn, the Nashville Symphony knows how to give back to this city. Their annual free day of music will fire up at noon on Saturday and run all day, culminating in a free performance by the Nashville Symphony at 7. <a href=\"http://www.nashvillesymphony.org/res/2011_dom.pdf\" target=\"_blank\">Grab the whole schedule here</a>.</p><p><em>Photo by <a href=\"http://www.flickr.com/photos/tadsonbussey/4207302973/\" target=\"_blank\">Tadson</a>.</em></p>"}