{"id":"7359","name":"jenis-splendid-ice-creams-opens-first-tennessee-shop-june-24-in-east-nashville","title":"Jeni&#x2019;s Splendid Ice Creams Opens First Tennessee Shop June 24 In East Nashville","author":"Morgan Levy","date":"2011-06-14T17:00:00-05:00","tags":["east nashville","freebies","grand opening","ice cream","jeni&apos;s splendid ice creams"],"categories":[],"contentEncoded":"<p><a href=\"http://nashvillest.com/wp-content/uploads/2011/06/321887839.jpg\"><img class=\"size-full wp-image-7364 aligncenter\" title=\"321887839\" src=\"http://nashvillest.com/wp-content/uploads/2011/06/321887839.jpg\" alt=\"\" width=\"360\" height=\"480\"></a></p><p>We&#x2019;ve been anticipating the opening of Jeni&#x2019;s Splendid Ice Creams in East Nashville since we first read the name on the building permit. Sure, you can get Jeni&#x2019;s at Hot &amp; Cold in Hillsboro Village, but we were drawn in by the magic of one of Jeni&#x2019;s Columbus ice cream shops about a year ago and now we just can&#x2019;t get enough. Jeni&#x2019;s East Nashville shop is the first full shop outside of Ohio, and like each of the nine other locations, it will carry the full line of Signature and Seasonal flavors, sundaes, floats, made-from-scratch waffle cones and ice cream macaroons.</p><p>If you&#x2019;ve set foot inside Hot &amp; Cold, you may have had the opportunity to try a limited range of Jeni&#x2019;s flavors, but get ready for the real deal. Cherry Lambic Sorbet, Goat Cheese with Red Cherries, Rhubarb and Lime Cardamom Yogurt, Rockmill Golden Ale &amp; Apricots, Riesling Poached Pear Sorbet and Corn Syrup Custard with Whiskey and Pecans are just a few of the flavors you&#x2019;ll find in the full lineup.</p><p>You can find the new shop in East Nashville&#x2019;s Walden building, next to Ugly Mugs and the Silly Goose at 1892 Eastland Ave. It officially opens on Friday, June 24, but they&#x2019;re opening for a sneak peek from 7-10pm on Thursday, June 23 (and you know what that means&#x2026; free ice cream for all)! President &amp; Founder Jeni Britton Baeur will also be on hand to host and share stories behind the flavors, and y&#x2019;all might have to hold us back if we have the sudden urge to run up and kiss her for inventing that Bangkok Peanut ice cream.</p>"}