{
 "id": "7508",
 "name": "bright-early-bigger-fish-to-fry-edition",
 "title": "Bright &amp; Early: Bigger Fish To Fry Edition",
 "author": "Christy Frink",
 "date": "2011-07-25T09:30:00-05:00",
 "tags": [],
 "categories": [],
 "contentEncoded": "<p><a href=\"http://www.flickr.com/photos/rjsdad/5969913074/in/pool-715021@N24/\"><img class=\"aligncenter\" src=\"http://farm7.static.flickr.com/6146/5965237827_2beea4e772.jpg\" alt=\"\" width=\"500\" height=\"333\"></a></p>\n<p>Good morning, Nashville.&#xA0;With Metro&#x2019;s election day just around the corner, <a href=\"http://www.tennessean.com/article/20110723/NEWS0202/307230027/2275/RSS05\" target=\"_blank\">it seems relevant to note that six of our candidates, including two incumbents, have criminal backgrounds</a>. As misdemeanors don&#x2019;t bar someone from running for office in Davidson County, it&#x2019;s totally legal for these folks to run. Offenses seem to mostly include DUIs with a little trespassing and assault on the side. And speaking of, er, interesting Metro Council races, there never seems to be a dull moment in East Nashville&#x2019;s District 5 where <a href=\"http://www.wsmv.com/story/15136538/fight-for-district-5-metro-council-heats-up\" target=\"_blank\">candidate Pam Murray decided to have a little fish fry directly across the street from opponent Scott Davis&#x2019; house on Saturday</a>. Murray, <a href=\"http://nashvillecitypaper.com/content/city-news/pam-murray-sues-councilman-former-constituents\" target=\"_blank\">who was ousted by District 5 voters and replaced by Jamie Hollin last year</a>, also got in a bit of trouble last week for offering free fish sandwiches in exchange for taking voters to the polls.</p>\n<ul>\n<li><strong>As The County Clerk&#x2019;s Office Turns. </strong>Meanwhile, members of the Metro Council are now calling for County Clerk John Arriola&#x2019;s resignation following weeks of controversy about Arriola allegedly charging a $40 &#x201C;gratuity&#x201D; for all weddings performed, then pocketing the cash. The TBI has been checking into it, and <a href=\"http://www.tennessean.com/article/20110724/NEWS0202/307240066/2275/RSS05\" target=\"_blank\">it&#x2019;s recently come to light that he never disclosed the estimated $30,000 per year in gratuities on his ethics forms</a>.</li>\n<li><strong>Stabbing at downtown Provence. </strong>A Metro Police officer and homeless man both wound up in the hospital on Friday afternoon after <a href=\"http://www.wkrn.com/story/15130420/metro-officer-stabs-homeless-man-trying-to-grab-gun\" target=\"_blank\">the homeless man cornered the officer in the bathroom at Provence Breads &amp; Cafe downtown and allegedly tried to swipe his gun</a>. The officer pulled out a knife and stabbed the man in the leg and got a little scuffed up himself in the process. The homeless man is expected to recover and will be charged with attempted aggravated assault on a police officer.</li>\n<li><strong>Bits &amp; pieces. </strong><a href=\"http://nashvillewx.com/2011/07/more-showers-for-monday/\" target=\"_blank\">We could see some more thunderstorms today</a> &#x2026; <a href=\"http://www.wkrn.com/story/15136410/carriages-drivers-take-special-steps-in-heat\" target=\"_blank\">Humans aren&#x2019;t the only ones struggling with the heat</a> these days &#x2026; Tennessee has automated the parole check-in process for 3,500 felons, including convicted murders. <a href=\"http://www.tennessean.com/article/20110724/NEWS03/307240093/2275/RSS05\" target=\"_blank\">This means that instead of reporting to a real person, they call in and select options from a phone tree</a> &#x2026; <a href=\"http://www.newschannel5.com/story/15133260/several-shoplifting-cases-reported-in-hillsboro-village\" target=\"_blank\">Shoplifting is on the rise in Hillsboro Village</a>.</li>\n</ul>\n<p><em>Photo by <a href=\"http://www.flickr.com/photos/rjsdad/5969913074/in/pool-715021@N24/\" target=\"_blank\">Eva Maria</a>.</em></p>"
}