{
 "id": "7679",
 "name": "soundland-2011-gets-started-next-week-so-why-not-give-away-some-free-wristbands",
 "title": "SoundLand 2011 Gets Started Next Week, So Why Not Give Away Some Free Wristbands?",
 "author": "Morgan Levy",
 "date": "2011-09-12T18:00:00-05:00",
 "tags": [
  "next big nashville",
  "ninjasaur",
  "soundland",
  "soundland 11"
 ],
 "categories": [
  "Culture &amp; Arts",
  "Featured",
  "Music City"
 ],
 "contentEncoded": "<p style=\"text-align: center;\"><a href=\"http://nashvillest.com/wp-content/uploads/2011/09/Screen-Shot-2011-09-12-at-5.50.31-PM.png\"><img class=\"size-full wp-image-7680 aligncenter\" title=\"Screen Shot 2011-09-12 at 5.50.31 PM\" src=\"http://nashvillest.com/wp-content/uploads/2011/09/Screen-Shot-2011-09-12-at-5.50.31-PM.png\" alt=\"\" width=\"463\" height=\"178\"></a></p>\n<p style=\"text-align: left;\"><em>Update: Winner has been notified, we&#x2019;re waiting to confirm acceptance and then we&#x2019;ll post the name!</em></p>\n<p><a href=\"http://www.nbnsoundland.com/\" onclick=\"javascript:_gaq.push([&apos;_trackEvent&apos;,&apos;outbound-article&apos;,&apos;www.nbnsoundland.com&apos;]);\" target=\"_blank\">SoundLand</a> &#x2013; the 2011 reincarnation of what you may remember fondly as Next Big Nashville &#x2013; gets started next Wednesday, and if you&#x2019;re bemoaning last Friday&#x2019;s wristband price increase (sorry, we should have warned you), then keep reading. We&#x2019;re giving away a pair of wristbands to the fest this week, and entering to win is a piece of cake.</p>\n<p>But first, a little bit about SoundLand, since we&#x2019;ve been painfully negligent as info and lineup announcements have rolled out this year. If you&#x2019;ve taken part in Next Big Nashville over the past few years, the formula is familiar: Four days of music, workshops and parties spread across downtown Nashville. What&#x2019;s new (besides the name)? More nationally-recognized touring artists, for starters. Probably more food trucks, though we don&#x2019;t see anything about that in the FAQ (call it a hunch). And&#xA0;a <a href=\"http://www.nbnsoundland.com/pages/about/faqs/\" onclick=\"javascript:_gaq.push([&apos;_trackEvent&apos;,&apos;outbound-article&apos;,&apos;www.nbnsoundland.com&apos;]);\" target=\"_blank\">28-foot tall NINJASAUR inflatable slide</a>.</p>\n<p>The venues are also more centrally located this year, which is convenient for us and our never-ending quest for free drinks (<a href=\"http://www.nbnsoundland.com/pages/about/parking-and-shuttle/\" onclick=\"javascript:_gaq.push([&apos;_trackEvent&apos;,&apos;outbound-article&apos;,&apos;www.nbnsoundland.com&apos;]);\" target=\"_blank\">SoundLand shuttle</a>, we&#x2019;re looking at you). Shows will take place at&#xA0;Mercy Lounge, Cannery Ballroom, the Neuhoff Factory in Germantown, War Memorial Auditorium, Third Man Records, 12th &amp; Porter, MAI, The Basement, The Station Inn and an outdoor block party stage at 12th and Porter.</p>\n<p>This year&#x2019;s lineup boasts some big names &#x2013; Foster the People, M. Ward, Ghostland Observatory, Yelawolf, Justin Townes Earle, Big K.R.I.T., Dawes, Bonobo and JEFF the Brotherhood are all slated for headlining spots. Beyond that, both local Nashville artists and visiting favorites flesh out the list of 85+ acts on board for the fest. A full list can be found at the bottom of this post or by <a href=\"http://lineup.nbnsoundland.com/\" onclick=\"javascript:_gaq.push([&apos;_trackEvent&apos;,&apos;outbound-article&apos;,&apos;lineup.nbnsoundland.com&apos;]);\" target=\"_blank\">clicking here</a>.</p>\n<p><strong>Sold! Now how can you win the wristbands?</strong> Easy. You have until 11:59pm on Thursday, September 15 to complete one or both of the following items, and you&#x2019;ll be entered to win!</p>\n<ol>\n<li><strong>Leave a comment on this post and tell us&#xA0;what you&#x2019;re looking forward to the most at Soundland 2011</strong>. You can tell us other things in your comment too, but that&#x2019;s the only thing that&#x2019;s required. You also need to provide a valid email address so we can contact you if you win.</li>\n<li><strong>Head over to Twitter and post a tweet that has both a link to this post AND the hashtag <a href=\"http://twitter.com/#!/search/realtime/%23freesoundland\" onclick=\"javascript:_gaq.push([&apos;_trackEvent&apos;,&apos;outbound-article&apos;,&apos;twitter.com&apos;]);\" target=\"_blank\">#freesoundland</a></strong>. Here is a sample tweet, but feel free to concoct your own (just include the link and the hashtag, please and thank you): <em>Dear @nashvillest, please send me to @SoundLand to see @mwardtweeting @fosterthepeople &amp; more for free! http://bit.ly/freesoundland #freesoundland</em></li>\n</ol>\n<p>Complete one of the items above and you&#x2019;ll be entered to win once. Complete both of the items above and you&#x2019;ll be entered in the drawing, you guessed it, twice! If you don&#x2019;t follow the instructions above, you won&#x2019;t win. One random winner will be selected to receive a pair of GA wristbands (that&#x2019;s one for you and one for a guest, a $130-150 value). The winner will be announced some time on Friday, September 16 and will have 12 hours from time of notification to claim the wristbands before we give them to someone else or keep them for ourselves (just kidding, just kidding. But we will give them to someone else). You should probably live in Nashville or within driving distance, because we&#x2019;re not paying for travel, lodging or any of your expenses while at the fest. Just the wristbands, folks!</p>\n<p>If you aren&#x2019;t our lucky winner, you&#x2019;ll probably want to go ahead and <a href=\"http://www.nbnsoundland.com/pages/tickets/wristbands/\" onclick=\"javascript:_gaq.push([&apos;_trackEvent&apos;,&apos;outbound-article&apos;,&apos;www.nbnsoundland.com&apos;]);\" target=\"_blank\">buy a wristband anyway</a>. At $65 (or $75 if you wait &#x2019;till the 21st), they&#x2019;re a steal for four days of music. For those with a little more padding in their pockets, VIP badges get you in to all the parties, concerts and field trips plus a giant swag bag for $150. It&#x2019;s silly to purchase single show tickets unless you really only want to go to one show, but <a href=\"http://www.nbnsoundland.com/pages/tickets/single-shows/\" onclick=\"javascript:_gaq.push([&apos;_trackEvent&apos;,&apos;outbound-article&apos;,&apos;www.nbnsoundland.com&apos;]);\" target=\"_blank\">here is a link to single show tickets anyway</a>. Once you have your wristband or badge, be sure to <a href=\"http://lineup.nbnsoundland.com/events/2011/09/21/\" onclick=\"javascript:_gaq.push([&apos;_trackEvent&apos;,&apos;outbound-article&apos;,&apos;lineup.nbnsoundland.com&apos;]);\" target=\"_blank\">build your own personal schedule</a> so you don&#x2019;t miss out on any of the shows you want to see.</p>\n<p><strong>Soundland 2011: September 21-24<br>\n</strong><a href=\"http://www.nbnsoundland.com\" onclick=\"javascript:_gaq.push([&apos;_trackEvent&apos;,&apos;outbound-article&apos;,&apos;www.nbnsoundland.com&apos;]);\" target=\"_blank\">http://www.nbnsoundland.com</a></p>\n<p><em>The Fine Print: There is none. Also, we&#x2019;re not getting compensation in the form of money or even free rides on the inflatable ninjasaur slide from NBN or Soundland for writing this post. This is sad for us, but means that we&#x2019;re in a happy place with the FTC, so it&#x2019;s all good. </em></p>\n<p><em><span id=\"more-7679\"></span>The Full Lineup: </em></p>\n<p>Foster the People, M. Ward, Ghostland Observatory, Yelawolf, Justin Townes Earle, Big K.R.I.T., Dawes, Bonobo, JEFF the Brotherhood, Jason Isbell &amp; The 400 Unit, CULTS, Paper Route, Those Darlins, Royal Bangs, Jessica Lea Mayfield, The Low Anthem, Tristen, Carl Broemel, Madi Diaz, Caitlin Rose, Robert Ellis, PUJOL, Chanellor Warhol, Jonny Corndawg, Reptar, Fine Peduncle, Uncle Skeleton, My So-Called Band, The Apache Relay, MyNameIsJohnMichael, Natalie Prass, Evan P. Donohue, Keegan DeWitt, Machines Are People Too, Ben Soilee, The Watson Twins, Kyle Andrews, Sleepy Sun, Boss of Nova, The Ettes, How I Became The Bomb, Cherub, Kingston Springs, Jasmin Kaset, Sam &amp; Tre, Rich Robinson, The Pink Spiders, The Non-Commissioned Officers, Treekeeper, Cheer Up Charlie Daniels, SPELLS, By Lightning!, The Lonely H, Humming House, The Cadillac Black, Snowden, Charlie Mars, The Bridges, Lydia Loveless, The Silver Seas, The Floorwalkers, Richie, Erick Baker, The Co, Painted Desert, Andrew Combs, The Black Belles, Action!, Neil Hamburger, Shelly Colvin, Stix Izza, Adam Faucett, Roman Candle, Colorfeels, Ziggurat, Alabama Shakes, Hans Condor, Human Eye, Brent Kirby, Call It Dope!, Elliot Collett, Openmic, Danyl Johnson, Tiger High<em><br>\n</em></p>\n\n\n\n\n<p>Related posts:<ol><li><a href=\"http://nashvillest.com/2009/08/27/live-on-the-green-launches-next-week-with-ten-out-of-tenn/\" rel=\"bookmark\" title=\"Permanent Link: Live On The Green Launches Next Week With Ten Out Of Tenn\">Live On The Green Launches Next Week With Ten Out Of Tenn</a></li>\n<li><a href=\"http://nashvillest.com/2009/10/13/double-the-free-frist-fun-this-week-freebies/\" rel=\"bookmark\" title=\"Permanent Link: Double The Free Frist Fun This Week [Freebies]\">Double The Free Frist Fun This Week [Freebies]</a></li>\n<li><a href=\"http://nashvillest.com/2009/06/09/now-taking-submissions-2009-cmapocalypse-bingo-nashvillest-contests-cmapocalypse-2009/\" rel=\"bookmark\" title=\"Permanent Link: Now Taking Submissions: 2009 CMApocalypse Bingo [Nashvillest Contests] [CMApocalypse 2009]\">Now Taking Submissions: 2009 CMApocalypse Bingo [Nashvillest Contests] [CMApocalypse 2009]</a></li>\n</ol></p>\t\t\t\t\t\t\t\t\t\t\t<!--END .entry-content .article-->"
}