{"id":"7799","name":"a-beer-fest-for-every-season-12-south-winter-warmer-tickets-on-sale-tomorrow","title":"A Beer Fest For Every Season: 12 South Winter Warmer Tickets On Sale Tomorrow","author":"Morgan Levy","date":"2011-10-13T12:00:00-05:00","tags":["12 south","12 south winter warmer","beer festival"],"categories":[],"contentEncoded":"<p><a href=\"http://nashvillest.com/wp-content/uploads/2011/10/Screen-Shot-2011-10-13-at-11.29.46-AM.png\"><img class=\"size-full wp-image-7800 aligncenter\" title=\"Screen Shot 2011-10-13 at 11.29.46 AM\" src=\"http://nashvillest.com/wp-content/uploads/2011/10/Screen-Shot-2011-10-13-at-11.29.46-AM.png\" alt=\"\" width=\"518\" height=\"170\"></a></p><p>What&#x2019;s the best way to keep from freezing in the cold month of December? Did you say &#x201C;turn on the heat&#x201D; or &#x201C;a pile of blankets and a crackling fire in the fireplace&#x201D;? Okay, so maybe you&#x2019;re right, but we like to think that a stiff drink works just as well. Enter <a href=\"http://12southwinterwarmer.com/\" target=\"_blank\">12 South Winter Warmer</a>, a new beer festival coming to 12 South&#x2019;s Sevier Park on December 10. An outdoor beer festival in December may seem a little strange, but we bet attendees will be toasty warm after tossing back a beer or ten.</p><p>12 South Winter Warmer will&#xA0;showcase the finest stouts, porters, barley wines, winter seasonals and barrel-aged beers from 25 craft breweries, both visiting and local. Food &amp; treats from 12 South Taproom, Burger Up, Jonbalaya Catering, Begley&#x2019;s Brats &amp; Dogs, Olive &amp; Sinclair and The Bloomy Rind will be available for purchase to soak up some of that booze sloshing around in your belly. Tickets go on sale tomorrow, and you&#x2019;d better get them fast! The fest can only accommodate 750 people, and you can be sure it will sell out.</p><p><strong>UPDATE: Whoa! Tickets sold out in just a few hours. We told you to get them fast.</strong></p><p><strong><a href=\"http://12southwinterwarmer.com/\" target=\"_blank\">12 South Winter Warmer</a>, December 10 in Sevier Park, 11am-4pm, $45. Tickets can be purchased <a href=\"http://www.ticketalternative.com/Events/15938.aspx\" target=\"_blank\">here</a> beginning Friday, October 13. Strictly 21+.</strong></p>"}