{"id":"7842","name":"the-swell-season-movie-sigur-ros-inni-screening-at-the-belcourt-this-fall","title":"The Swell Season Movie, Sigur R&#xF3;s&#x2019; &#x201C;Inni&#x201D; Screening At The Belcourt This Fall","author":"Morgan Levy","date":"2011-10-17T13:00:00-05:00","tags":["belcourt","documentary","inni","sigur ros","the swell season"],"categories":[],"contentEncoded":"<p><a href=\"http://www.flickr.com/photos/zachstone/3036524746/\" target=\"blank\"><img class=\"aligncenter\" src=\"http://farm4.static.flickr.com/3270/3036524746_c08a55ef1c.jpg\" alt=\"\"></a></p><p>Indie music film buffs, rejoice. The Belcourt has landed screenings of two of the must-see music films this fall &#x2013; <em>The Swell Season</em> documentary and&#xA0;Sigur R&#xF3;s&#x2019; live film&#xA0;<em>Inni</em>. Both films have made the festival rounds and are screening at only a handful of theaters across the world, and we&#x2019;re super excited that Nashville is getting in on the action. Here&#x2019;s a bit about each of the films and their trailers:</p><p><strong><em><a href=\"http://www.belcourt.org/events?id=77155\" target=\"_blank\">The Swell Season</a></em></strong></p><blockquote><p>In 2008, Glen Hansard and Marketa Irglova captivated audiences and earned two Academy Awards for their musical collaboration in the film Once, which reached $10 million at the box office and grew their popularity and fan base by tens of thousands in North America and throughout the world. As their fictional romance blurred with reality, they fell in love, recorded an album, and embarked on a world tour. Fueled by two years of exhilaration, performance, and psychological turmoil, THE SWELL SEASON is much more than a music documentary. It is a volatile and intimate portrait of a romance that fractures in the face of life on the road and personal tragedy. As Glen and Marketa&#x2019;s relationship unhinges, ultimately music prevails as their enduring connection.</p></blockquote><p><em>The Swell Season</em> screens Tuesday, October 18 at 7:30 and 9:30pm; Wednesday, October 19 at 6 and 10:15pm at the Belcourt. <a href=\"http://www.theswellseasonmovie.com/trailer/\" target=\"_blank\">TRAILER</a></p><p><strong><em><a href=\"http://www.belcourt.org/events?id=77297\" target=\"_blank\">Inni</a></em></strong></p><blockquote><p>Inni is Sigur R&#xF3;s&#x2019;s second live film following 2007&#x2032;s hugely-celebrated Heima. Whereas that film positioned the enigmatic group in the context of their Icelandic homeland, providing geographical, social, and historical perspectives on their otherworldly music, with uplifting results, Inni focusses purely on the band&#x2019;s performance, which is artfully and intimately captured by French-Canadian director Vincent Morisset (Arcade Fire&#x2019;s Miroir Noir). Interweaving archive material from the band&#x2019;s first ten years with the sometimes gossamer light, sometimes punishingly intense, concert footage, Inni is a persuasive account of one of the most celebrated and influential rock bands of recent years.</p></blockquote><p><em>Inni</em> screens Monday-Thursday, November 7-10 at 9:45pm at the Belcourt. <a href=\"http://www.sigur-ros.co.uk/band/disco/inni/inni-screenings.php\" target=\"_blank\">Preorder a physical copy of the film at Grimey&#x2019;s and get a free ticket</a>. <a href=\"http://www.sigur-ros.co.uk/band/disco/inni/inni-film.php\" target=\"_blank\">TRAILER</a></p><p><em>Photo by <a href=\"http://www.flickr.com/photos/zachstone/3036524746/\" target=\"_blank\">Zach Stone</a>. </em></p>"}