{"id":"7849","name":"bless-your-heart-the-ladies-of-the-jersey-shore-talk-nashville-tanning-tim-mcgraw-interviews","title":"Bless Your Heart: The Ladies Of The Jersey Shore Talk Nashville, Tanning &amp; Tim McGraw [Interviews]","author":"Your Friend Lela","date":"2011-10-17T14:00:00-05:00","tags":["jersey shore","jwoww","snooki"],"categories":[],"contentEncoded":"<p><a href=\"http://nashvillest.com/wp-content/uploads/2011/10/x2_8ca6d10.jpg\"><img class=\"size-full wp-image-7850 aligncenter\" title=\"x2_8ca6d10\" src=\"http://nashvillest.com/wp-content/uploads/2011/10/x2_8ca6d10.jpg\" alt=\"\" width=\"360\" height=\"480\"></a></p><p><em>Editor&#x2019;s Note: Sadly, both of your Nashvillest editors were out of town this weekend, but we knew our readers would be </em>dying<em> for the skinny on the <a href=\"http://nashvillest.com/2011/10/10/jersey-shores-snooki-jwoww-tanning-in-nashville-this-saturday/\" target=\"_blank\">Jersey Shore gals in Nashville</a>. So we dispatched our favorite Jersey Shore expert to get the scoop on how they feel about Nashville, country music and southern slang (and of course their new tanning lines). This is the tale she lived to tell.</em></p><p>This past Saturday was one of those rare, beautifully warm Tennessee fall days that you wish for all year long. For many, it was perfect for watching football, doing one last river run, and maybe putting in some much needed work in the garden. For ME, it seemed like a great opportunity to take my pasty white skin to the Smart Tan conference at the Nashville Convention Center to check out new sunless tanning lines by Jersey Shore stars Jenni &#x201C;JWoww&#x201D; Farley and Nicole &#x201C;Snooki&#x201D; Polizzi. I was able to snag a few minutes with the girls to chat about tanning, music, the incredibly painful [but fabulous!] shoes that JWoww and I were both wearing, and the Jersey Shore.</p><p><strong>Your Friend Lela: Welcome to Nashville guys! Is this your first time here?</strong><br>JWoww: No, I was actually here last year for the tanning convention.<br>Snooki: I was here last year for the CMT Awards.<br><em>[Editor&#x2019;s note: <a href=\"http://nashvillest.com/2010/06/08/let-the-games-begin-cmapocalypse-bingo-2010/\" target=\"_blank\">Remember that</a>, y&#x2019;all?]</em></p><p><strong>YFL: Did you have a good time there?</strong><br>Snooki: Yes! It was the best awards show I&#x2019;ve ever been to.<br><em>[YFL note: Really??]</em></p><p><strong>YFL: Did you do any honky tonking while you were here?</strong><br>Snooki: (confused) What&#x2019;s that mean?<br><em>[YFL Note: I then explain to her what a honky tonk is and obviously suggest that she hit up Roberts Western World and The Stage].</em></p><p><strong>YFL: I&#x2019;m curious, do you think Nashville&#x2019;s tanning is up to snuff, or do you think we need a little help in that department?</strong><br>JWoww: No! I think you guys are totally on point.<br>YFL: Not me! Clearly, I am the whitest person here.<br>JWoww: (laughing) It&#x2019;s all about a natural look! It&#x2019;s not about OD&#x2019;ing on it.</p><p><span id=\"more-7849\"></span></p><p><strong>YFL: So speaking of tanning, can you tell me a little bit about your new products?</strong><br>Snooki: In my line, we have three products, the Ultra Dark Black Bronzer, the Ultra Dark Tan Maximizer, and the Ultra Dark Hot Bronzer. I wanted the bottles to be like me, like animal print and sexy so it stands out on the shelf.<br>JWoww:  We have the spray tan [ JWoww Dark Instant Sunless Spray] for people that don&#x2019;t want to go in the tanning booth or the tanning bed but want a natural glow all year round. It&#x2019;s a 360 degree bottle which means it won&#x2019;t clog and it can go upside down like when you are trying to get your back and there&#x2019;s NO orange look.</p><p><strong>YFL: Is that what we see you using on the show before a night out in da clubs?</strong><br>JWoww: Yes! On Nicole and on Deena. I had the big containers that I brought to Italy that I used on them.  We also have the 50x Bronzer [ JWoww 50x Black Bronzer] that has bronzer AND moisturizer.</p><p><strong>YFL: How did your collaborations with each company come about? </strong>[JWoww&#x2019;s products are produced through Australian Gold and Snooki&#x2019;s with Supre Tan]<br>JWoww: Australian Gold gave me the first chance. They didn&#x2019;t know where I was going to go, I didn&#x2019;t even know where I was going to go, but Black Bronzer became very successful. I&#x2019;m so into my endorsements and Australian Gold is MY LIFE, so I wanted to create the private reserve for women for when you want to tighten your skin and get rid of cellulite. The spray tan I created for my fans who are nervous about getting into a bed and exposing themselves to UV light, but still wanted a great color. I talked to my fans about what they were concerned about, and created my products around what they told me.<br>Snooki: This is probably the number one product that I wanted to do because I want to brand myself as an entrepreneur. Now that it&#x2019;s finally done and I can show everybody, I&#x2019;m really proud of it.</p><p><strong>YFL:  Do you plan to make tanning and beauty the next step in your career when Jersey Shore comes to a close?</strong><br>Snooki: Oh yeah, of course!<br>JWoww: I want to be a consultant with Australian Gold and give them my all, whether it&#x2019;s my products or their other products like I love, I just want to be a fresh pair of eyes for them. I love tanning, I like eat, breathe and sleep tanning and it wouldn&#x2019;t hurt for me to be with them long term.</p><p><strong>YFL: In Season 4 of Jersey Shore you both were in tip top shape. Can you give us any tips on how you changed your diet and exercise routines?</strong><br>Snooki: Well, I started a diet and I started exercising, so pretty much just eating healthy and finding a balance.<br>JWoww: For me it really came down to finding myself, and I wanted to be comfortable, so I started doing Hot Yoga and boot camps where I was training in warehouses with UFC fighters, so it was like every other day Boot Camp then Hot Yoga.<br><em>[YFL Note: At this point JWoww and I go off on a very serious bunny trail regarding regular Hot Yoga and Bikram yoga. I will spare you readers the details, but please know that Jenni&#x2019;s boyfriend Rodger (who you may know from the show) was incredibly amused].</em></p><p><strong>YFL: As you may know, Nashville is known as Music City U.S.A. You guys seem partial to House music on the show and I&#x2019;m curious who are your favorite artists?</strong><br>JWoww:  I&#x2019;m a hard rock chick so I love Disturbed, Linkin Park, Evanescence, 30Seconds to Mars.<br><em>[YFL Note: At this point I ask Jenni how she feels about the new lead singer of Evanescence, which she evidently wasn&#x2019;t aware of. She is clearly unhappy about this revelation and looks at Rodger and says, &#x201C;Did you know this??&#x201D;  She then holds her arm up to me and says &#x201C;Look at my chills! I love Amy Lee, though!&#x201D;]</em><br>Snooki: House music is definitely my favorite, and I really like Tiesto, Avicii, and Kaskade.</p><p><strong>YFL: Have you ever listened to Country Music?</strong><br>JWoww: Yeah, I actually really like Brad Paisley, Tim McGraw and Faith Hill. They are like the ultimate couple. Rodger and I are going to be like them one day, without the singing.<br>YFL: I mean, add it! Might as well add singing to your growing list of talents.<br>JWoww: (laughing) I&#x2019;m not very good!!</p><p><strong>YFL: Have you picked up any Southern phrases that you might take back to Jersey with you?</strong><br>JWoww: Y&#x2019;all.<br>Snooki: Well, I actually have a friend who lives here, and she always says &#x201C;fixin&#x2019; to go to the mall&#x201D; and I&#x2019;m like &#x201C;Why are you fixing the mall?&#x201D;<br>YFL: I wrote a couple more down for you take back with you. Bless your heart is a Southern favorite.<br>JWoww: I&#x2019;ve heard that one! It&#x2019;s always like older women saying &#x201C;Bless your heart!&#x201D;<br>YFL: It essentially gives you a free license to talk shit about anyone. Your karmic slate is clean as long as you follow the bad mouthing with &#x201C;Bless her heart&#x201D;. Tittybaby is another favorite of mine.<br>JWoww: What?!<br>YFL: A tittybaby is like calling someone a &#x201C;crybaby&#x201D;, but with a little extra oomph!<br>JWoww: I like that one!<br>YFL:  High as a Georgia Pine is another good one that essentially means you are super wasted.<br>JWoww: Ok, isn&#x2019;t there another one like &#x201C;Three sheets to the wind&#x201D;?<br>YFL: Yes, same thing! You&#x2019;ve got a few in your pocket.<br>Snooki: It&#x2019;s like a different language.</p><p><strong>YFL: In Season 4 of Jersey Shore, it seemed like everyone got along much better than in seasons past.</strong><br>Snooki: Really? None of us got along!<br>YFL: Who do you think was the most annoying cast member in Italy?<br>JWoww: Um, Mike.<br>Snooki: Mike!<br>JWoww: But, I gotta give it to Mike, he pushed our buttons but he made it a good time. The headaches were worth it because what else would we have done?</p><p><strong>YFL: When can we expect Season 5?</strong><br>Snooki: In January!</p><p><strong>YFL: If you were stranded on a deserted island for the rest of your life and could only have tanning products or Snooki with you, which would you choose?</strong><br>JWoww: Well, since I could probably get a good tan anyway, I&#x2019;d take Nicole for the rest of my life or the rest of HER life, before I kill her. She&#x2019;s my best friend, and I would probably end up strangling her on the deserted island.</p><p><em>Your Friend Lela is a Nashville blogger who enjoys writing about music, fashion, silliness and, of course, trashy television. In her free time she is probably pet sitting, attending rad concerts, or drinking homebrew. You can find her at http://yourfriendlela.blogspot.com or on Twitter @<a href=\"http://www.twitter.com/YourFriendLela\" target=\"_blank\">YourFriendLela</a>.</em></p><p><em>Photo via @<a href=\"http://lockerz.com/s/147483920\" target=\"_blank\">JENNIWOWW</a> herself</em>.</p>"}