{"id":"7983","name":"the-weekendist-december-3-4-edition","title":"The Weekendist: December 3-4 Edition","author":"Morgan Levy","date":"2011-12-03T11:00:00-06:00","tags":["first saturday art crawl","five points","holiday 2011","nashville farmer&apos;s market","nashville zoo","porter flea","preds","the weekendist","toy drive"],"categories":[],"contentEncoded":"<p><a href=\"http://www.flickr.com/photos/denisemattox/6435692709/in/pool-715021@N24/\" target=\"blank\"><img class=\"aligncenter\" src=\"http://farm8.staticflickr.com/7143/6435692709_379441d7cb.jpg\" alt=\"\"></a></p><p>Happy weekend, Nashville. With the plethora of holiday events this weekend (shopping, shopping, shopping), you could almost fool us into thinking that it&#x2019;s already Christmas. Even though December is so fresh that we haven&#x2019;t even flipped over our calendars, ChristmaHanuKwanzaakah will be here before we know it. So grab a jacket, some mittens and a steaming cup of hot cocoa and browse through this weekend&#x2019;s holiday markets, art crawls and more.</p><p><strong><a href=\"http://www.nashvillezoo.org/sites/default/files/Toy%20Drive%2011%20Release.pdf\" target=\"_blank\">Toy Drive at the Nashville Zoo</a> (PDF alert!)</strong>. <em>Saturday &amp; Sunday, December 3 &amp; 4 from 9am-4pm, free admission to the zoo with each new toy donation</em>. Looking for a low-cost way to spend the day with the kids? This weekend, Metro Police are collecting donated new toys at the Nashville Zoo. Bring a new toy, get a complimentary admission ticket &#x2013; it&#x2019;s that easy.</p><p><strong><a href=\"http://www.porterflea.com/\" target=\"_blank\">Porter Flea Handmade Holiday Market</a></strong>. <em>Saturday, December 3, 12-8pm at East Park Community Center, free</em>. We can&#x2019;t think of a more perfect time for a handmade artisan market &#x2013; If you&#x2019;re looking for unique gifts for the holidays, this is your place. We&#x2019;ll be busting down the doors at noon to get first pick of the goods, then fuel up at our favorite food trucks.</p><p><strong><a href=\"http://nashvillefarmersmarket.org/event/local_table_holiday_market\" target=\"_blank\">Local Table Holiday Market</a></strong>. <em>Saturday, December 3, 5:30pm at the Nashville Farmers Market, free. </em>Oh hey. Look at that. Another holiday market! We&#x2019;ve missed the past few Night Markets at the Nashville Farmers Market, so we&#x2019;re pretty excited to be getting a mini-second chance. Libations will be on hand for purchase (to increase your holiday cheer), then settle in for some local shopping, live music, tasty food, crafts for the kids and more.</p><p><strong><a href=\"http://www.nashvilledowntown.com/play/first-saturday-art-crawl\" target=\"_blank\">First Saturday Art Crawl</a></strong>.<em> Saturday, December 3, 6-9pm in downtown Nashville between 4th &amp; 5th Avenues, free</em>. Holiday art crawls are always our favorites (as long as we remember to bundle up appropriately). There&#x2019;s something special about wandering from gallery to gallery, sipping hot (spiked) cider and enjoying the twinkling lights in downtown Nashville. It&#x2019;s free and friendly for all ages (sans the spiked cider, of course), so bring the whole family.</p><p><strong><a href=\"http://bryantgallery.fanbridge.com/campaigns/show.php?id=794218&amp;sid=180233985\" target=\"_blank\">Five Points Holiday Open House</a></strong>. <em>Saturday, December 3, 6-9:30pm in East Nashville&#x2019;s Five Points, free. </em>Seventeen East Nashville businesses are offering drinks, munchies, sales, specials, freebies, crafts and events for the kiddos tonight in Five Points. <a href=\"http://bryantgallery.fanbridge.com/campaigns/show.php?id=794218&amp;sid=180233985\" target=\"_blank\">Head to the source</a> for a full list, which ranges from Eastside Cycles to Pied Piper Creamery to the Art &amp; Invention Gallery (swing in there for their 10th annual Holiday Art Show).</p><p><strong><a href=\"http://predators.nhl.com/club/schedule.htm\" target=\"_blank\">Preds vs. Sabres</a></strong>. <em>Saturday, December 3, 7pm at Bridgestone Arena, tickets start at $25</em>. Had enough with the holiday this, holiday that? Head to the Bridgestone Arena to see the Preds play their first home game since before Thanksgiving. They&#x2019;re coming off an impressive win in Vancouver, and we&#x2019;re fired up to see them destroy the Sabres.</p><p><em>Photo by <a href=\"http://www.flickr.com/photos/denisemattox/6435692709/in/pool-715021@N24/\" target=\"_blank\">Denise Mattox</a>. </em></p>"}