{
 "id": "81",
 "name": "nashvillest-exclusive-inside-the-michelle-obama-fundraiser",
 "title": "Nashvillest Exclusive: Inside the Obama Fundraiser",
 "author": "Nashvillest Anonymous",
 "date": "2008-05-16T11:00:00-05:00",
 "tags": [
  "barack obama",
  "bill hobbs",
  "michelle obama",
  "Nashville",
  "nashvillest",
  "tennessee",
  "tennessee GOP",
  "tennessee republicans"
 ],
 "categories": [
  "News"
 ],
 "contentEncoded": "<p><em>[Ed. Note: Well, we were dying to know what went down at last night&apos;s fundraising dinner hosted by Michelle Obama that <a href=\"http://www.youtube.com/watch?v=YmWEaqxkGtU\" onclick=\"javascript:_gaq.push([&apos;_trackEvent&apos;,&apos;outbound-article&apos;,&apos;www.youtube.com&apos;]);\" target=\"_blank\">l</a><a href=\"http://www.youtube.com/watch?v=YmWEaqxkGtU\" onclick=\"javascript:_gaq.push([&apos;_trackEvent&apos;,&apos;outbound-article&apos;,&apos;www.youtube.com&apos;]);\" target=\"_blank\">aunched us</a> into the <a href=\"http://www.cnn.com/2008/POLITICS/05/15/michelle.tennessee/?iref=hpmostpop\" onclick=\"javascript:_gaq.push([&apos;_trackEvent&apos;,&apos;outbound-article&apos;,&apos;www.cnn.com&apos;]);\" target=\"_blank\">national media spotlight</a> yesterday. A very big thanks to our</em><em> (anonymous) undercover Nashvillest operative who gives us a special peek. T</em><em>hat said, the following views do not necessarily reflect those of Nashvillest.] </em></p>\n<p><a href=\"http://nashvillest.com/wp-content/uploads/2008/05/img_2255.jpg\"><img class=\"alignleft size-full wp-image-82\" style=\"border: 3px solid black; margin: 3px 8px; float: left;\" title=\"img_2255\" src=\"http://nashvillest.com/wp-content/uploads/2008/05/img_2255.jpg\" alt=\"\" width=\"170\" height=\"227\"></a>With a guest list chock full of the rich and famous, a performance by Emmy-Lou Harris and a $1,000 minimum donation required for entry, a visit from Michelle Obama is apparently something worth celebrating.</p>\n<p>Thursday, March 15th Mrs.Obama appeared at a fundraiser for her husband, Senator and presidential hopeful Barack Obama right here in Nashville, TN. A small crowd of roughly 100 people, including 2 undecided superdelegates, arrived at a private West Nashville residence to greet Mrs. Obama in support of her husband&#x2019;s campaign and to hear her remarks.<br>\n<span id=\"more-81\"></span><br>\nOverall, Mrs. Obama appeared to meet people&#x2019;s expectations and more: articulate, poised, humble, approachable, genuine and quick on her feet; she was, unsurprisingly, an appealing spokesperson.</p>\n<p>Stopping by Nashville fresh off the campaign trail in Puerto Rico, Mrs. Obama said she was ready to get on a plane to see her girls. In response to Obama&#x2019;s success, she was quick to point out that &#x201C;We are not supposed to be here,&#x201D; citing critics and naysayers who claimed Obama would never survive far into the primary campaign season. She made note of the fact that Barack has changed the face of political fundraising history. She praised her husband&#x2019;s character, his notable service record, and his willingness to work for change. She then went on to explain how change will take time, no matter who is elected. That change will be hard, and the whoever becomes the next President of the United States has a very difficult road ahead of them given our current state of affairs.</p>\n<p>She questioned what other candidate passed up Supreme Court clerkships to work in civil rights, what other candidate worked in grassroots development, building initiatives from the ground up with local communities, churches and government organizations. She even brought out the humor, calling her husband an &#x201C;odd ball,&#x201D; a quirky man like &#x201C;an onion with many layers,&#x201D; a man whose parents had the audacity to name &#x201C;Barack Obama: Who does that?!?&#x201D;</p>\n<p>After her speech, Mrs. Obama then fielded a time of Q&amp;A, fielding softballs such as, &#x201C;Name an inspiring moment on the campaign trail,&#x201D; but avoiding the hardballs like, &#x201C;Would Barack consider prosecuting individuals of the current administration?&#x201D;</p>\n<p>All in all it was your typical political fundraiser: High-rollers, polite clapping, really white teeth, expensive cheese and an open bar&#x2026;. one small exception: great music. =)</p>\n\n\n\n\n<p>Related posts:<ol><li><a href=\"http://nashvillest.com/2008/11/13/crayon-campaign-for-barack-obama-only-in-nashville/\" rel=\"bookmark\" title=\"Permanent Link: Crayon Campaign For Barack Obama [Only In Nashville]\">Crayon Campaign For Barack Obama [Only In Nashville]</a></li>\n</ol></p>\t\t\t\t\t\t\t\t\t\t\t<!--END .entry-content .article-->"
}