{"id":"8292","name":"explosions-in-the-sky-other-fun-for-the-fourth","title":"Explosions In The Sky &amp; Other Fun For The Fourth","author":"Christy Frink","date":"2012-07-03T18:09:00-05:00","tags":["fourth of july","july 4th","music city hot chicken festival","music city july 4th"],"categories":[],"contentEncoded":"<p><a href=\"http://www.flickr.com/photos/sduck409/6057962088/\"><img src=\"http://farm7.staticflickr.com/6076/6057962088_5b9ba2c9f5.jpg\" alt=\"\" width=\"500\" height=\"462\"></a></p><p>After sweet-talking our HVAC units, making impulse CamelBak buys, and/or all-out fleeing the city during the hottest week of the year, a quick rundown of Music City&#x2019;s Independence Day festivities <em>might</em> be enough to lure us out of the house&#x2013;armed with at least a few dozen liters of water and sunscreen, that is. We&#x2019;re only half-joking. Our picks for the holiday below, and remember to play it safe out there! No boozin&#x2019; behind the wheel and, <a href=\"http://www.newschannel5.com/story/18880375/burn-ban-issued-in-several-mid-state-cities\" target=\"_blank\">especially this year, no blowing things up</a>. Seriously.</p><ul><li><em><strong><a href=\"http://irunfortheparty.com/index.php?page=events_view&amp;event_id=33\" target=\"_blank\">Music City July 4th 5K/10K</a></strong></em>.&#xA0;<em>Downtown Nashville, 8AM, $40. </em>It wouldn&#x2019;t be a proper holiday around here without a 5K, would it?&#xA0;The kind folks at I Run For The Party are providing a way to work off the beer and hot chicken before it even hits. If you haven&#x2019;t already registered, don&#x2019;t sweat it! Race day registration opens at 7AM, so get yourself down there before the pavement reaches its boiling point.</li><li><strong><a href=\"http://mchcf.blogspot.com/\" target=\"_blank\">2012 Music City Hot Chicken Festival</a>. </strong><em>East Park, 11AM-3PM, FREE. </em>If you&#x2019;re looking for a way to escape the heat, this might not be your best option, but! This kind of heat is much, much tastier. The festival is stepping up its game this year by bringing a parade along with it, starting at 10:30AM at 8th and Woodland and ending at the East Park Community Center. Heading up this sure-to-be Nashville tradition is former mayor Bill Purcell and none other than Yazoo Brew. Honorable purveyors of hot chicken include Prince&#x2019;s, Bolton&#x2019;s, 400 degrees, Pepperfire and Smack Your Mama. They&#x2019;ll be serving up free samples until they run out.</li><li><strong><a href=\"http://www.musiccityjuly4th.com/\" target=\"_blank\">Let Freedom Sing! Music City July 4th</a>.</strong><em>The Lawn at Riverfront Park, 12PM-late, FREE</em>. What can we say? While the rest of the world slowly realizes that Nashville throws a heckuva party, we&#x2019;ll already be down at the riverfront dousing our hot chicken burns with some Jack Daniels.&#xA0;Even if you missed this evening&#x2019;s pre-Fourth festivities, there&#x2019;s plenty to see on the big day. Gates open at noon tomorrow, followed by a steady lineup of tunes including Tyme, Jason Eskridge, Sarah Darling and Craig Morgan. The Family Fun Zone will keep the kids entertained with plenty of large inflatable things and for the adults, a beer garden and Jack Daniels Experience. Fireworks will kick off around 9:45ish backed by the beautiful soundscapes of the Nashville Symphony.</li></ul><p><em>Photo by <a href=\"http://www.flickr.com/photos/sduck409/6057962088/\" target=\"_blank\">Stephen Drake</a></em>.</p>"}