{"id":"884","name":"zipcars-are-here-if-youre-in-college-that-is","title":"Zipcars Are Here (If You&#x2019;re In College, That Is)","author":"Morgan Levy","date":"2008-08-28T12:00:00-05:00","tags":["belmont university","downtown","five","nashville downtown partnership","vanderbilt","zipcar"],"categories":[],"contentEncoded":"<p style=\"text-align: center;\"><img class=\"aligncenter\" src=\"http://farm1.static.flickr.com/180/440096401_35f613231b.jpg\" alt=\"\"></p><p>We mentioned a few weeks ago that Vanderbilt was rolling out a beta test of the Zipcar service. Today, the <a href=\"http://www.marketwatch.com/news/story/come-college---leave-your/story.aspx?guid=%7B8DB87A93-B098-4061-90AE-E37B7BE86C67%7D&amp;dist=hppr\" target=\"_blank\">official program launched</a> at both <a href=\"http://www.zipcar.com/belmont\" target=\"_blank\">Belmont</a> and <a href=\"http://www.zipcar.com/vanderbilt/\" target=\"_blank\">Vanderbilt</a> universities, with a total of seven cars across the two campuses. This is just the beginning for Nashville, as Zipcar has <a href=\"http://www.tennessean.com/apps/pbcs.dll/article?AID=/20080716/COLUMNIST0128/807160405/1008/OPINION01\" target=\"_blank\">been in discussion</a> with the Nashville Downtown Partnership to introduce cars downtown and eventually in other areas of metro Nashville. Three parking spaces for Zipcars have already been secured downtown, and the initial target date for having Zipcars on the road is September 1. With September lurking just a few days away and no sign of Zipcars, we&#x2019;re not sure if that still holds true, but we&#x2019;re eagerly awaiting this step forward for car-less commuters.&#xA0;</p><p>College students and faculty will see a reduced membership fee of $35/year and an automatic credit of the membership fee toward the driving fees in the first month. Students ages 18-20 who would traditionally be hard pressed to find a rental car are welcome to use the Zipcar campus program, although only members who are 21+ are allowed to use the nationwide Zipcar service. Residents who are not students but may live within walking distance of the universities are welcome to join the campus Zipcar programs, but the membership fee will more than double ($75, and $50/year after the first year). With such a limited amount of cars in the program at this point we aren&#x2019;t attracted to the option, but it&#x2019;s nice to know it&#x2019;s there. And we&#x2019;re positive that car-less freshmen (as we once were) will be rejoicing all over town.&#xA0;</p><p><em>Photo by </em><a href=\"http://flickr.com/photos/jm3/440096401/\" target=\"_blank\"><em>jm3</em></a><em>.&#xA0;</em></p>"}