{"id":"886","name":"a-beginners-guide-to-next-big-nashville","title":"A Beginner&#x2019;s Guide To Next Big Nashville 2008","author":"Morgan Levy","date":"2008-08-28T15:00:00-05:00","tags":["2008","artist lineup","conference","contest","festival","flip side of nashville","local music","nbn08","next big nashville","tickets"],"categories":[],"contentEncoded":"<p><a href=\"http://nashvillest.com/wp-content/uploads/2008/08/picture-3.png\"><img class=\"aligncenter size-full wp-image-887\" title=\"picture-3\" src=\"http://nashvillest.com/wp-content/uploads/2008/08/picture-3.png\" alt=\"\" width=\"500\" height=\"220\"></a></p><p>The hype has been buzzing around town for a few months now, but all the details are finally in place for <a href=\"http://www.nextbignashville.net\" target=\"_blank\">Next Big Nashville 2008</a>. They have released their schedule of panels and showcases, complete with an interactive scheduling tool that allows attendees to pick and choose from events to create a personalized agenda. Clear your calendars for September 10-14 and come hang out with us as we try to cram as many showcases as we can into five days.</p><p>If the idea of Next Big Nashville intimidates you (it&#x2019;s ok, it intimidates us too), take some deep breaths and hang tight &#x2013; It&#x2019;s not all hipsters and scene kids. Next Big Nashville has grown by leaps and bounds, and the scope of the festival reaches far beyond the underground indie community. There will be plenty of your casual local music fans there. There will also be plenty of folks from the music industry, and plenty of out of towners. And yeah, probably an overabundance of bad rockstar hair. But we&#x2019;ll grit our teeth and ride out the bad hair wave if it means catching all of our favorite local acts in one long weekend.</p><p>So without further ado, here are some dummy-proof steps to get you ready for Next Big Nashville 2008.</p><p>[<strong>The UnStep</strong>:&#xA0;<a href=\"http://nashvillest.com/2008/07/18/musical-diversity-thats-us/\" target=\"_blank\">Win this contest</a>.]</p><p><strong>Step 1</strong>: Decide if you want to go to Next Big Nashville. Check out the list of <a href=\"http://www.nextbignashville.net/artists\" target=\"_blank\">performing artists</a>. Check out the <a href=\"http://www.nextbignashville.net/conference\" target=\"_blank\">conference sessions</a>. Maybe you want to <a href=\"mailto:nextbignashville@mac.com\" target=\"_blank\">volunteer</a>?</p><p><strong>Step 2:</strong> <a href=\"http://www.ticketsnashville.com/WebSales/Pages/WelcomePage.aspx?epguid=81d20f01-d846-4ff2-86cb-14638bed94a7&amp;\" target=\"_blank\">Admission</a>. You will have to choose between purchasing a <a href=\"http://www.ticketsnashville.com/WebSales/Pages/PackageTypeSelect.aspx?epguid=414cf9bb-3334-40fb-9781-2838d062236a&amp;\" target=\"_blank\">Festival Wristband</a> for $35 or a Festival/Conference&#xA0;<a href=\"http://www.ticketsnashville.com/WebSales/Pages/PackageTypeSelect.aspx?epguid=80e8c3a3-acf6-41ce-a8ce-daa0cd9ceb2f&amp;\" target=\"_blank\">VIP Badge</a> for $100. Wristbands include admission to every venue and showcase, and they also get you some freebie magazine subscriptions, discounts at Next Big Nashville retail partners and some admission to afterparties and the like. If you want to go to the Next Big Nashville Conference as well, you&#x2019;ll have to go with the VIP Badge, which pretty much includes access to everything. All showcases, parties, receptions and conference sessions are included, plus you get a VIP Swag Bag and all the perks and freebies of wristband holders.</p><p><strong>Step 3</strong>: Create your personalized&#xA0;<a href=\"http://nbn08.sched.org/cal/20080910\" target=\"_blank\">festival schedule</a>. Just create a new username and password at the top of the page, then get check-box happy. There are a lot of options.</p><p><strong>Step 4</strong>: Subscribe to the <a href=\"http://nextbignashville.blogspot.com/\" target=\"_blank\">blog</a> or the <a href=\"http://nextbignashville.net/updates.php\" target=\"_blank\">newsletter</a> to stay updated. Let us know if you&#x2019;re going to Next Big Nashville, and what you&#x2019;re looking forward to the most this year. We&#x2019;ll see you there.</p>"}