{
 "id": "923",
 "name": "postsecret-visits-vandy-this-october",
 "title": "Postsecret Visits Vandy This October",
 "author": "Morgan Levy",
 "date": "2008-09-08T12:53:00-05:00",
 "tags": [
  "frank warren",
  "postsecret",
  "tickets",
  "vanderbilt university"
 ],
 "categories": [],
 "contentEncoded": "<p style=\"text-align: center;\"><a href=\"http://nashvillest.com/wp-content/uploads/2008/09/ticket-postsecret.jpg\"><img class=\"size-full wp-image-924\" title=\"ticket-postsecret\" src=\"http://nashvillest.com/wp-content/uploads/2008/09/ticket-postsecret.jpg\" alt=\"\" width=\"460\" height=\"316\"></a></p>\n<p>Fans of <a href=\"http://postsecret.blogspot.com/\" target=\"_blank\">Postsecret</a> unite: Frank Warren, the creator of the wildly successful anonymous postcard project, is coming to <a href=\"http://www.new.facebook.com/event.php?eid=21244548567\" target=\"_blank\">Vanderbilt University</a> in October to speak about his experiences with Postsecret. Tickets are $15 and can be purchased at <a href=\"http://www.ticketmaster.com/event/1B00411C79863819?artistid=1182415&amp;majorcatid=10005&amp;minorcatid=104\" target=\"_blank\">Ticketmaster</a>, which is a little disappointing to us. The last time Frank was in town, he set up shop at the Brentwood Borders and admission was free. It&#x2019;s a rather strong testimony to the tremendous popularity of Postsecret, and judging from the Facebook page for the event, it may be best to buy your tickets sooner rather than later.</p>\n<p>We hate to be the naysayers here, but when we saw Frank speak at Borders it was underwhelming at best. The secrets speak for themselves, but there were very few secrets displayed and a little too much lovey-dovey kumbaya chatter happening at the same time. What we&#x2019;d really love to see is a Postsecret exhibit come to Nashville. While we dream of that day, we do encourage those who haven&#x2019;t seen Frank speak yet to give it a shot at least once. The stories are inspiring and the secrets unbelievable.</p>"
}