{
 "id": 810,
 "name": "reviews-yogurt-oasis-been-there-done-that",
 "title": "Reviews: Yogurt Oasis [Been There, Done That]",
 "author": "Morgan Levy",
 "date": "2008-08-12T07:00:00-05:00",
 "tags": [
  "diet food",
  "frozen yogurt",
  "health information",
  "low calorie",
  "murfreesboro",
  "nutrition",
  "pinkberry",
  "yogurt oasis"
 ],
 "categories": [
  "Food &amp; Drink"
 ],
 "contentEncoded": "<p style=\"text-align: center;\"><img class=\"aligncenter\" src=\"http://farm4.static.flickr.com/3133/2609301215_e3b790fc8a.jpg\" alt=\"\"></p>\n<p>Right on the heels of Tasti D-Lite&#x2019;s <a href=\"http://nashvillest.com/2008/08/01/cold-treats-tasti-d-lite-comes-to-town/\" target=\"_blank\">expansion announcement</a>, we whipped out our google-fu and found out that they aren&#x2019;t the first yogurt shop to break ground in Nashville. Yogurt Oasis has been here since April, quietly hiding in the corner of a little shopping center on West End just around the corner from Centennial Park. When we first read the <a href=\"http://www.yelp.com/biz/yogurt-oasis-nashville\" target=\"_blank\">limited reviews online</a>, we weren&#x2019;t sure what to expect &#x2013; half were glowing, and half were unimpressed. This, of course, gave us the perfect excuse to try out Yogurt Oasis for ourselves.&#xA0;</p>\n<p>Yogurt Oasis is very clearly trying to latch on to the growing frozen yogurt diet craze. While most frozen yogurt chains have accidentally fallen into the &#x201C;diet food&#x201D; category (due to their extremely low fat &amp; calorie content), Yogurt Oasis is using &#x201C;diet food&#x201D; as their marketing schtick. Their door and walls are plastered in health information, suggestions for diets, advertisements for gyms and nutritional information. We really just wanted some frozen yogurt that compared to Pinkberry, but the 8 calories per ounce didn&#x2019;t hurt anything.&#xA0;</p>\n<p>Walk into the no-frills shop and grab a cup in one of two sizes &#x2013; small or large. The small cup is the size of most ice cream large cups, and the large cup at Yogurt Oasis is literally the size of a medium size soft drink. Due to the size of the cups, it&#x2019;s hard to eyeball how much yogurt you&#x2019;re serving yourself (you pay by weight at the end). We were full before we had finished our halfway filled &#x201C;small&#x201D; cups &#x2013; they were deceptive. And we paid about $4 for each half-cup, average for specialty ice cream and yogurt shops, but a Starbucks-sized stab to the wallet if we make it a habit.&#xA0;</p>\n<p>Unlike Pinkberry, which only carries basic vanilla, chocolate and green tea flavors, Yogurt Oasis has a variety to choose from. Vanilla, chocolate, cappuccino, mango and dreamsicle were tonight&#x2019;s offerings. We stuck with basic vanilla (boring, we know) and moved on to the line of toppings. The toppings included about ten varieties of crushed candy bars, brownies, peanut butter, and a slightly rancid bowl of syrupy sweet strawberries. No fresh fruit or healthy alternatives made our visit significantly less fulfilling, especially at a place that touts itself as diet food. Luckily, it&#x2019;s a problem that can be easily fixed, if the customers make some noise and the owners choose to take notice. A new Yogurt Oasis is <a href=\"http://www.murfreesboropost.com/news.php?viewStory=11570\" target=\"_blank\">opening in Murfreesboro</a> this month, and we hope that both locations will soon see better fixin&#x2019;s. Other than that, the frozen yogurt was on par with our expectations. Sweetened with fructose, some might be able to identify the taste, but it isn&#x2019;t unpleasant. We&#x2019;re still anxious for Tasti D-Lite to throw some competition in the mix, but Yogurt Oasis will satisfy our yogurt cravings for now.&#xA0;</p>\n<p><em>Photo (not of Yogurt Oasis) by </em><a href=\"http://flickr.com/photos/dongkwan/2609301215/\" target=\"_blank\"><em>DigitalErn</em></a><em>.&#xA0;</em></p>\n\n\n\n\n<p>Related posts:<ol><li><a href=\"http://nashvillest.com/2008/10/22/krave-frozen-yogurt-were-getting-closer-to-pinkberry-every-day/\" rel=\"bookmark\" title=\"Permanent Link: Krave Frozen Yogurt: We&#x2019;re Getting Closer To Pinkberry Every Day\">Krave Frozen Yogurt: We&#x2019;re Getting Closer To Pinkberry Every Day</a></li>\n<li><a href=\"http://nashvillest.com/2008/08/01/cold-treats-tasti-d-lite-comes-to-town/\" rel=\"bookmark\" title=\"Permanent Link: Cold Treats: Tasti D-Lite Comes To Town\">Cold Treats: Tasti D-Lite Comes To Town</a></li>\n<li><a href=\"http://nashvillest.com/2009/07/28/tomorrow-tasti-d-lite-finally-opens-doors/\" rel=\"bookmark\" title=\"Permanent Link: Tomorrow: Tasti D-Lite (Finally) Opens Doors\">Tomorrow: Tasti D-Lite (Finally) Opens Doors</a></li>\n</ol></p>\t\t\t\t\t\t\t\t\t\t\t<!--END .entry-content .article-->"
}