{
 "id": 425,
 "name": "welcome-to-nashville-weve-got-bad-drivers",
 "title": "Welcome To Nashville, We&#x2019;ve Got Bad Drivers",
 "author": "Morgan Levy",
 "date": "2008-06-18T19:26:00-05:00",
 "tags": [
  "100 most congested cities",
  "bottleneck",
  "driving instructions",
  "inrix survey",
  "Nashville",
  "worst traffic"
 ],
 "categories": [],
 "excerpt": "We’ve always claimed that Nashville has an unusually high number of terrible drivers, and now we’re feeling validated. A recent survey’s results are in [Inrix], and we have placed 31st on the list of 100 most congested cities. According to the survey, the worst traffic bottleneck around is on I-40E where it hits I-24. It’s congested for a whopping 18 hours a week, and to anyone who regularly drives that stretch, this probably comes as no surprise. The survey also […]",
 "contentEncoded": "<p><a href=\"http://nashvillest.com/wp-content/uploads/2008/06/145909658_a184d5856a.jpg\"><img class=\"aligncenter size-full wp-image-430\" title=\"145909658_a184d5856a\" src=\"http://nashvillest.com/wp-content/uploads/2008/06/145909658_a184d5856a.jpg\" alt=\"\" width=\"500\" height=\"333\"></a></p>\n<p>We&#x2019;ve always claimed that Nashville has an unusually high number of terrible drivers, and now we&#x2019;re feeling validated. A recent survey&#x2019;s results are in [<a href=\"http://www.inrix.com/pressrelease.asp?ID=56\" target=\"_blank\">Inrix</a>], and we have placed 31st on the list of <a href=\"http://www.bizjournals.com/nashville/stories/2008/06/16/daily26.html?ana=from_rss\" target=\"_blank\">100 most congested cities</a>.</p>\n<p>According to the survey, the worst traffic bottleneck around is on I-40E where it hits I-24. It&#x2019;s congested for a whopping 18 hours a week, and to anyone who regularly drives that stretch, this probably comes as no surprise. The survey also brings us the pleasant news that traffic has actually gotten worse in the past year, with congestion increasing by 4.7%. And on top of that, has anyone noticed how many people drive around town without headlights on in the dark? It&#x2019;s unreal.</p>\n<p>The good news is that with every Nashville stereotype comes an opportunity to poke fun. And that&#x2019;s what we do best here at Nashvillest. Without further ado, we present <strong><em>Nashville Driving Instructions</em></strong>.</p>\n<ol>\n<li>Before entering the city limits, be prepared to discuss in 500 words or more why Nashville is superior to Memphis.</li>\n<li>Forget the traffic rules you learned elsewhere. Traffic rules in Nashville can be summed up easily: Hold on and pray.</li>\n<li>All directions start with, &#x201C;Get on Old Hickory Blvd&#x2026;.&#x201D; which has no beginning and no end and is not necessarily continuous.</li>\n<li>If you are on a street named something other than the street you want, check it out anyway &#x2014; it may turn into the street you want. On the other hand, when you are on a street with the name you want, you may not be able to get to the address you want anyway.</li>\n<li>Demonbreun can only be pronounced by a native. Ditto for Tusculum. Ditto for Lafayette.</li>\n<li>The morning rush hour is from 5:00am to 10:00am. The evening rush hour is from 3:00pm to 7:00pm. Friday&#x2019;s evening rush hour starts on Thursday morning.</li>\n<li>The Chamber of Commerce calls getting through traffic a &#x201C;scenic drive.&#x201D;</li>\n<li>If it&#x2019;s sleeting/snowing, don&#x2019;t expect to get where you&#x2019;re going before dawn. If it&#x2019;s minus 10 degrees, sleeting/snowing, and the Cumberland River is frozen over, Vanderbilt just won the SEC Championship in a sport other than women&#x2019;s lacrosse.</li>\n<li>If you actually stop at a yellow light, you will be rear ended, cussed out and  possibly shot. When you are first on the starting line, count to five when the light turns green before going to avoid getting into any cross-traffic.</li>\n<li>If someone actually has their turn signal on, it is probably a factory defect.</li>\n<li>There is no such thing as a dangerous high-speed chase in Nashville. They all drive like that.</li>\n<li>I-40 East is our daily version of NASCAR&#x2026;with a perpetual caution flag.</li>\n<li>The minimum acceptable speed on I-65 North between the Kentucky state Line and Trinity Lane is 115mph. Anything less is considered downright sissy.</li>\n<li>Construction on I-40/65/24/440 is a way of life and a permanent form of entertainment. When there is nothing to construct, don&#x2019;t worry: they will dig up perfectly good road and replace it to ensure your continued entertainment.</li>\n<li>If you are in the left lane and only going 75mph in a 55mph zone&#x2026;people are NOT waving when they go by.</li>\n<li>Never stare at the driver of the car with the bumper sticker that says &#x201C;Keep honking. I&#x2019;m reloading.&#x201D; In fact, don&#x2019;t honk or stare at anyone.</li>\n<li>The wrought iron on windows in South Nashville isn&#x2019;t ornamental.</li>\n<li>East Nashville is actually north of town, but you don&#x2019;t want to go there anyway.</li>\n<li>All unexplained sights can be explained by the phrase, &#x201C;Oh, we must be In Bordeaux!!&#x201D;</li>\n<li>Anyone within 20 miles of Nashville on the day of a Titans home game Is certifiably crazy!</li>\n</ol>\n<p><em>[Editor&#x2019;s Note: At Nashvillest, we give credit where credit is due. Someone forwarded these driving instructions to us a very long time ago and we don&#x2019;t know where they originated. If you know, tip us off so we can credit our source. Thanks!]</em></p>\n<p><em>Photo by <a href=\"http://flickr.com/photos/cybertoad/145909658/\" target=\"_blank\">cybertoad</a>. </em></p>"
}