{
 "id": 8041,
 "name": "get-out-and-eat-nashville-restaurant-week-2012-starts-today",
 "title": "Get Out And Eat: Nashville Restaurant Week 2012 Starts Today",
 "author": "Morgan Levy",
 "date": "2012-01-16T13:00:00-06:00",
 "tags": [
  "chachah",
  "fido",
  "fish &amp; co",
  "mccabe pub",
  "noshville",
  "provence",
  "restaurant week 2012",
  "sunset grill"
 ],
 "categories": [],
 "excerpt": "We’re prepping ourselves for some serious eating this week, as Nashville’s first Restaurant Week of 2012 is upon us. Restaurant Week, for the unfamiliar, is a week of fixed-price meals at nearly 50 of Nashville’s finest local restaurants, mostly at $20.12 or $30.12 price points. We like to use the semi-annual event as an opportunity to try newcomers to the list of participating restaurants, but we have a little problem – it seems that every single menu is calling our […]",
 "contentEncoded": "<p><a href=\"http://www.flickr.com/photos/keithgallagher/5417986019/\" target=\"blank\"><img class=\"aligncenter\" src=\"http://farm6.staticflickr.com/5298/5417986019_e9fd5819fe.jpg\" alt=\"\"></a></p>\n<p>We&#x2019;re prepping ourselves for some serious eating this week, as Nashville&#x2019;s first Restaurant Week of 2012 is upon us. Restaurant Week, for the unfamiliar, is <a href=\"http://www.nashvilleoriginals.com/restaurantweek.php\" target=\"_blank\">a week of fixed-price meals at nearly 50 of Nashville&#x2019;s finest local restaurants</a>, mostly at $20.12 or $30.12 price points. We like to use the semi-annual event as an opportunity to try newcomers to the list of participating restaurants, but we have a little problem &#x2013; it seems that every single menu is calling our names this time around.</p>\n<p>Even at special reduced prices, Restaurant Week could easily wreak havoc on our bank accounts if we&#x2019;re not careful. Our plan this time around is to make the most of it by partaking in some of the fantastic (and lower-priced) lunch offerings &#x2013; $20.12 for a two-person lunch at <strong>Fido</strong> or <strong>Noshville</strong>, $2.12 for a cup of soup and bread at <strong>Provence</strong>, $12.12 for burgers for two at <strong>McCabe Pub</strong>, or $10.12 for a generous lunch at either <strong>Sunset Grill</strong> or <strong>Fish &amp; Co</strong>. We may splurge on a dinner or two &#x2013;<strong> </strong>we&#x2019;re dying to try the <a href=\"http://www.nashvillescene.com/nashville/patti-myints-off-the-menu-salad-packs-a-world-of-flavor-into-a-lettuce-leaf-at-international-market-and-restaurant/Content?oid=1833855\" target=\"_blank\">mysterious</a> and <a href=\"http://www.eat-drink-smile.com/2012/01/nashville-originals-restaurant-week-2012.html\" target=\"_blank\">much-blogged-about</a> Mama Myint&#x2019;s House Salad at <strong>ChaChah </strong>&#x2013; but the lunch deals should keep us fat and happy.</p>\n<p>Check out all of the <a href=\"http://www.nashvilleoriginals.com/restaurantweek.php\" target=\"_blank\">Restaurant Week participating restaurants and their menus here</a>. The first Restaurant Week of 2012 runs January 16-22, but check individual restaurants for operating hours and days (most recommend reservations).</p>\n<p><em>Photo by <a href=\"http://www.flickr.com/photos/keithgallagher/5417986019/\" target=\"_blank\">Keith Gallagher</a>. </em></p>"
}