{
 "id": 2052,
 "name": "bright-early-the-takeover-edition",
 "title": "Bright &amp; Early: The Takeover Edition",
 "author": "Christy Frink",
 "date": "2009-07-10T09:30:00-05:00",
 "tags": [],
 "categories": [
  "News"
 ],
 "excerpt": "Good morning, Nashville. Mayor Dean is preparing himself for the possibility that he may be getting a little more than he bargained for when he took on the",
 "contentEncoded": "<div class=\"post-image-wrapper\">       \n\t\t\t\t\t    <img class=\"post-image\" src=\"http://nashvillest.com/wp-content/plugins/fresh-page/thirdparty/phpthumb/phpThumb.php?src=http://nashvillest.com/wp-content/files_flutter/1247233151_1_1_1_2_post-image.jpg&amp;w=322&amp;zc=1&amp;aoe=1\">\n\t\t\t\t\t    <div class=\"post-image-footer\">&#xA0;</div>\n\t\t\t\t\t  </div>\n\t\t\t\t\t  \t\t\t\t\t\t<p><!-- body {margin:8px} .tr-field {font:normal x-small arial} --></p>\n<div>Good morning, Nashville. Mayor Dean is preparing himself for the  possibility that he may be getting a little more than he bargained for when he  took on the mayor job. Test results are slated to come in this month for No  Child Left Behind benchmarks, and if Metro Schools&#x2019; marks don&#x2019;t measure up to  federal guidelines, <a href=\"http://www.tennessean.com/article/20090710/NEWS04/907100358/-1/RSS05\" target=\"_blank\">it&#x2019;s likely that Mayor Dean could be taking over the school  system</a>. This is something that has been discussed in past years, but looks more  likely than ever this time around. If it happens, then Mayor Dean would be the  first Southern mayor to take over a school district.</div>\n<ul>\n<li><strong>Sue or be sued.</strong> Election administrators in eight Tennessee  counties filed a lawsuit this week <a href=\"http://www.wkrn.com/global/story.asp?s=10665818\" target=\"_blank\">claiming that they were unfairly fired  because they&#x2019;re Democrat</a>s. In Tennessee, the majority party in the legislature  can pick the election commissioners in each county and the commissioners choose  the administrators. Since the Republicans took over this year, they chose their  own commissioners, and the commissioners are the ones who are now being accused  of doing the firing.</li>\n<li><strong>Remembering No. 9.</strong> <a href=\"http://www.wkrn.com/global/story.asp?s=10671057\" target=\"_blank\">More than 4,000 folks turned out for  Steve McNair&#x2019;s memorial service yesterday</a> including Mayor Dean, Governor Phil,  and many of McNair&#x2019;s former teammates. Though the real funeral won&#x2019;t happen  until tomorrow in Mississippi where McNair was from, friends and fans were  grateful for the chance to remember him close to home.</li>\n<li><strong>Bits &amp; pieces.</strong> Councilwoman Megan Barry, along with  Ronnie Steine, Tim Garrett, and Jerry Maynard, <a href=\"http://www.nashvillecitypaper.com/content/city-news/council-members-file-nondiscrimination-ordinance\">will  officially file the non-discrimination ordinance</a> on July 21st that would  make it illegal for Metor to discriminate based on sexual orientation &#x2026;  Remember that it&#x2019;ll <a href=\"http://www.tennessean.com/article/20090709/NEWS01/90709078/-1/RSS05\">probably  be looking a little smoggy</a> downtown today &#x2026; Parents, teachers, and school  administrators are trying to figure out <a href=\"http://www.newschannel5.com/global/story.asp?s=10670874\">what to do with  McGavock High School </a>&#x2026; Revenue for the state came in at <a href=\"http://www.fox17.com/template/inews_wire/wires.regional.tn/27bc8d62-www.fox17.com.shtml\">$134  million less</a> than the original estimate last month.</li>\n</ul>\n<p><strong>A year ago on Nashvillest:</strong> We seriously thought that <a href=\"http://nashvillest.com/2008/07/10/breaking-if-nashvillest-hq-blows-up-were-doomed/\" target=\"_blank\">Green Hills was going to blow up</a>, learned that we&#x2019;re the <a href=\"http://nashvillest.com/2008/07/10/nashville-is-25th-largest-city-in-us-we-win/\" target=\"_blank\">25th largest city in the US</a>, figured out what to do with <a href=\"http://nashvillest.com/2008/07/10/abandoned-alligators-a-different-kind-of-homeless/\" target=\"_blank\">all of our homeless alligators</a>, and followed along with Mayor Dean&#x2019;s trip to New York to <a href=\"http://nashvillest.com/2008/07/10/bright-early-mr-dean-goes-to-washington-edition/\" target=\"_blank\">learn how to run a school system</a> (sound familiar?</p>\n\n\n\n\n<p>No related posts.</p>\t\t\t\t\t\t\t\t\t\t\t<!--END .entry-content .article-->"
}