{
 "id": 1692,
 "name": "zombie-apocalypse-gems-from-the-nashville-craigslist",
 "title": "ZOMBIE APOCALYPSE! [Gems From The Nashville Craigslist]",
 "author": "Morgan Levy",
 "date": "2009-04-08T16:15:00-05:00",
 "tags": [
  "gems from the nashville craigslist",
  "volunteer opportunities",
  "zombie apocalypse"
 ],
 "categories": [],
 "excerpt": "No, not that Zombie Apocalypse. This one: LOOKING FOR VOLUNTEERS FOR SURVIVALIST GROUP (Well fortified compound) I am a former Navy Seal/ex-CIA Agent and have witnessed secret operations inside our government that will ensure a ZOMBIE APOCALYPSE by the year 2012. Due to these experiments conducted by the US Government in joint cooperation with Haiti Voodoo Shamans, I have decided it is my American and Civil Duty to train as many individuals as possible to help fight back the oncoming […]",
 "contentEncoded": "<p style=\"text-align: center;\"><img class=\"aligncenter\" src=\"http://farm3.static.flickr.com/2344/2483483604_01d606e27e.jpg\" alt=\"\"></p>\n<p>No, not <a href=\"http://nashvillest.com/2008/05/08/weekend-edition-it-only-gets-better-from-here/\" target=\"_blank\"><em>that</em></a> Zombie Apocalypse. This one:</p>\n<blockquote><p><a href=\"http://nashville.craigslist.org/vol/1112519553.html\" target=\"_blank\"><strong>LOOKING FOR VOLUNTEERS FOR SURVIVALIST GROUP (Well fortified compound) </strong></a></p>\n<p><em>I am a former Navy Seal/ex-CIA Agent and have witnessed secret operations inside our government that will ensure a ZOMBIE APOCALYPSE by the year 2012. Due to these experiments conducted by the US Government in joint cooperation with Haiti Voodoo Shamans, I have decided it is my American and Civil Duty to train as many individuals as possible to help fight back the oncoming zombie hordes soon to be released upon us.</em></p>\n<p><em>I have already come in contact with infected individuals due to my training and from such experiences can now teach future survivors on how to properly exterminate zombies and soon to be zombies.</em></p>\n<p><em>My training will include but not limited to:<br>\n*Instruction in the proper gear to wear and best types of armor for the appropriate situation<br>\n*Instruction in firearm use and show where the vital killing points are on any given zombie<br>\n*Advice on what weapons work best and in what situation.  GUNS ARE NOT ALWAYS THE ANSWER.<br>\n*Interactive, realistic simulation of a zombie apocalypse via zombie boardgames (The Last Night on Earth: The Zombie Game)<br>\n*Instruction on how to cope from emotional damage after having to kill infected love ones with a crowbar to their head on or face area<br>\n*Instructions on how not to feel sympathy for zombie babies<br>\n*Proper killing methods for zombie babies perfected by the Spanish Conquistadors hundreds of years ago on Mayan babies<br>\n*Creative energies will be pumped to maximum efficiency as I will help you determine your unique battle anthem AND I will also help you come up with your personalized &#x201C;Last Words&#x201D; so all your comrades and friends will remember that you went out in style and flare. YOU WILL NOT BE FORGOTTEN OR YOUR MONEY BACK!!!!</em></p>\n<p><em>Though not required I STRONGLY recommend reading &#x201C;The Zombie Survival Guide&#x201D; by Max Brooks as I will be covering it extensivly during our training</em></p>\n<p><em>Upon completion of my survival course each graduate will receive a Zombie Bozo button for thier jacket<br>\nOne(1) Zombie First survival Kit will be handed out to each graduate of my program(CONTAINS 1 FIREARM WITH A SINGLE ROUND IN THE CHAMBER)<br>\nOne(1) Certificate denoting you have completed my course and are a CERTIFIED SURVIVOR.</em></p>\n<p><em>DON&#x2019;T WAIT.  CONTATACT ME NOW BEFORE THE ZOMBIE APOCALYPSE STARTS!!!</em></p>\n<p><em>There is a one time no money back fee of $2500.00 for the training. </em></p></blockquote>\n<p>He even includes some <a href=\"http://i42.tinypic.com/2aeneoh.jpg\" target=\"_blank\">helpful photos</a> of the materials used in training! Wow!</p>\n<p><em>Photo by <a href=\"http://www.flickr.com/photos/chuckbryant/2483483604/\" target=\"_blank\">Chuck Bryant</a>. </em></p>"
}