{
 "id": 7815,
 "name": "happy-food-truck-friday-nashville",
 "title": "Happy Food Truck Friday, Nashville!",
 "author": "Christy Frink",
 "date": "2011-10-21T11:30:00-05:00",
 "tags": [
  "degthai",
  "dixie belle&apos;s cupcakes",
  "food truck friday",
  "food truck tuesday",
  "food trucks",
  "grilled cheeserie",
  "mere bulles",
  "ywca"
 ],
 "categories": [],
 "excerpt": "It’s no secret that your Nashvillest editors have bought into the food truck craze hook, line and sinker. And if our favorite trucks want to get together and serve up delicious eats in one spot every week and donate part of their proceeds to a fantastic nonprofit, we just can’t pass that up. On the heels of the smashingly successful Food Truck Tuesdays benefitting Second Harvest Food Bank in Metro Center comes Food Truck Fridays at the YWCA on Woodmont […]",
 "contentEncoded": "<p><a href=\"http://www.flickr.com/photos/seduffel/6264138297/\" target=\"blank\"><img class=\"aligncenter\" src=\"http://farm7.static.flickr.com/6060/6264138297_75bba549b8.jpg\" alt=\"\"></a></p>\n<p>It&#x2019;s no secret that your Nashvillest editors have bought into the food truck craze hook, line and sinker. And if our favorite trucks want to get together and serve up delicious eats in one spot every week <em>and</em> donate part of their proceeds to a fantastic nonprofit, we just can&#x2019;t pass that up.</p>\n<p>On the heels of the <a href=\"http://www.nashvillescene.com/bites/archives/2011/08/04/food-truck-tuesday-proves-a-hit-at-second-harvest\">smashingly successful Food Truck Tuesdays</a> benefitting Second Harvest Food Bank in Metro Center comes Food Truck Fridays at the YWCA on Woodmont Boulevard. Every Friday, a rotating lineup of Nashville&#x2019;s finest food trucks wheel themselves into the YWCA&#x2019;s spacious parking lot from 11am to 2pm and give 10% of the day&#x2019;s proceeds right back to the organization to <a href=\"http://www.ywcanashville.com/About_Us\">help them provide services focused on empowering women and girls to get out of domestic violence situations</a>.</p>\n<p>Hungry yet? Head over to the YWCA for today&#x2019;s Food Truck Friday featuring the Grilled Cheeserie, DegThai, Mere Bulles and Dixie Belle&#x2019;s Cupcakes.</p>\n<p><strong>Food Truck Fridays at the YWCA,&#xA0;1608 Woodmont Blvd, 11am-2pm.</strong></p>\n<p><em>Photo by <a href=\"http://www.flickr.com/photos/seduffel/6264138297/\" target=\"_blank\">Sarah Duffel</a>. </em></p>"
}