{
 "id": 3553,
 "name": "nashville-on-nye-a-survival-guide-road-closures-etc",
 "title": "Nashville On New Years Eve: A Survival Guide [Road Closures] [Etc]",
 "author": "Morgan Levy",
 "date": "2009-12-30T17:58:00-06:00",
 "tags": [
  "free sober ride",
  "new year&apos;s eve",
  "parking downtown",
  "road closures"
 ],
 "categories": [],
 "excerpt": "With upwards of 10,000 people expected to brave tomorrow night’s chilly temperatures for the big inaugural Bash on Broadway, midnight guitar drop and fireworks display, things are bound to get a little sticky, so we put together a little survival guide to get you through the last hours of 2009 with us. Let us know if we forgot anything in the comments, and have a happy (and safe) New Years Eve! Survival Tip #1: Bundle up. It’s gonna be cold, […]",
 "contentEncoded": "<p style=\"text-align: center;\"><img class=\"aligncenter\" src=\"http://farm2.static.flickr.com/1144/1017570660_613ad9c46c.jpg\" alt=\"\"></p>\n<p>With upwards of 10,000 people expected to brave tomorrow night&#x2019;s chilly temperatures for the big inaugural Bash on Broadway, midnight guitar drop and fireworks display, things are bound to get a little sticky, so we put together a little survival guide to get you through the last hours of 2009 with us. Let us know if we forgot anything in the comments, and have a happy (and safe) New Years Eve!</p>\n<p><strong>Survival Tip #1: Bundle up</strong>. <a href=\"http://www.tennessean.com/article/20091230/NEWS01/912300381/Nashville+revelers+face+a+freezing+New+Year+s+Eve\" target=\"_blank\">It&#x2019;s gonna be cold, y&#x2019;all</a>. Not only will it be cold, there&#x2019;s a 50/50 chance of rain/snow, and a wind chill that makes our bones hurt just reading about it. If you&#x2019;re planning on hanging out downtown, swap the formalwear and high heels for mittens, hats and boots. Free handwarmers will be distributed to the first 2,500 people downtown, so get there early (or stay home by the fire and show up just in time for the guitar drop &#x2013; your call).</p>\n<p><strong>Survival Tip #2</strong>: <strong>Clear the roads</strong>. The downtown NYE celebration will be shutting down more than a few roads, so check out these road closures and steer clear or maneuver around the best you can.</p>\n<p><em>Closed today: </em></p>\n<ul>\n<li>Broadway (1st Avenue to 2nd Avenue)</li>\n<li>Broadway North Lane (2nd Avenue to 3rd Avenue)</li>\n<li>Broadway South Lane (2nd Avenue to 3rd Avenue)</li>\n<li>1st Avenue (Demonbreun to Church Street)</li>\n<li>1st Avenue East lane cutout/passenger loading zone (Broadway to area opposite entrance of ACME parking lot)</li>\n<li>Riverfront Park arrival court</li>\n</ul>\n<p><em>Closing tomorrow (Thursday):</em></p>\n<ul>\n<li>6am: ACME Alley, Broadway (2nd Avenue to 3rd Avenue)</li>\n<li>8am: Titan Way from Russell to Victory Lane; Victory Lane from Titan Way to South 1st Street</li>\n<li>3pm: 2nd Avenue (Demonbreun to Commerce Street)</li>\n<li>11pm: Shelby Street Pedestrian Bridge (to reopen at the end of the fireworks show)</li>\n</ul>\n<p>All roads are scheduled to re-open by 5pm on Friday, so keep that in mind if you&#x2019;re out and about on New Years day.</p>\n<p><strong>Survival Tip #3: Repeat after us&#x2026; Don&#x2019;t drink and drive!</strong> We know that our readers would <em>never</em> drink and drive (right? Right???), but if you find yourself wondering if you&#x2019;re sober enough to drive, don&#x2019;t take the chance. Sobriety checkpoints and more than a handful of over-indulged drivers make NYE one of the most dangerous nights of the year to be out on the roads, especially after a drink or two. And there are options, so many options!</p>\n<ul>\n<li><strong><a href=\"http://www.nashville-sheriff.net/nr122909.html\" target=\"_blank\">Sober Ride</a></strong>: The Davidson County Sheriff&#x2019;s Office has been offering free, safe, sober rides for 26 years, and this year is no different. Call <strong>615-862-RIDE (7433)</strong> for a free sober ride, or if you&#x2019;re at the Broadway Bash, head to a Sober Ride &#x201C;bus stop&#x201D; at either <strong>Second Avenue &amp; Commerce</strong> or <strong>Third &amp; Broadway</strong>. Don&#x2019;t try to use them as a taxi service, though &#x2013; Sober Ride will only take you home or to your hotel, not to another party or bar.</li>\n<li><strong><a href=\"http://nashvillest.com/2008/06/16/nashvillest-spotlight-zingo-nashville/\" target=\"_blank\">Zingo</a></strong>: The scooter-bound Zingo drivers will land you and your car safely home after a wild night. Just give them a call 20-30 minutes before you need your ride (allowing extra time on busy nights might be a good idea) at <strong>877-ZINGO99</strong>, and you won&#x2019;t have to worry about getting back to your car the next day.</li>\n<li><strong><a href=\"http://www.aaasouth.com/acs_news/tow_to_go.asp\" target=\"_blank\">Tow To Go</a></strong>: AAA &amp; Budweiser have teamed up to provide free rides &amp; towing service for you and your car on New Years Eve (and all holidays). You don&#x2019;t have to be a member of AAA to use the free Tow to Go service, so program <strong>1-800-AAA-HELP</strong> into your phone and you&#x2019;ll be ready to go tomorrow night.</li>\n<li><a href=\"http://gofastcab.com/\" target=\"_blank\"><strong>GoFastCab</strong></a>: You have to be sober enough to send a text message for this one, but with big, noisy crowds GoFastCab is a lifesaver. Just text your full pickup location to <strong>777CAB</strong> and the next available cab will be dispatched to you. GoFastCab is a free service, but you still have to pay for your cab ride.</li>\n</ul>\n<p><strong>Survival tip #4</strong>: <strong>Have fun! </strong>It&#x2019;s been a great 2009 for Nashvillest, and we want to see every single one of you happy and safe on the other side. Here&#x2019;s to 2010!</p>\n<p><em>Photo by </em><a href=\"http://www.flickr.com/photos/smsm1/1017570660/\" target=\"_blank\"><em>smsm1</em></a><em>.</em></p>"
}