{
 "id": 1610,
 "name": "free-cma-at-the-riverfront-this-year-cmapocalypse-2009",
 "title": "Free CMA At The Riverfront This Year [CMApocalypse 2009]",
 "author": "Morgan Levy",
 "date": "2009-04-23T15:34:00-05:00",
 "tags": [
  "2009",
  "cma",
  "cma music festival",
  "cmapocalypse",
  "fan fare",
  "free concert"
 ],
 "categories": [],
 "excerpt": "Yes folks, CMApocalypse is starting already! Well, not quite, but news is rolling in, and we’re actually pretty excited about this bit of info –  All of the CMA performances at the Riverfront Park Stage will be free and open to the public this year! If our city is going to be overrun by tourists in halter tops, well, at least we’re getting something out of it. So for the country music fans lurking around, mark your calendars for June […]",
 "contentEncoded": "<p><img class=\"alignleft\" style=\"float: left; margin-left: 5px; margin-right: 5px;\" src=\"http://i39.tinypic.com/153vhxf.jpg\" alt=\"\" width=\"211\" height=\"226\"></p>\n<p>Yes folks, CMApocalypse is starting already! Well, not quite, but news is rolling in, and we&#x2019;re actually pretty excited about this bit of info &#x2013;&#xA0; All of the <a href=\"http://www.cmaworld.com/news_publications/pr_common/press_detail.asp?re=835\" target=\"_blank\">CMA performances at the Riverfront Park Stage will be free</a> and open to the public this year! If our city is going to be overrun by tourists in halter tops, well, at least we&#x2019;re getting something out of it. So for the country music fans lurking around, mark your calendars for June 11-14, and prepare to brave the crowds. Performers announced so far are:</p>\n<p><strong>Thursday, June 11</strong>: Bellamy Brothers, Diamond Rio, Neal McCoy, Heidi Newfield, James Otto, Randy Rogers Band, Ashton Shepherd, Phil Vassar, and Chuck Wicks.</p>\n<p><strong>Friday, June 12</strong>: John Anderson, Eric Church, Bucky Covington, &#x201C;The Honky Tonk Tailgate Party&#x201D; (featuring Trent Willmon, Jeff Bates, Mark Wills), Randy Houser, Oak Ridge Boys, Jamie O&#x2019;Neal, Aaron Tippin, and Clay Walker.<strong></strong></p>\n<p>Saturday, June 13: Bill Anderson, Keith Anderson, Tracy Byrd, Jason Michael Carroll, Emerson Drive, Lost Trailers, Jo Dee Messina, Lorrie Morgan, and Chris Young.</p>\n<p><strong>Sunday, June 14</strong>:&#xA0; Eli Young Band, Larry Gatlin and the Gatlin Brothers, Gloriana, Josh Gracin, Jessica Harp, Joey &amp; Rory, Joe Nichols, Collin Raye / Restless Heart, and Darryl Worley.</p>"
}