{
 "id": 1902,
 "name": "raise-up-benefit-mindy-smith-landon-pigg-erin-mccarley-and-more",
 "title": "Raise Up Benefit: Mindy Smith, Landon Pigg, Erin McCarley And More",
 "author": "Morgan Levy",
 "date": "2009-06-04T14:04:00-05:00",
 "tags": [
  "benefit show",
  "brooke waggoner",
  "erin mccarley",
  "griffin house",
  "landon pigg",
  "mindy smith",
  "ruthie sayles",
  "sixpence none the richer"
 ],
 "categories": [],
 "excerpt": "Benefit shows are a dime a dozen in Nashville, and it gets to the point where we usually just tune them out. Yet tonight’s fundraiser at Rocketown for Ruthie Sayles, a Nashville resident in need of a $100,000 surgery stemming from a preexisting condition, is hard to ignore. Her friends are joining together to put on tonight’s show, and it just so happens that among her friends are Mindy Smith, Landon Pigg, Erin McCarley, Griffin House, Brooke Waggoner and Sixpence […]",
 "contentEncoded": "<p style=\"text-align: center;\"><img class=\"aligncenter\" src=\"http://i44.tinypic.com/r1j09g.jpg\" alt=\"\"></p>\n<p style=\"text-align: left;\">Benefit shows are a dime a dozen in Nashville, and it gets to the point where we usually just tune them out. Yet tonight&#x2019;s fundraiser at Rocketown for Ruthie Sayles, a Nashville resident in need of a $100,000 surgery stemming from a preexisting condition, is hard to ignore. Her friends are joining together to put on tonight&#x2019;s show, and it just so happens that among her friends are Mindy Smith, Landon Pigg, Erin McCarley, Griffin House, Brooke Waggoner and Sixpence None The Richer. These artists have each packed out smaller venues on their own, and tonight is a rare opportunity to see them all on one ticket.&#xA0;</p>\n<p style=\"text-align: left;\">In addition to the show, more of Ruthie&#x2019;s talented friends will be auctioning off their professional services (no, not like that!) including studio production, photoshoots, video work and music lessons. The concert is from 6pm-10pm at Rocketown, and tickets are $20.&#xA0;</p>"
}