{
 "id": 1415,
 "name": "to-the-guy-behind-me-picking-his-nose-gems-from-the-nashville-craigslist",
 "title": "To The Guy Behind Me Picking His Nose&#x2026; [Gems From The Nashville Craigslist]",
 "author": "Morgan Levy",
 "date": "2009-01-05T15:00:00-06:00",
 "tags": [
  "antioch",
  "bell road",
  "gems from the nashville craigslist",
  "nose picking"
 ],
 "categories": [],
 "excerpt": "To the guy picking his nose in the black Ford behind me: Stop it. – 99 (Nashville)   Yesterday, while at a red light on Bell Road, I caught you in my rearview mirror. You were trying to remove an obstruction, possibly grape or grapefruit-sized from your left nostril. I don’t know if you could see my reaction in my mirror but I had quite a repulsed look on my face. You realize your windows are clear, correct? Stop it. […]",
 "contentEncoded": "<p style=\"text-align: center;\"><img class=\"aligncenter\" src=\"http://farm1.static.flickr.com/79/247907638_5c082b0d19.jpg\" alt=\"\"></p>\n<p><strong><a href=\"http://nashville.craigslist.org/mis/979610977.html\" target=\"_blank\">To the guy picking his nose in the black Ford behind me: Stop it. &#x2013; 99 (Nashville)</a></strong></p>\n<p>&#xA0;</p>\n<p><em>Yesterday, while at a red light on Bell Road, I caught you in my rearview mirror. You were trying to remove an obstruction, possibly grape or grapefruit-sized from your left nostril. I don&#x2019;t know if you could see my reaction in my mirror but I had quite a repulsed look on my face.</em></p>\n<p><em>You realize your windows are clear, correct? Stop it. There are others in Bell Road traffic who can see you and some of us may be on our way to lunch. Good luck eating after watching you push your entire hand up your nose. &#x201C;I&#x2019;ll just have water,&#x201D; they&#x2019;ll say upon sitting down at the restaurant. &#x201C;But, you said you were so hungry you could eat a horse, earlier,&#x201D; their dining companion will say. &#x201C;True. I was super hungry about 20 minutes ago. Then, I was stuck next to this guy in a black Ford on Bell Road who absolutely could not take his fist out of his nose. I&#x2019;m just really queasy right now. I might be able to choke down a Saltine.&#x201D;</em></p>\n<p><em>If you simply MUST pick your nose (sans Kleenex), please wait until you get home. No, that does not mean start digging on your front porch, in plain sight. It means, open the door, close it behind you, proceed down the hall and into the bathroom. Upon entering your bathroom, you might consider closing that door behind you, too. Then, dig as long and as hard as you want. If your cat has followed you into the bathroom, please gently set her in the hall before digging. No creature should have to witness what I caught you doing.</em></p>\n<p>Photo by&#xA0;<strong><a href=\"http://flickr.com/photos/mikekline/247907638/\" target=\"_blank\">Mike &#x201C;Dakinewavamon&#x201D; Kline</a><span style=\"font-weight: normal;\">.</span></strong></p>\n<p>&#xA0;</p>"
}