{
 "id": 3940,
 "name": "happy-hour-things-to-frown-about",
 "title": "Happy Hour: Things To Frown About",
 "author": "Christy Frink",
 "date": "2010-02-10T18:00:00-06:00",
 "tags": [
  "al-farooq islamic center of nashville",
  "alcohol sales",
  "consumer confidence",
  "curry todd",
  "elisa luna",
  "inskip elementary school",
  "islamville",
  "jerry cooper",
  "knoxville",
  "MTSU",
  "news channel 5",
  "sales tax holiday",
  "shooting",
  "tax free weekend"
 ],
 "categories": [],
 "excerpt": "Our hearts go out to Knoxville today where a fourth grade teacher decided to bust into Inskip Elementary School and gun down the principal and assistant principal. Neither were killed, though Elisa Luna, who’s actually the daughter of former state Senator Jerry Cooper, is still listed in critical condition. No children were in the school at the time either. [WKRN] An MTSU study found that Middle Tennesseans are getting more and more pessimistic about the current state of the economy […]",
 "contentEncoded": "<div style=\"text-align: center;\"><a href=\"http://www.flickr.com/photos/kittywinks_peeks/4344510355/in/pool-nashvillest\"><img class=\"alignnone\" src=\"http://farm3.static.flickr.com/2756/4344510355_1fb1fc777d.jpg\" alt=\"\" width=\"375\" height=\"500\"></a></div>\n<ul>\n<li>Our hearts go out to Knoxville today where a fourth grade teacher decided to bust into Inskip Elementary School and gun down the principal and assistant principal. Neither were killed, though Elisa Luna, who&#x2019;s actually the daughter of former state Senator Jerry Cooper, is still listed in critical condition. No children were in the school at the time either. [<a href=\"http://www.wkrn.com/global/story.asp?s=11964552\" target=\"_blank\">WKRN</a>]</li>\n<li>An MTSU study found that Middle Tennesseans are getting more and more pessimistic about the current state of the economy and job market, which we must admit is pretty sucktastic. Turn that frown upside down, Tennessee!&#xA0;[<a href=\"http://wpln.org/?p=14823\" target=\"_blank\">WPLN</a>]</li>\n<li>The date for this year&#x2019;s state sales tax-free weekend, of which there is now only one, has been bumped up a week to July 30-August 1. Last year&#x2019;s tax-free weekend was basically a giant fail because it happened after the school year had already started when the entire point is to help families purchase school clothes and supplies. [<a href=\"http://www.wsmv.com/news/22522847/detail.html\" target=\"_blank\">WSMV</a>]</li>\n<li>Rep. Curry Todd. Remember this name, because he&#x2019;s the one trying to ban all liquor sales in Tennessee after midnight. [<a href=\"http://www.tennessean.com/article/20100210/NEWS02/2100385/-1/RSS05\" target=\"_blank\">Tennessean</a>]</li>\n<li>Fresh on the heels of News Channel 5&#x2019;s controversial report on the Islamville Muslim community in Dover, TN, the Al-Farooq Mosque in Nashville was greeted with spraypainted slurs and a nasty letter. [<a href=\"http://blogs.nashvillescene.com/pitw/2010/02/vandals_strike_at_nashville_mo.php\" target=\"_blank\">Pith In The Wind</a>]</li>\n<li>Public health groups are urging lawmakers to raise the cigarette tax again to $1.00 per pack. [<a href=\"http://www.wsmv.com/money/22525522/detail.html\" target=\"_blank\">WSMV</a>]</li>\n</ul>\n<p><em>Photo by </em><a href=\"http://www.flickr.com/photos/kittywinks_peeks/4344510355/in/pool-nashvillest\" target=\"_blank\"><em>Kittywinks Peeks</em></a><em>.</em></p>"
}