{
 "id": 7278,
 "name": "the-po-po-shut-us-down-road-closures-cmapocalypse-11",
 "title": "The Po Po Shut Us Down [Road Closures] [CMApocalypse &#x2019;11]",
 "author": "Morgan Levy",
 "date": "2011-06-06T12:00:00-05:00",
 "tags": [
  "cma music festival",
  "cmapocalypse 2011",
  "fan fair",
  "road closures"
 ],
 "categories": [],
 "excerpt": "We’ve got good news and bad news. You were probably expecting the bad news – Starting tomorrow, Metro will slowly start shutting down streets downtown for the next week to make way for the influx of CMApocalypse foot traffic. The good news is this: If you take your bingo board out for a spin and you end up downtown, you can consume the appropriate amount of alcohol required for survival and catch a free ride home, which means you won’t […]",
 "contentEncoded": "<p><a href=\"http://www.flickr.com/photos/mr_t_in_dc/4264146249/\" target=\"blank\"><img class=\"aligncenter\" src=\"http://farm5.static.flickr.com/4024/4264146249_a89dd2f150.jpg\" alt=\"\"></a></p>\n<p>We&#x2019;ve got good news and bad news. You were probably expecting the bad news &#x2013; Starting tomorrow, Metro will slowly start shutting down streets downtown for the next week to make way for the influx of CMApocalypse foot traffic.</p>\n<p>The good news is this: If you take your <a href=\"http://nashvillest.com/?p=7273\" target=\"_blank\">bingo board</a> out for a spin and you end up downtown, you can consume the appropriate amount of alcohol required for survival and catch a free ride home, which means you won&#x2019;t have to worry about the road closures. Crown Royal will be doling out $10 Music City Taxi ride vouchers at the corner of 5th &amp; Broadway on Tuesday night from 7-10:30pm, and the vouchers can be used anytime from Tuesday &#x2019;till Sunday.</p>\n<p>Here are the road closures, so you can start planning your commutes around them. All closures unless otherwise noted below will reopen in the wee hours of the morning on Tuesday, June 14.</p>\n<p><strong>Closures beginning Tuesday, June 7: </strong></p>\n<div>\n<ul>\n<li>9am: Broadway from First to Second Avenues</li>\n<li>9am: First Avenue from Demonbreun to Church Streets</li>\n</ul>\n<p><strong>Closures beginning Wednesday, June 8:</strong></p>\n<ul>\n<li>12pm: Broadway from Second to Fourth Avenues (cross streets, Second and Third Avenues, will remain open)</li>\n<li>9am-2pm, Wednesday only: Tenth Avenue North from Broadway to Lifeway Plaza</li>\n<li>9am-2pm, Wednesday only: Commerce Street from Ninth to Tenth Avenues</li>\n<li>10:30am-1:30pm, Wednesday only: Broadway from First to Twelfth Avenues</li>\n</ul>\n<p><strong>Closures beginning Thursday, June 9: </strong></p>\n<ul>\n<li>12pm: Fifth Avenue from Demonbreun to Broadway</li>\n</ul>\n<p><em>Photo by </em><a href=\"http://www.flickr.com/photos/mr_t_in_dc/4264146249/\" target=\"_blank\"><em>Mr. T in DC</em></a><em>. </em></p>\n</div>"
}