{
 "id": 1739,
 "name": "nashville-film-festival-2009-500-days-of-summer-review-guest-posts",
 "title": "Nashville Film Festival 2009: 500 Days Of Summer Review [Guest Posts]",
 "author": "Morgan Levy",
 "date": "2009-04-20T17:09:00-05:00",
 "tags": [
  "500 days of summer",
  "film reviews",
  "naff09",
  "nashville film festival",
  "premiere",
  "release date",
  "screening"
 ],
 "categories": [],
 "excerpt": "Editor’s note: Guest blogger Winston Hearn eschews labeling himself because he’s a dabbler in many trades and an expert in none. When pressed, he’ll admit to being a video editor by day and aspiring filmmaker by dream. He likes road trips, great brews, and finding new ways to make his wife laugh. You can find him on Twitter or occasionally on his blog. When a romantic relationship begins it can be hard to define; there are a litany of titles […]",
 "contentEncoded": "<p><em> </em></p>\n<p style=\"text-align: center;\"><img class=\"aligncenter\" src=\"http://i43.tinypic.com/2cr2fs5.jpg\" alt=\"\"></p>\n<p style=\"text-align: left;\"><em>Editor&#x2019;s note: Guest blogger Winston Hearn eschews labeling himself because he&#x2019;s a dabbler in many trades and an expert in none. When pressed, he&#x2019;ll admit to being a video editor by day and aspiring filmmaker by dream. He likes road trips, great brews, and finding new ways to make his wife laugh. You can find him on <a href=\"http://twitter.com/winstonavich\" target=\"_blank\">Twitter</a> or occasionally on <a href=\"http://winstonavich.wordpress.com/\" target=\"_blank\">his blog</a>.</em></p>\n<p>When a romantic relationship begins it can be hard to define; there are a litany of titles and terms to describe burgeoning relationships. What do the terms &#x201C;boyfriend&#x201D; and &#x201C;girlfriend&#x201D; even mean, and since when is commitment wrapped up in a label? This is one of the many questions subtly examined in Marc Webb&#x2019;s debut feature 500 Days of Summer, which stars Zooey Deschanel (Hitchhikers Guide to the Galaxy, All the Real Girls) as Summer and Joseph Gordon-Levitt (10 Things I Hate About You, Brick) as Tom.</p>\n<p>The film, in its light-hearted and whimsical style, is concerned with what exactly love is in modern times. Both of the main characters come from homes with divorced parents, but Tom believes in true love and finding &#x201C;the one&#x201D; while Summer does not believe that love exists. The story examines the 500 days that Summer is in Tom&#x2019;s life, from the moment he first sees her on. It is told in a non-linear fashion that cleverly reveals the shape and development of their relationship.</p>\n<p><span id=\"more-1739\"></span>Tom is a greeting card writer who meets Summer when she starts working at the company as an administrative assistant. She is the dream girl of most boys and Tom is instantly attracted to her. The film then examines the path that they take to get to know each other as the relationship develops &#x2013;&#xA0; through awkward moments and missed opportunities up to the big events. To keep interest and to help build a complete picture of the relationship, the film bounces back in forth in time (intercut by titles that let us know what day we are on) showing us different periods of Tom and Summer&#x2019;s relationship.</p>\n<p>Webb (and writers Scott Neustadter &amp; Michael Weber) skillfully keep the movie fun and enjoyable with what he calls a &#x201C;kitchen-sink&#x201D; mode of filmmaking. The film has drawn comparisons to Woody Allen&#x2019;s classic Annie Hall for its serious examination of love and relationships, but I think the comparisons run deeper. Just like Allen used whatever means necessary to tell the story (thought subtitles, Marshall McLuhan appearing on cue, an Animated sequence with the Wicked Witch from Snow White) so too Webb and company make use of clever story-telling methods to help us enter Tom&#x2019;s mind. There is a split-screen sequence that shows Tom&#x2019;s expectations on one side vs Reality on the other, a dance scene complete with animated bluebird, and a short scene that breaks the fourth wall. Webb also utilizes his experience with music videos so that the music accentuates the visuals on screen very closely.</p>\n<p>But the scenes and songs do not stand-alone as gimmicks, rather they are all used to help emphasizethe storybook tone of the film. The film opens with a voice-over narration that is used as needed in the film, and this cues the audience that the film has many of the aspects we associate with a fairy-tale &#x2013; a beautiful, desirable girl, a guy searching for The One, the introduction of &#x201C;love&#x201D;. This film isn&#x2019;t intended to be a fairy tale though, nor is it intended to subvert fairy tales by setting up expectations that it later destroys. Rather, the film is seeking to question and wrestle with this generations understanding of love &#x2013; the fears of labeling relationships, the generation of kids who&#x2019;ve grown up after divorce, the desire for some concrete idea of love but the complete lack of any model or definition.</p>\n<p>The filmmakers recognize that part of the problems that they are examining in the film come from other movies themselves; pop culture tends to go for superficial &#x201C;greeting card&#x201D; definitions of love and romance and it just doesn&#x2019;t work out in real life. This film attempts to rise above the noise of romantic comedies, pop music, and Hallmark cards to ask some questions of substance. The film doesn&#x2019;t end with any specific answers, but it does provide some insight and hope from the 500 days that Tom spends with Summer.</p>\n<p>500 Days of Summer is a rare film; fun and whimsical in tone but satisfyingly strong in its thematic examinations of Love and relationships. It releases nationwide in July and I highly recommend you check it out when it does.</p>\n<p><em>Editor&#x2019;s note: Guest blogger Winston Hearn eschews labeling himself because he&#x2019;s a dabbler in many trades and an expert in none. When pressed, he&#x2019;ll admit to being a video editor by day and aspiring filmmaker by dream. He likes road trips, great brews, and finding new ways to make his wife laugh. You can find him on <a href=\"http://twitter.com/winstonavich\" target=\"_blank\">Twitter</a> or occasionally on <a href=\"http://winstonavich.wordpress.com/\" target=\"_blank\">his blog</a>.</em></p>"
}