{
 "id": 1738,
 "name": "nashville-staples-princes-hot-chicken-shack-review-guest-posts",
 "title": "Nashville Staples: Prince&#x2019;s Hot Chicken Shack Review [Guest Posts]",
 "author": "Morgan Levy",
 "date": "2009-04-20T16:08:00-05:00",
 "tags": [
  "bolton&apos;s",
  "hot chicken",
  "hot chicken nashville",
  "music city hot chicken festival",
  "prince&apos;s hot chicken",
  "southern fried hot chicken"
 ],
 "categories": [],
 "excerpt": "Editor’s note: Guest blogger Jon Arnold is a loyal contributor to Nashvillest, and has reviewed concerts and coffee for us in the past. You can find him on the web at Fruit Tree Music. Thanks, Jon! I’m sitting at my desk at work with a strange mix of emotions: indigestion, a little mouth pain, but with an overwhelming sense of contentment and a warm, full feeling.  This all makes sense when I say that my stomach sits full to the […]",
 "contentEncoded": "<p><em>Editor&#x2019;s note: Guest blogger Jon Arnold is a loyal contributor to Nashvillest, and has reviewed <a href=\"http://nashvillest.com/2009/02/09/fiction-family-at-the-belcourt-on-january-30-guest-posts/\" target=\"_blank\">concerts</a> and <a href=\"http://nashvillest.com/2008/10/01/crema-coffee-classes-guest-posts/\" target=\"_blank\">coffee</a> for us in the past. You can find him on the web at <a href=\"http://www.fruittreemusic.com/\" target=\"_blank\">Fruit Tree Music</a>. Thanks, Jon!</em></p>\n<div style=\"text-align: center;\"><img class=\"aligncenter\" src=\"http://farm4.static.flickr.com/3042/2632732764_737dde428d.jpg\" alt=\"\"></div>\n<p>I&#x2019;m sitting at my desk at work with a strange mix of emotions: indigestion, a little mouth pain, but with an overwhelming sense of contentment and a warm, full feeling. &#xA0;This all makes sense when I say that my stomach sits full to the brim with none other than Prince&#x2019;s Hot Chicken.</p>\n<p>Earlier today several of my coworkers piled into a couple of cars and, with me, made the trek to the heart of East Nashville for some uncomfortable comfort food. &#xA0;We arrived outside of Prince&#x2019;s right at noon, and were already tenth in line for the lunch rush (keep in mind Prince&#x2019;s only has 5 tables, so this is a packed house!).</p>\n<p>After a long but steady line, we order our food. &#xA0;I get a Medium heat dark quarter (leg and thigh), for an amazing $4. &#xA0;No wonder people come here every day! &#xA0;I get a side of potato salad and fries, plus a drink (and a cup for water, just in case).</p>\n<p>Everyone else in the group orders similar plates and we cram the six of us into one of the small booths built for four. &#xA0;We watch those around us get served these gigantic and beautiful cuts of chicken; as the kitchen crew calls out each ticket number, we get more and more antsy. I liken it to a similarly heart-pounding experience: standing in line for a roller coaster and watching those in front of you shoot off into oblivion as you step forward for your place in line.</p>\n<p>Each of us finally gets our number called and we crowd our plates onto our table. &#xA0;The chicken is steaming, and my Medium is visibly caked with cayenne and other spices. &#xA0;I dive right in and experience one of the best pieces of fried chicken in my entire life. &#xA0;The chicken is moist, flavorful, and the heat. Oh, the heat. &#xA0;It&#x2019;s just heavenly; it just burns and burns, making each bite more tolerable than the one before.</p>\n<p>As we dig in deeper, we realize something: the bread underneath the chicken is soaking up the wonderful spice, the pickles are covered in it, and we naturally start making little hot sandwiches out of the meat. &#xA0;Incredible. &#xA0;The bread feels hotter than the chicken itself, and we&#x2019;re all relieved to have ordered starchy cold side items to quench the fire.</p>\n<p>We destroy the meal. I&#x2019;m sucking on bones, this chicken is so good. I can&#x2019;t say it enough: this is literally a life-changing experience. &#xA0;We finish the meal, wash our hands three times to prevent accidentally burning an eye out or something, and pack the cars back up.</p>\n<p>On the ride back, the coma begins to set in. &#xA0;We&#x2019;re all tired and take notice of how the once dreary and overcast weather now feels cool and wonderful. My tongue is a little burned, more from the temperature of the chicken and the fries than the actual heat of the spice. &#xA0;My stomach is doing somersaults and isn&#x2019;t quite sure of what&#x2019;s happening to it.</p>\n<p>Now I know what the hype is all about; Prince&#x2019;s is really one of the gems in Nashville&#x2019;s food scene. &#xA0;It&#x2019;s not pretentious, it&#x2019;s not expensive, it&#x2019;s not fancy &#x2014; it&#x2019;s just awesome. Period. &#xA0;And it&#x2019;s addictive. &#xA0;I&#x2019;m already plotting another visit&#x2026; Maybe tonight. They stay open until 4am most nights, so you never know.</p>\n<p><a href=\"http://www.youtube.com/watch?v=72xXxV9qIPg\" target=\"_blank\">Click here to check out out this excellent documentary about Prince&#x2019;s Hot Chicken Shack</a> and learn how it was founded on a womanizer and his wife&#x2019;s revenge.</p>\n<p><em>Editor&#x2019;s note: Guest blogger Jon Arnold is a loyal contributor to Nashvillest, and has reviewed <a href=\"http://nashvillest.com/2009/02/09/fiction-family-at-the-belcourt-on-january-30-guest-posts/\" target=\"_blank\">concerts</a> and <a href=\"http://nashvillest.com/2008/10/01/crema-coffee-classes-guest-posts/\" target=\"_blank\">coffee</a> for us in the past. You can find him on the web at <a href=\"http://www.fruittreemusic.com/\" target=\"_blank\">Fruit Tree Music</a>. Thanks, Jon!</em></p>\n<p><em>Photo by <a href=\"http://www.flickr.com/photos/cgrantham/2632732764/\" target=\"_blank\">cgrantham</a>. </em></p>"
}