{
 "id": 1269,
 "name": "bright-early-in-wallys-world-edition",
 "title": "Bright &amp; Early: In Wally&#x2019;s World Edition",
 "author": "Christy Frink",
 "date": "2008-11-14T09:25:00-06:00",
 "tags": [
  "armed robbery",
  "chris johnson",
  "drive-by",
  "fantasy football",
  "german",
  "ICE",
  "illegals",
  "karl dean",
  "lil wayne",
  "nashville post",
  "titans",
  "undocumented immigrants",
  "walmart"
 ],
 "categories": [],
 "excerpt": "Good morning, Nashville. When we hear about drive-by shootings, Walmart isn’t the first location that comes to mind. But late last night, one car opened fire on another in the Nolensville Walmart parking lot (you know, the one that just got valet parking) and landed one man in the hospital with a bullet to the face. Luckily it just grazed him, but no one’s real sure about why it happened in the first place. Interesting tidbit. Titans’ Chris Johnson is […]",
 "contentEncoded": "<p style=\"text-align: center;\"><a href=\"http://flickr.com/photos/brent_nashville/1812669429/\" target=\"_blank\"><img class=\"aligncenter\" src=\"http://farm3.static.flickr.com/2311/1812669429_3201d64148.jpg?v=0\" alt=\"\" width=\"500\" height=\"373\"></a></p>\n<p>Good morning, Nashville. When we hear about drive-by shootings, Walmart isn&#x2019;t the first location that comes to mind. But late last night, <a href=\"http://www.newschannel5.com/global/story.asp?s=9349046\" target=\"_blank\">one car opened fire on another</a> in the Nolensville Walmart parking lot (you know, the one that just got valet parking) and landed one man in the hospital with a bullet to the face. Luckily it just grazed him, but no one&#x2019;s real sure about why it happened in the first place.</p>\n<ul>\n<li><strong>Interesting tidbit.</strong> Titans&#x2019; Chris Johnson is on <a href=\"http://www.newschannel5.com/global/story.asp?s=9347783\" target=\"_blank\">Lil Wayne&#x2019;s fantasy football team</a>, which Johnson explains is why Lil Wayne wore the jersey during his performance at the CMA Awards. This still doesn&#x2019;t solve the mystery of why Lil Wayne was performing at the CMA Awards.</li>\n<li><strong>When in doubt&#x2026; </strong>Why is Metro petitioning to borrow $59M from Clarksville? Well, <a href=\"http://www.nashvillecitypaper.com/news.php?viewStory=64155\" target=\"_blank\">we blame the Germans</a>. One of the banks the city borrows from&#x2013;a GERMAN bank&#x2013;had its rating downgraded during this whole <strong>economy fiasco, so Metro has to pay them sooner than they thought.</strong></li>\n<li><strong>Bits &amp; pieces.</strong> The city is <a href=\"http://www.tennessean.com/article/20081114/NEWS03/811140426\" target=\"_blank\">targeting undocumented immigrants</a> who have repeatedly entered the country after being deported for some serious jail time &#x2026; Mayor Dean is implementing some new green initiatives, but trust us&#x2013;the best part of this article <a href=\"http://www.nashvillepost.com/news/2008/11/13/dean_continues_green_streak\" target=\"_blank\">is the picture</a> &#x2026; 22 people were <a href=\"http://www.newschannel5.com/global/story.asp?s=9347162\" target=\"_blank\">robbed at gunpoint</a> in Springfield, but not all at the same time.</li>\n</ul>\n<p><em>Photo by <a href=\"http://flickr.com/photos/brent_nashville/1812669429/\" target=\"_blank\">brent and marilynn</a>.</em></p>"
}