{
 "id": 5341,
 "name": "nashvillest-loves-you-hannahs-nashville-boroughs-poster-giveaway",
 "title": "Nashvillest Loves You: Hannah&#x2019;s &#x201C;Nashville Boroughs&#x201D; Poster Giveaway",
 "author": "Morgan Levy",
 "date": "2010-07-12T12:00:00-05:00",
 "tags": [
  "contests",
  "giveaways",
  "hannah schmitt",
  "nashville artwork",
  "nashville boroughs poster"
 ],
 "categories": [],
 "excerpt": "Every now and then, we stumble across local artists doing things we really love, and occasionally they even want to share their talents with Nashvillest and our readers! Hannah Schmitt, a local graphic designer, came up with the idea of creating a Nashville “boroughs” poster as she looked for something similar to hang in her own home. Says Hannah: I designed these based on the old school style destination blinds that they would hang in train station windows showing the [...]",
 "contentEncoded": "<p><img class=\"alignleft\" style=\"margin: 5px;\" src=\"http://i29.tinypic.com/2mdghma.png\" alt=\"\" width=\"209\" height=\"610\">Every now and then, we stumble across local artists doing things we really love, and occasionally they even want to share their talents with Nashvillest and our readers! Hannah Schmitt, a local graphic designer, came up with the idea of creating a <a href=\"http://bit.ly/bHVGhL\" target=\"_blank\">Nashville &#x201C;boroughs&#x201D; poster</a> as she looked for something similar to hang in her own home. Says Hannah:</p>\n<blockquote><p><em>I designed these based on the old school style destination blinds that they would hang in train station windows showing the various destinations the trains would be going to. &#xA0;I wanted one but when shopping around, realized I couldn&#x2019;t spend the NINE hundred dollars they&#x2019;re going for and decided to make my own&#x2013; and then share them with Nashville!</em></p></blockquote>\n<p><a href=\"http://bit.ly/bHVGhL\" target=\"_blank\">The result</a> was an affordable, customizable, uniquely-Nashville art piece, and we&#x2019;re kind of drooling over it. <strong>And we have one to give away to a lucky Nashvillest reader!</strong> You can enter to win one of two ways, or do both and be entered to win twice!</p>\n<p>1. <strong>Leave a comment on this post, and tell us your favorite thing about Nashville</strong>. Your comment must include a valid email address to qualify (don&#x2019;t worry, we&#x2019;re the only ones who can see it, and we won&#x2019;t use your email address for anything except to notify you if you win!).</p>\n<p>2. <strong>Tweet about this contest</strong>. The easiest way is to retweet <a href=\"http://twitter.com/nashvillest/status/18368423117\" target=\"_blank\">this tweet</a>! To qualify, your tweet must include the hashtag <a href=\"http://nashvillest.com/2010/07/12/nashvillest-loves-you-hannahs-nashville-boroughs-poster-giveaway/#nashvillest\" target=\"_blank\">#nashvillest</a> and the original bit.ly link (<a href=\"http://bit.ly/nash_poster\" target=\"_blank\">http://bit.ly/nash_poster</a>), and follow us <a href=\"http://twitter.com/nashvillest\" target=\"_blank\">@nashvillest </a>(so we can DM you if you win). Also, if your account is protected, be sure to authorize us to follow you back! You can&#x2019;t win if we can&#x2019;t see your tweet.</p>\n<p><strong>The contest ends at 12pm CDT on Friday, July 16</strong>, so get your entries in before then! More than two entries will result in disqualification. You must have a mailing address in the lower 48 US states to win.</p>\n<p>Of course, winning isn&#x2019;t the only way to get your hands on one of these babies. The posters are 12&#xD7;35&#x2033;, printed on a thick, matte paper, and can be purchased framed ($60) or unframed ($35) at&#xA0;<a href=\"http://bit.ly/bHVGhL\" target=\"_blank\">Hannah&#x2019;s Etsy store</a>. Don&#x2019;t see your favorite part of Nashville on the poster? She&#x2019;ll gladly customize one for you.</p>\n<p style=\"text-align: center;\"><a href=\"http://www.etsy.com/listing/49943211/nashville-boroughs-poster\" target=\"blank\"><img class=\"aligncenter\" src=\"http://i27.tinypic.com/2rdalmu.jpg\" alt=\"\" width=\"364\" height=\"537\"></a></p>\n<p style=\"text-align: left;\"><strong>UPDATE: The winner has been chosen! Congratulations to Taylor M (@</strong><a href=\"http://twitter.com/Veritas3241\" target=\"_blank\"><strong>veritas3241</strong></a><strong>), and thanks to everyone else for your amazing entries. We had a great time watching the Nashville love fest grow in our comments section.</strong></p>"
}