{
 "id": 4182,
 "name": "2010-nashville-film-festival-lineup-announced",
 "title": "2010 Nashville Film Festival Lineup Announced",
 "author": "Morgan Levy",
 "date": "2010-03-11T12:00:00-06:00",
 "tags": [
  "naff10",
  "nashville film festival"
 ],
 "categories": [
  "Culture &amp; Arts",
  "Featured"
 ],
 "contentEncoded": "<p style=\"text-align: center;\"><img class=\"aligncenter\" src=\"http://i39.tinypic.com/5vvmzn.jpg\" alt=\"\" width=\"513\" height=\"134\"></p>\n<p>It seems like just yesterday that we were straggling through the <a href=\"http://nashvillest.com/tag/naff09/\" target=\"_blank\">2009 Nashville Film Festival</a> with over-ambitious schedules, obscene amounts of coffee and not nearly enough sleep. But it was almost a year ago, and it&#x2019;s that time again &#x2013; the 2010 Nashville Film Festival lineup has been announced, and we&#x2019;re getting tired just looking at it. 70 Feature Films, 9 World Premieres and over 220 films from 38 countries make up this year&#x2019;s offering. Impressive, yes?</p>\n<p>Click through to read the full lineup press release. The 2010 Nashville Film Festival takes place April 15-22 at Regal Green Hills Cinema, and tickets go on sale April 5. For more information, visit them online at <a href=\"http://www.nashvillefilmfestival.org/\" onclick=\"javascript:_gaq.push([&apos;_trackEvent&apos;,&apos;outbound-article&apos;,&apos;www.nashvillefilmfestival.org&apos;]);\" target=\"_blank\">NashvilleFilmFestival.org</a>.</p>\n<p><span id=\"more-4182\"></span></p>\n<blockquote><p><em> The Southeast premiere of director Shane Dax Taylor&#x2019;s &#x201C;Provinces of Night,&#x201D; starring Kris Kristofferson, Val Kilmer, Dwight Yoakam, Hilary Duff and Reece Thompson, is one of the highlights of the more than 70 feature films &#x2014; among them nine World Premieres &#x2014; that will screen at the 2010 Nashville Film Festival (NaFF) as part of either the Special Presentation, World Cinema, Graveyard, Retrospective or four competition categories. Together with short films, more than 220 films from more than 38 countries will screen at the Festival, which takes place April 15-22 at the Regal Green Hills Cinemas.</em></p>\n<div id=\"_mcePaste\"><em>Major films screening in the World Cinema category include directors Heidi Ewing and Rachel Grady&#x2019;s &#x201C;12th &amp; Delaware;&#x201D; Reed Cowan &#x2014; his film &#x201C;The Other Side of Lens&#x201D; World Premiered at NaFF 2009 &#x2014; and Steven Greenstreet&#x2019;s &#x201C;8: The Mormon Proposition;&#x201D; Catherine Breillat&#x2019;s &#x201C;Blue Beard;&#x201D; Yorgos Lanthimos&#x2019;s &#x201C;Dogtooth;&#x201D; David Morrissey&#x2019;s &#x201C;Don&#x2019;t Worry About Me;&#x201D; Ben Wheatley&#x2019;s &#x201C;Down Terrace;&#x201D; Joe O&#x2019;Brien&#x2019;s &#x201C;Endure;&#x201D; Chico Colvard&#x2019;s &#x201C;Family Affair;&#x201D; Stanley Nelson&#x2019;s &#x201C;Freedom Riders,&#x201D; Dagur K&#xE1;ri&#x2019;s &#x201C;The Good Heart;&#x201D; Luca Guadagnino&#x2019;s &#x201C;I Am Love;&#x201D; Jessica Hausner&#x2019;s &#x201C;Lourdes;&#x201D; Marco Berger&#x2019;s &#x201C;Plan B; Mary Ann Smothers Bruni&#x2019;s &#x201C;Quest for Honor;&#x201D; Steve James&#x2019;s &#x201C;No Crossover: Allen Iverson on Trial;&#x201D; Nikolai Muellerschoen&#x2019;s &#x201C;The Red Baron;&#x201D; Katerina Cizek and Peter Wintonick&#x2019;s &#x201C;Seeing is Believing;&#x201D; Peter Liechti&#x2019;s &#x201C;The Sound of Insects: Record of a Mummy;&#x201D; and David Kaplan&#x2019;s &#x201C;Today&#x2019;s Special.&#x201D;</em></div>\n<div><em><br>\n</em></div>\n<div id=\"_mcePaste\"><em>James, in addition to bringing &#x201C;No Crossover: Allen Iverson on Trial&#x201D; to the Festival, will also present a retrospective screening of his groundbreaking documentary, &#x201C;Hoop Dreams.&#x201D;</em></div>\n<div><em><br>\n</em></div>\n<div id=\"_mcePaste\"><em>&#x201C;I&#x2019;m really excited about the number of films we have from the UK this year, in addition to Italy, France, Greece, Austria and more,&#x201D; said NaFF artistic director Brian Owens. &#x201C;And to present a film from Iraqi Kurdistan in Nashville, which has the largest population of Kurds in the United States, is thrilling. Music film fans and documentary buffs will be extremely pleased with this year&#x2019;s selections, stretching over a wide swath of subjects and styles, including, for the first time, several sports-related films.&#x201D;</em></div>\n<div><em><br>\n</em></div>\n<div id=\"_mcePaste\"><em>Joining the previously announced Narrative Competition and First-Time Filmmakers Competition, a dozen films each, including a few to still be confirmed, will compete in the Documentary Competition and Music City/Music Films Competition.</em></div>\n<div><em><br>\n</em></div>\n<div id=\"_mcePaste\"><em>Titles screening in the Documentary Competition include Yun Suh&#x2019;s &#x201C;City of Borders;&#x201D; Andrew James and Joshua Ligair&#x2019;s &#x201C;Cleanflix;&#x201D; Michael Nash&#x2019;s &#x201C;Climate Refugees;&#x201D; Joshua Zeman&#x2019;s &#x201C;Cropsey;&#x201D; Ky Dickens&#x2019;s &#x201C;Fish Out of Water;&#x201D; Dean Hamer&#x2019;s &#x201C;Out in the Silence;&#x201D; Taggart Siegel&#x2019;s &#x201C;Queen of the Sun;&#x201D; Marshall Curry&#x2019;s &#x201C;Racing Dreams;&#x201D; James Franco&#x2019;s &#x201C;Saturday Night;&#x201D; Kathy Conkwright and Mary Makley&#x2019;s &#x201C;Southern Belle;&#x201D; Meerkat Media Collective&#x2019;s &#x201C;Stages;&#x201D; and Dirk Simon&#x2019;s &#x201C;When the Dragon Swallowed the Sun.&#x201D;</em></div>\n<div><em><br>\n</em></div>\n<div id=\"_mcePaste\"><em>Siegel&#x2019;s film, &#x201C;The Real Dirt on Farmer John,&#x201D; was the NaFF 2005 winner of the REEL Current Award, presented by Al Gore to a documentary that provides extraordinary insight in a contemporary global issue.</em></div>\n<div><em><br>\n</em></div>\n<div id=\"_mcePaste\"><em>Films included in NaFF&#x2019;s popular Music Films/Music City Competition are Niall McKay&#x2019;s &#x201C;The Bass Player (A Song for Dad);&#x201D; Robert Patton-Spruill&#x2019;s &#x201C;Do It Again;&#x201D; Clark Stiles&#x2019;s &#x201C;Don&#x2019;t Quit Your Daydream;&#x201D; Jim Bigham&#x2019;s &#x201C;For Once in My Life;&#x201D; Ruth Somal&#x2019;s &#x201C;James Blunt: Till You&#x2019;re Told to Stop;&#x201D; Kenneth Bowser&#x2019;s &#x201C;Phil Ochs: There But for Fortune,&#x201D; Steve Condon&#x2019;s &#x201C;Radio On: The Shawn and Hobby Band Documentary;&#x201D; Leanne Pooley&#x2019;s &#x201C;The Topp Twins: Untouchable Girls;&#x201D; and Kathleen McNamara&#x2019;s &#x201C;Why Isn&#x2019;t Chris von Sneidern Famous?&#x201D;</em></div>\n<div>\n<hr>\n<strong> Special Presentations</strong><strong>Opening Night: Nowhere Boy (Sam Taylor-Wood, UK)<br>\n</strong> &#x201C;Nowhere Boy,&#x201D; brings to life John Lennon as a spirited teenager &#x2014; curious, sharp and funny &#x2014; growing up in the war shattered city of Liverpool in dreary post-war Britain. Two extraordinary sisters tussle for his love: Mimi, the formidable aunt who raised him from the age of five and Julia, the spirited mother who gave him up to Mimi&#x2019;s care. Yearning for a normal family, John escapes into art and the new music flooding in from the United States. His fledgling genius finds a kindred spirit in the young Paul McCartney. But just as Lennon&#x2019;s new life begins, the truth about his past leads to a tragedy he would never escape.<p></p>\n<p><strong>Provinces of Night (Shane Dax Taylor, USA)<br>\n</strong> Fleming Bloodworth (Reece Thomspon) is alone in the world. His mother abandoned him and his cuckolded father (Dwight Yoakam) is on a quest for vengeance. He has one uncle (W. Earl Brown) who exists at the edge of lunacy, another uncle (Val Kilmer) who escaped for the bright lights of Nashville, and a grandmother who is slipping into dementia. His only true companions are his books and dreams of being a writer. Then he meets two people who forever transform his world: Raven Lee Halfacre (Hilary Duff), the bastard daughter of a prostitute, and E.F. Bloodworth (Kris Kristofferson), the grandfather he has never known who left forty years ago and never looked back.  Set in Tennessee and based on the book by William Gay.  Music by T Bone Burnett.</p>\n<p><strong>Retrospective: Hoop Dreams (Steve James, USA)<br>\n</strong> This Oscar-nominated and multiple award-winning documentary &#x2014; considered by many one of the best ever made &#x2014; follows two inner-city Chicago residents, Arthur Agee and William Gates, as they follow their dreams of becoming basketball superstars. Beginning at the start of their high school years, and ending almost 5 years later, as they start college, we watch the boys mature into men, still retaining their &#x201C;Hoop Dreams&#x201D;. Both are recruited into the same elite high school as their idol, former Detroit Piston superstar Isaiah Thomas. Only one survives the first year; the other must return to a high school closer to his home. Along the way, there is much tragedy, some joy, a great wealth of information about inner city life, and the suspense of not knowing what will occur next.</p>\n<p><strong>Closing Night: TBA</strong></p>\n<p><strong>World Cinema Today</strong></p>\n<p><strong>12th &amp; Delaware (Heidi Ewing, Rachel Grady, USA)<br>\n</strong> On an unassuming corner in Fort Pierce, Florida, it&#x2019;s easy to miss the insidious war that&#x2019;s raging. On one side of the street sits an abortion clinic. On the other, a pro-life outfit often mistaken for the clinic it seeks to shut down. Using skillful cinema-v&#xE9;rit&#xE9; observation that allows us to draw our own conclusions, Rachel Grady and Heidi Ewing, the directors of Jesus Camp, expose the molten core of America&#x2019;s most intractable conflict.</p>\n<p><strong>8: The Mormon Proposition (Reed Cowan, Steven Greenstreet, USA)<br>\n</strong> &#x201C;8: The Mormon Proposition&#x201D; exposes the efforts of the Mormon Church and its members to halt nearly every piece of LGBT legislation on the desks of lawmakers from Hawaii to New York. Emmy-award winning journalist and documentary filmmaker Reed Cowan is a former Mormon, which, coupled with his OUT status as a gay man and father of two adopted sons has provided a compelling and at times shocking look at the Mormon way of doing business against LGBT people.</p>\n<p><strong>Blue Beard (Catherine Breillat, France)<br>\n</strong> In Catherine Breillat&#x2019;s retelling of this classic tale, two young sisters play together in the attic of their home in 1950s France. Catherine (a stand-in for Breillat, according to her autobiographical statement) torments her timid sibling Marie-Anne with repeated dramatic readings of Bluebeard. As she does, the 17th-century story plays out on screen. In this stylized and highly literary adaptation, Breillat perfectly captures the pleasures to be had both in being frightened and in facing one&#x2019;s fears head-on.</p>\n<p><strong>Dogtooth (Yorgos Lanthimos, Greece)<br>\n</strong> Three teenagers are confined to an isolated country estate that could very well be on another planet. The trio spend their days listening to endless homemade tapes that teach them a whole new vocabulary. Any word that comes from beyond their family abode is instantly assigned a new meaning. Hence &#x2018;the sea&#x2019; refers to a large armchair and &#x2018;zombies&#x2019; are little yellow flowers. Having invented a brother whom they claim to have ostracized for his disobedience, the uber-controlling parents terrorize their offspring into submission. The father is the only family member who can leave the manicured lawns of their self-inflicted exile, earning their keep by managing a nearby factory, while the only outsider allowed on the premises is his colleague Christina, who is paid to relieve the son of his male urges. Tired of these dutiful acts of carnality, Christina enlists the elder daughter for some girl-on-girl action, carelessly disturbing the domestic balance. Soon enough, sex has spread throughout the household like fire. Next stop: rebellion.</p>\n<p><strong>Don&#x2019;t Worry About Me (David Morrissey, UK)<br>\n</strong> David (James Brough) is a guy from London who has a one-night stand. Afterwards, David attempts an act of kindness that leaves him flat broke with no way to get home. David ends up at a dog track, and on the advice of a passer-by named Tina (Helen Elizabeth), he picks a dog that wins big. Over the course of the day these two strangers explore Liverpool, and find they have more in common than they imagined.</p>\n<p><strong>Down Terrace (Ben Wheatley, UK)<br>\n</strong> Bill and Karl, a father and son outfit, have just got out of jail free &#x2013; but all is not well in Down Terrace &#x2013; For Karl, life in Billworld has become intolerable and he&#x2019;s close to the edge, in fact, he&#x2019;s falling over it. A darkly comic and deeply disturbing slice of social surrealism featuring the cream of British comedy character actors, Down Terrace is the debut feature film from director Ben Wheatley.</p>\n<p><strong>Endure (Joe O&#x2019;Brien, USA)<br>\n</strong> A young woman has been abducted, tortured and tied to a tree in the middle of an isolated swamp in central Florida. The only person who knows her location is dead. Veteran detective Emory Lane is called from the bedside of his ailing wife to unravel the mystery. Working with detective Zeth Arnold, the detectives uncover the secret life of the dead abductor and a startling revelation: they&#x2019;re not the only ones looking for the woman.</p>\n<p><strong>Family Affair (Chico Colvard, USA)<br>\n</strong> Like a scene torn from &#x201C;The Color Purple&#x201D; or &#x201C;Capturing the Friedmans,&#x201D; this deeply personal and uncompromising documentary examines the complex levels of pedophilia and how it can manipulate and control an entire family for life. &#x201C;Family Affair,&#x201D; is also a story about resilience, survival and understanding a child&#x2019;s capacity to accommodate a parent&#x2019;s past crimes in order to satisfy a basic longing for family.</p>\n<p><strong>Freedom Riders (Stanley Nelson, USA)<br>\n</strong> This is the story of more than four hundred Americans who participated in a bold and dangerous experiment designed to awaken the conscience of a complacent nation. These self-proclaimed, &#x2018;Freedom Riders&#x2019; challenged the mores of a racially segregated society by performing a disarmingly simple act. Traveling together in small interracial groups, they sat where they pleased on buses and trains and demanded unrestricted access. In the end, they helped launch a civil rights revolution that literally changed America, and the world.</p>\n<p><strong>The Good Heart (Dagur K&#xE1;ri, Iceland)<br>\n</strong> Jacques (Brian Cox) is the crusty, misanthropic owner of a grungy dive located on an even grimier back street in New York. An epic chain smoker, he knows he has only a short time left. In the hospital after his fifth coronary, he meets the ultra-meek Lucas (Paul Dano), a homeless kid who has pretty much given up on life. Determined to keep his bar going, Jacques takes Lucas under his wing and schools him in the decidedly arcane rules he lives by.</p>\n<p><strong>I Am Love (Luca Guadagnino, Italy)<br>\n</strong> &#x201C;I Am Love&#x201D; moves through the cultivated world of a wealthy and distinguished industrial family. It is a film of ritual and order, centered on a massive Milanese mansion whose airy rooms convey the power and stature of the Recchi family. Servants glide up elegant staircases to serve dishes of gracefully prepared food to a family that has gathered to celebrate the birthday of its patriarch, the man who built this small empire.</p>\n<p><strong>Lourdes (Jessica Hausner, Austria)<br>\n</strong> Christine (Sylvie Testud) has spent most of her life confined to a wheelchair, and she looks for a solution to her condition in faith as well as medical science. She makes a pilgrimage to Lourdes, where a celebrated miracle is said to have occurred. After several days of treatment, Christine has regained the full use of her arms and legs. But once she&#x2019;s experienced the miracle she hoped for, Christine&#x2019;s interest is less in thanking the Lord and more in pursuing a man.</p>\n<p><strong>Plan B (Marco Berger, Argentina)<br>\n</strong> Bruno is dumped by his girlfriend; behind a calm, indifferent expression, his mind plans a cold, sweet vengeance. She, a modern girl, keeps on seeing him once in a while, but has another boyfriend, Pablo. Bruno becomes Pablo&#x2019;s friend, with the idea of eroding the couple, maybe introducing him to another woman. But, along the way, the possibility of a plan B arises, a more effective one, which will put his own sexuality into question.</p>\n<p><strong>Quest for Honor (Mary Ann Smothers Bruni, Iraqi Kurdistan)<br>\n</strong> A former teacher and tireless activist works with local lawmen, Kurdish government agencies and her colleagues to investigate and eradicate honor killings in the tribal regions of Kurdistan.</p>\n<p><strong>No Crossover: Allen Iverson on Trial (Steve James, USA)<br>\n</strong> On Valentine&#x2019;s Day 1993, 17-year-old Bethel High School basketball star Allen Iverson was bowling in Hampton, Va., with five high school friends. It became a night that defined Iverson&#x2019;s young life. A quarrel soon erupted into a brawl pitting Iverson&#x2019;s young black friends against a group of white patrons. The fallout from the fight and the handling of the subsequent trial landed the teenager-considered by some the nation&#x2019;s best high school athlete-in jail and sharply divided the city along racial lines.</p>\n<p><strong>The Red Baron (Nikolai Muellerschoen, Germany/ Czech Republic)<br>\n</strong> In Europe, 1916, German aerial combat pilot Baron Manfred von Richthofen is a legend in his own time, a hero at home and a man both feared and respected by the enemy, until the young pilot falls in love with a beautiful and resolute nurse who opens his eyes to his role in the propaganda machine of a senseless and barbarous war.</p>\n<p><strong>Seeing is Believing (Katerina Cizek, Peter Wintonick, USA/Rwanda)<br>\n</strong> Handicams aren&#x2019;t just for weddings and family vacations.What happens when amateur front-line advocates pick up camcorders to document what they see? What are the risks and responsibilities? And what are the wider impacts on television and audiences? On international law and society? On documentary practice? SEEING IS BELIEVING is an unprecedented exploration into the political and social uses of handicams and new communications technologies, and human rights activists, war crimes investigators, right-wing videographers and ordinary citizens are arming themselves with tools of the new visual revolution.</p>\n<p><strong>The Sound of Insects: Record of a Mummy (Peter Liechti, Switzerland)<br>\n</strong> A hunter in a remote and idyllic forest stumbles on a make shift tent fashioned from sheets of plastic and containing the mummified remains of a corpse. A detailed journal found on site reveals that the man committed suicide by self-imposed starvation. Who was this man? Why did he kill himself in such a manner? Inspired by this true event and by the novella &#x2018;Until I Am a Mummy&#x2019; by Shimada Masahiko, Insects sensuously evokes the mysterious man&#x2019;s last days.</p>\n<p><strong>Today&#x2019;s Special (David Kaplan, USA)<br>\n</strong> American filmmaker David Kaplan&#x2019;s heart-warming tale is set in New York where Samir (Aasif Mandvi), is a top sous chef in an upmarket Manhattan restaurant, but is passed over for promotion because his cuisine lacks pizzazz. Upset, he resigns, and when his father gets suddenly ill, Samir has to look after their ailing, slummy Indian restaurant, when he can&#x2019;t even cook Indian food. Samir rediscovers his heritage and his passion for life through the enchanting art of cooking Indian food.</p>\n<p><strong>Narrative Competition </strong></p>\n<p><strong>Applause (Martin Zandvliet, Denmark)<br>\n</strong> When the critically-acclaimed actress Thea Barfoed (Paprika Steen) ends her rehab, she confronts a hard choice. During her heavy drinking period, she divorced and lost custody of her two boys; now she wants them to be a part of her life again. Her ex-husband Christian is quickly softened by her tough, manipulative, but charming figure and agrees. She has to prove to herself and to him, but the hard life on stage, and the ghosts of the past slowly comes knocking on her door. (Southeast Premiere)</p>\n<p><strong>Art House ( Victor Fanucchi, USA)<br>\n</strong> When a dishonest college dean and a philistine donor try to evict a household of starving art students from their communal house in order to make a dormitory for varsity golf, the art students rise up and fight to preserve their home, known for decades as a hard-partying haven for artists and artist-wannabes. Led by Nora Ohr (GRETA GERWIG), the eccentric housemates must overcome aesthetic disputes and romantic train wrecks, putting their futures on the line for the cause. (World Premiere)</p>\n<p><strong>The Athlete (Atletu) (Davey Frankel, Rasselas Lakew, Ethiopia)<br>\n</strong> This unique and elegant hybrid of autobiography, biopic and documentary tells the inspiring story of the great Ethiopian marathon runner Abebe Bikila, who in 1960 became the first African athlete to win gold at the Olympics &#x2013; a new world record. Bikila&#x2019;s story took a shocking turn after his numerous triumphs, yet nothing could keep him from pursuing his dreams all the way to the finish line, inspiring generations of Africans and others beyond. (Southeast Premiere)</p>\n<p><strong>Backyard (Carlos Carerra, Mexico)<br>\n</strong> The true story of the border town of Juarez, Mexico where since the mid-90&#x2032;s thousands of women have gone missing or turned up as sun-burnt corpses in the desert. Can new police captain Blanca Bravo (Ana de la Reguera) stop the savagery? (Tennessee Premiere)</p>\n<p><strong>The Be All and End All (Bruce Webb, United Kingdom)<br>\n</strong> Fifteen year olds Robbie and Ziggy think they&#x2019;ll be best friends forever but when Robbie collapses on holiday and is diagnosed with a fatal heart condition, forever suddenly seems a lot shorter. Lying in the children&#x2019;s ward, Robbie only has one thing on his mind: he doesn&#x2019;t want to die a virgin. And who has to overcome the odds and help him fulfill his final wish? His best friend Ziggy. (Southeast Premiere)</p>\n<p><strong>Beyond the Pole (David L. Williams, UK)<br>\n</strong> Beyond the Pole is a boys own adventure comedy, which follows two hapless friends as they set out on the first Carbon Neutral, Vegetarian, Organic expedition ever to attempt the North Pole. Funny and subversive it is the story of two men trying to find their place in the world before the end of the world. And it asks one question of us all: How far would you go to save the planet? (Tennessee Premiere)</p>\n<p><strong>Black, White, and Blues (Mario Van Peebles, USA)<br>\n</strong> Filmed in Nashville in 2009, Mario Van Peebles directed this drama of spiritual redemption against the backdrop of the Memphis blues starring Michael Clarke Duncan and Morgan Simpson. (World Premiere)</p>\n<p><strong>The Colonel&#x2019;s Bride (Brent Stewart, USA)<br>\n</strong> A fallen man and retired US Army Colonel, Bill (JD Parker) is an occasional commercial real-estate agent who spends most of his waking hours in the company of bourbon, cigarettes and a persistent cough. Attempting to make amends with a tattered past, he embraces a young, Vietnamese mail-order bride (Alicia Truong). After a brief courtship they are wed, and despite a language barrier and the Colonel&#x2019;s impotence, Bill attempts to prove his love as a companion and make amends for a history of regrets. (World Premiere)</p>\n<p><strong>Hipsters (Valeriy Todorovskiy, Russia)<br>\n</strong> Hipsters is a vibrant musical full of razzle, dazzle, and rhythm, which chronicles the 1950s conflict between Russia&#x2019;s communist government authorities bent on keeping all things Soviet, &#x201C;normal&#x201D; Russians primarily interested in surviving for one more day, and teens craving American pop culture &#x2013; &#x201C;stilyagi&#x201D; or &#x201C;hipsters&#x201D;. The battle of conformity and individual expression supplies a high level of tension that keeps one mentally interested in this marriage of Dostoyevsky and Footloose. (Southeast Premiere)</p>\n<p><strong>TiMER (Jac Schaeffer, USA)<br>\n</strong> What if a clock could count down to the moment you meet your soul mate? In this alternate version of present day Los Angeles, a revolutionary device called the TiMer fulfills this fantasy. Unless, that is, if you&#x2019;re Oona O&#x2019;eary (Emma Caulfield, Buffy the Vampire Slayer), who faces the rare dilemma of a blank TiMer. Only when Oona ignores the ticking clock can she finally experience the exhilarating and unpredictable hot mess that is love. (Tennessee Premiere)</p>\n<p><strong>Waiting for Forever (James Keach, USA)<br>\n</strong> Life has gotten complicated for actress Emma Twist (Rachel Bilson). Her mediocre TV show has been canceled, she&#x2019;s on the rocks with her boyfriend Aaron (Matt Davis), and her father&#x2019;s (Richard Jenkins) illness has been deemed terminal. To make matters worse, her childhood friend Will Donner (Tom Sturridge) has decided now is the time to profess his true feelings for her. When everyone unexpectedly converges in Emma&#x2019;s hometown, questions of family, love, and how we live our lives are explored. (Southeast Premiere)</p>\n<p><strong>Phillip The Fossil (Garth Donovan, USA)<br>\n</strong> Set in small-town New England, Phillip The Fossil follows an aging party animal chasing the now extinct glory days of his youth. Blowing lines with kids half his age, making it rain in strip clubs, and voraciously pawing naive girls with &#x201C;JUICY&#x201D; tagged across their rears are all part of Phillip&#x2019;s relentless pursuit of the endless summer. He chuckles along as the carefree town jester, but beneath this suffocating guise Phillip feels increasingly isolated in the dead end rut he has so comfortably dug.</p>\n<p><strong>Documentary Competition </strong></p>\n<p><strong>City of Borders (Yun Suh, USA)<br>\n</strong> In the heart of Jerusalem &#x2013; defying generations of segregation, violence and prejudice &#x2013; stands an unlikely symbol of unity: a gay bar called &#x2018;Shushan.&#x2019; Inside this underground sanctuary, people of all nationalities, religious affiliations and sexual orientations gather under one roof and forge a type of community. CITY OF BORDERS explores the bond forged when people from warring worlds embrace what everyone shares in common-the right to be accepted and belong-rather than be defined, or limited by the differences that tear them apart. (Southeast Premiere)</p>\n<p><strong>Cleanflix (Andrew James &amp; Joshua Ligairi, USA)<br>\n</strong> Cleanflix follows the sanitized movie industry from inception to collapse. Starting with Kate Winslet&#x2019;s bare breasts in Titanic and the Mormon culture that didn&#x2019;t want to see them, the film launches into the numerous legal and theoretical debates that led to a DGA lawsuit involving industry titans. The film then tracks the dozen or so stores that defied court order and remained in operation, focusing on the infamous Daniel Thompson, de facto leader of Utah&#x2019;s the edited movie revival. (Tennessee Premiere)</p>\n<p><strong>Climate Refugees (Michael Nash, USA)<br>\n</strong> &#x201C;Climate Refugees&#x201D; uncovers the unbelievable plight of people around the world displaced by climatically induced environmental disasters. The documentary illuminates the human face of climate change and the collision that civilization now finds itself at between over population, lack of resources and our changing climate. By traveling the world and interviewing several of the 25 million climate refugees now on the run, &#x201C;Climate Refugees&#x201D; brings to light the heart wrenching truth of what is quickly becoming mankind&#x2019;s greatest challenge. (Southeast Premiere)</p>\n<p><strong>Cropsey (Joshua Zeman, USA)<br>\n</strong> Realizing the urban legend of their youth has actually come true; two filmmakers delve into the mystery surrounding five missing children and the real-life boogeyman linked to their disappearances. Cropsey, a feature-length documentary, offers an intimate, first hand account of one community&#x2019;s proximity to terror, its abandonment by the legal system, and the vigilant response to the death of its children. (Tennessee Premiere)</p>\n<p><strong>Fish Out of Water (Ky Dickens, USA)<br>\n</strong> Coming out of the closet can be challenging and for Ky Dickens, her experience coming out to friends at Vanderbilt University led to the making of &#x201C;Fish Out of Water,&#x201D; a spirited documentary that explores the seven Bible passages notoriously used to condemn homosexuality and justify marriage discrimination. With the help of a cartoon narrator, animated recollections of Bible passages and witty illustrations, &#x201C;Fish Out of Water&#x201D;makes this polarizing subject accessible and non-threatening.</p>\n<p><strong>Out in the Silence (Dean Hamer, USA)<br>\n</strong> The announcement of filmmaker Joe Wilson&#x2019;s wedding to another man ignites a firestorm of controversy and a quest for change in the small Pennsylvania hometown he left long ago. Drawn back by a plea for help from the mother of a gay teen being tormented at school, Wilson takes viewers on an exhilarating journey through love, hate, and understanding in rural America. (Southeast Premiere)</p>\n<p><strong>Queen of the Sun (Taggart Siegel, USA)<br>\n</strong> In 1923, Rudolf Steiner, an Austrian Scientist, predicted that in only 80 to 100 years, honeybees would collapse. &#x201C;Queen of The Sun&#x201D; investigates and reveals the causes of the recent collapse, from highly mechanized industrial beekeeping practices to pesticide-driven agriculture, disease and artificial queen breeding. Through the voices of beekeepers around the world, &#x201C;Queen of The Sun&#x201D; weaves a dramatic story that uncovers the problems and solutions in renewing a culture in balance with nature. (World Premiere)</p>\n<p><strong>Racing Dreams (Marshall Curry, USA)<br>\n</strong> Academy Award nominated director, Marshall Curry, chronicles these young drivers&#x2019; lives in intimate detail &#x2014; at home, at school, and on the track &#x2013; to tell a universal story about adolescence, family, and a love of racing. &#x201C;Racing Dreams&#x201D; will introduce new audiences to the sport of racing, and for the 75 million Americans who already love it; it will be a familiar celebration of family, country and speed. (Tennessee Premiere)</p>\n<p><strong>Saturday Night (James Franco, USA)<br>\n</strong> With unprecedented access to the behind the scenes process of the writers, actors and producers, Franco and his crew document what it takes to create one full episode of Saturday Night Live. (Southeast Premiere)</p>\n<p><strong>Southern Belle (Kathy Konkwright, Mary Makley, USA)<br>\n</strong> The Civil War may be long over but the spirit of rebellion is hard to extinguish in the South even in something as innocent as a girls&#x2019; summer camp. &#x201C;Southern Belle&#x201D; is a unique insider&#x2019;s look at the 1861 Athenaeum Girls&#x2019; School in Columbia, Tennessee where young women from around the world eagerly sign up to become that iconic and romantic image of southern identity: the southern belle, replete with hoop skirt, hat and gloves, singing the region&#x2019;s anthem, Dixie. Even today, the southern belle and the values she embodies are at the heart of every political discussion driving positions on civil rights, women&#x2019;s rights, the sanctity of marriage, and federal versus state government power &#x2013; to name a few. To understand the Athenaeum Girls&#x2019; School&#x2019;s icon of the Old South is to better understand the issues that continue to define and divide America today. (World Premiere)</p>\n<p><strong>Stages (Meerkat Media Collective, USA)<br>\n</strong> Over twenty weeks, a group of older Puerto Rican women and inner-city youth unite in New York City&#x2019;s oldest community center to create an original play out of the stories of their lives. Weaving together themes of immigration, evolution, aging and coming of age, Stages offers an intimate portrait of an unlikely ensemble, transformed by the liberating power of their own stories&#x2013; first as they are spoken across generations, and later when they are performed for a sold-out show. (Tennessee Premiere)</p>\n<p><strong>When the Dragon Swallowed the Sun (Dirk Simon, USA)<br>\n</strong> &#x201C;When the Dragon Swallowed the Sun&#x201D; shows an unprecedented inside perspective on the Tibetan community in exile, it&#x2019;s young generation and their struggle to free their homeland Tibet. The film reveals an internal conflict that has been dividing Tibetans and hindering their movement for decades, and explores the struggle of a young Tibetan King alongside the peers of his generation. It reveals for the first time how they try to reflect on their history, while simultaneously redefining their identities. (Southeast Premiere)</p>\n<p><strong>Music Films/Music City Competition</strong></p>\n<p><strong>The Bass Player (A Song for Dad) (Niall McKay, Ireland)<br>\n</strong> In this eloquent, witty homage to his father, filmmaker Niall McKay wrestles with his family&#x2019;s unsettling past to overcome his fear of commitment. As Niall helps his elderly father Jim, a jazz bass player, return home to Ireland, father and son revisit Niall&#x2019;s tumultuous childhood with an abusive, unpredictable mother and a musician father who was often on the road. Striking many poignant chords, the filmmaker&#x2019;s evolving notions of family and commitment will charm and amuse. (Southeast Premiere)</p>\n<p><strong>Do It Again ( Robert Patton-Spruill, USA)<br>\n</strong> In &#x201C;Do It Again,&#x201D; newspaper reporter Geoff Edgers launches his crazy idea to reunite the Kinks. The film takes us through backstage hotspots, as Geoff works toward telling the story of his favorite, underappreciated rock band. Along his journey, we&#x2019;ll encounter Sting, Zooey Deschanel, Clive Davis, Robyn Hitchcock, Paul Weller and Peter Buck. Will Geoff succeed in his goal, when he finally encounters the leaders of the band, Ray and Dave Davies? (Tennessee Premiere)</p>\n<p><strong>Don&#x2019;t Quit Your Daydream (Clark Stiles, USA)<br>\n</strong> Nathan and Clark are life-long musicians, and sometimes friends, who refuse to delegate their childhood dreams to a hobby. These two forty-year-old band mates ditch their day jobs, and for one month, drive across the country stopping in a new town every other day to collaborate with unknown local musicians. Throughout their journey they encounter a diverse cast of strangers who force them to reconsider what it means to live a life dedicated to the art of music. (World Premiere)</p>\n<p><strong>For Once in My Life (Jim Bigham, USA)<br>\n</strong> A true story about a band made up of singers and musicians with a wide range of mental and physical disabilities. This documentary is an inspiring look at a special group and their dream to make music. In a cinema verite style, the film reveals the struggles and triumphs, as performers and people, dealing with severe challenges while on a journey to become true musicians and perform to large audiences. (Southeast Premiere)</p>\n<p><strong>For the Sake of Song: The Story of Anderson Fair (Bruce Bryant, USA)<br>\n</strong> For forty years, Houston&#x2019;s legendary folk and acoustic music venue, Anderson Fair Retail Restaurant, has fostered and nurtured some of the most important musical performers and songwriters in America. This film explores the significant role &#x201C;the Fair&#x201D; has played in preserving an American musical tradition, as a unique American music institution. &#x201C;For The Sake Of The Song&#x201D; tells the tale of one small place where the sound is true, the spotlight gentle, the applause encouraging, and big things happen. (Southeast Premiere)</p>\n<p><strong>James Blunt: Till You&#x2019;re Told to Stop (Ruth Somalo, UK)<br>\n</strong> &#x201C;Till You&#x2019;re Told To Stop&#x201D; follows the voyage of a humble British soldier who resigned from his post as a Queen&#x2019;s Guard to become a musician. It tracks the steps of James Blunt, an artist with no musical background through to his enormous worldwide success with his debut album &#x201C;Back To Bedlam.&#x201D; (Southeast Premiere)</p>\n<p><strong>Ne Change Rien (Pedro Costa, Portugal/France)<br>\n</strong> In Ne Change Rien, we see the French actress/singer Jeanne Balibar rehearsing, recording, performing and practicing with a singing coach for an opera bouffe by Jacques Offenbach. The Portuguese director Pedro Costa filmed her in long, static shots in which all attention is focused on her performance. Costa also manages to portray the creative process, for instance in a scene in which Balibar and her guitarist Rodolphe Burger try out several variations of a song. (Southeast Premiere)</p>\n<p><strong>Radio On: The Shawn and Hobby Band Documentary (Steve Condon, USA)<br>\n</strong> How exactly does a former acoustic duo playing dive bars in Pittsburgh turn into one of the most popular and successful house bands in Nashville, in just about a year?<br>\n(World Premiere)</p>\n<p><strong>The Topp Twins: Untouchable Girls (Leanne Pooley, New Zealand)<br>\n</strong> THE TOPP TWINS: UNTOUHABLE GIRLS is a profile of the world&#x2019;s only comedic, singing, dancing, lesbian twin sisters. Fun, disarming and musically provocative, the Topp Twins are New Zealand&#x2019;s finest lesbian country and western singers and the country&#x2019;s greatest export since rack of lamb and the Lord of the Rings movie trilogy. (Southeast Premiere)</p>\n<p><strong>Why Isn&#x2019;t Chris von Sneidern Famous? (Kathleen McNamara, USA)<br>\n</strong> &#x2018;You&#x2019;re so good, you should be famous&#x2019; sounds like words anyone would love to hear, but after 12 albums and over 20 years, the compliment wears thin. Critically acclaimed for his musical talents and infamous for his charismatic and uncompromising personality, singer/songwriter and guitarist, Chris von Sneidern (CVS) is a long-time fixture of San Francisco&#x2019;s independent music scene. This is the story of his passionate search for artistic freedom and success, and the challenge posed by the inevitable disparity between our dreams and reality. (Southeast Premiere)</p>\n<p><strong>New Directors Competition</strong></p>\n<p><strong>Bomber (Paul Cotter, UK, USA)<br>\n</strong> An 83-year-old man returns to Germany for a long planned journey of atonement. When Ross, his useless son agrees to drive him there, a nightmare family road trip ensues. (Southeast Premiere)</p>\n<p><strong>The Burial (Danielle Boucher, David William Mills, France)<br>\n</strong> When three estranged brothers gather for their mother&#x2019;s funeral the last thing they expected was a family road trip. Mother&#x2019;s final wish was clear: &#x201C;take me to the river and bury me with your Father.&#x201D; The reluctant sons, a girlfriend and a coffin squash into a vintage hearse, bumble their way from France to England, and realize that to bury the past, there&#x2019;s some digging up to do. (North American Premiere)</p>\n<p><strong>Dear Lemon Lima (Suzi Yoonessi, USA)<br>\n</strong> As sweet and colorful as a snow cone, this delightful happy-sad confection follows an awkward Alaskan teen as she discovers her Yup&#x2019;ik heritage, while rallying her fellow misfits to compete in her school&#x2019;s Snowstorm Survivor competition.(Tennessee Premiere)</p>\n<p><strong>Fighting Fish (Annette Apitz, USA)<br>\n</strong> Twenty-one-year-old David still lives at home, taking care of his young siblings. When his wild and beautiful sister Alice returns after a long absence, their complicated past comes back to haunt them. As David falls in love with the new girl in town, Alice is driven to desperate measures to keep her brother close, and her world intact. (World Premiere)</p>\n<p><strong>Herpes Boy (Nathaniel Atcheson, USA)<br>\n</strong> Rudolph Murray (Byron Lane, &#x201C;Herpes Boy&#x201D; web series) hates his life. He has a large purple birthmark on his upper lip and everyday he finds someone staring, pointing, or calling him names-like Herpes Boy. He makes videos for the Internet in which he rants about his quirky life and zany family. When his cousin (Ahna O&#x2019;Reilly, &#x201C;Forgetting Sarah Marshall&#x201D;) re-edits his videos to make herself more popular, it attracts a huge new audience and makes Rudolph an unlikely-and unwilling-cyber-celebrity at the worst possible time in his life. (Southeast Premiere)</p>\n<p><strong>New Low (Adam Bowers, USA)<br>\n</strong> The worst thing about Wendell isn&#x2019;t his slightly balding head, skinny frame, or thin lips; it&#x2019;s that he&#x2019;s a bit of an idiot. He just started dating Vicky, an angry drunk, who conveniently shares his lack of ambition and cleanliness. But he might prefer a relationship with Joanna because she&#x2019;s a selfless social worker who doesn&#x2019;t have lip acne. Eventually, Wendell is going to have to decide whom he really belongs with: the best girl he&#x2019;s ever known &#x2014; or the worst. (Tennessee Premiere)</p>\n<p><strong>Northless (Rigoberto P&#xE9;rezcano, Mexico/Spain)<br>\n</strong> Andres reaches the Mexican border to cross into the United Sates. There between each attempt, he discovers that Tijuana is a troubled city. As he waits there, Andres is not only confronted with his feelings and what he left behind, but also with those he meets. (Tennessee Premiere)</p>\n<p><strong>One Too Many Mornings (Michael Mohan, USA)<br>\n</strong> Peter has just run away from his girlfriend of 5 years, seeking solace in his estranged friend from high school, Fischer. Fischer lives in a church, for free, in exchange for turning off the lights and locking the doors. As Fischer tries to help Peter recover, Peter quickly learns that Fischer has much more serious problems of his own. &#x201C;One Too Many Mornings&#x201D; is a coming of age comedy about how running away from your problems can cause you to smack headfirst into someone else. (Southeast Premiere)</p>\n<p><strong>Pickin&#x2019; and Grinnin&#x2019; (Jon Gries, USA)<br>\n</strong> Jon Gries (Uncle Rico in &#x201C;Napoleon Dynamite&#x201D;) directs this comic take-off on reality music competitions like &#x201C;Nashville Star&#x201D;and &#x201C;American Idol.&#x201D; (World Premiere)</p>\n<p><strong>Secure Space (Oren Gvili, Israel)<br>\n</strong> A bride, groom and their families are stranded within a bomb shelter in the Israeli city of Haifa, while the Second Lebanon war is raging outside. The pressure of wedding preparations, the crowdedness, the perspiration and the sultriness are mixed with the sirens and bombings outside, leading to a new climax of fear when the family finds the groom&#x2019;s 16-year-old brother roaming outside, hanging direction signs for the wedding ceremony. As the groom goes out in search of his brother, a series of events bring him to new conclusions about the fragileness of his present and future life. (North American Premiere)</p>\n<p><strong>Snow &amp; Ashes (Charles-Olivier Michaud, Canada)<br>\n</strong> An armed conflict rages in a region of Eastern Europe. Blaise Dumas, war journalist for Frontline Reporters covers the war. In Quebec, when he erupts from a coma, Blaise discovers that his long time collaborator and photographer has not come back with him. Blaise sets out to remember the events that lead to his friend&#x2019;s disappearance and his own escape from the war zone. A compelling human, post-modern western tale. (Southeast Premiere)</p>\n<p><strong>Vegetarian (Seong-woon Lim, South Korea)<br>\n</strong> A young woman abolishes meat from her diet and her home, and soon rejects her husband, who smells of meat. Rejected by her family as a result, she grows despondent, alienating herself from everyone. Her sister tries to reach her, but only her brother-in-law, an artist, manages to penetrate her withdrawn state. Her mysterious trauma ignites creativity and desire in him, and they collaborate passionately on beautiful body-painting art &#x2014; drawing on her psychological pain but also providing the catalyst for her mystical transformation. (Southeast Premiere)</p>\n</div>\n</blockquote>\n\n\n\n\n<p>Related posts:<ol><li><a href=\"http://nashvillest.com/2010/04/22/draw-the-curtains-its-closing-night-at-2010-nashville-film-festival/\" rel=\"bookmark\" title=\"Permanent Link: Draw The Curtains: It&#x2019;s Closing Night At 2010 Nashville Film Festival\">Draw The Curtains: It&#x2019;s Closing Night At 2010 Nashville Film Festival</a></li>\n<li><a href=\"http://nashvillest.com/2009/04/19/nashville-film-festival-2009-beyond-opening-weekend/\" rel=\"bookmark\" title=\"Permanent Link: Nashville Film Festival 2009: Beyond Opening Weekend\">Nashville Film Festival 2009: Beyond Opening Weekend</a></li>\n<li><a href=\"http://nashvillest.com/2010/08/02/earlybird-next-big-nashville-tickets-lineup-announced-nbn-10/\" rel=\"bookmark\" title=\"Permanent Link: Earlybird Next Big Nashville Tickets, Lineup Announced [NBN \" 10]'=\"\">Earlybird Next Big Nashville Tickets, Lineup Announced [NBN &apos;10]</a></li>\n<li><a href=\"http://nashvillest.com/2009/02/11/william-shatners-gonzo-ballet-to-premier-at-nashville-film-festival/\" rel=\"bookmark\" title=\"Permanent Link: &#x2018;William Shatner&#x2019;s Gonzo Ballet&#x2019; To Premiere At Nashville Film Festival\">&#x2018;William Shatner&#x2019;s Gonzo Ballet&#x2019; To Premiere At Nashville Film Festival</a></li>\n<li><a href=\"http://nashvillest.com/2011/04/11/a-cheapskates-guide-to-the-nashville-film-festival-freebies-naff-11/\" rel=\"bookmark\" title=\"Permanent Link: A Cheapskate&#x2019;s Guide To The Nashville Film Festival [Freebies] [NaFF \" 11]'=\"\">A Cheapskate&#x2019;s Guide To The Nashville Film Festival [Freebies] [NaFF &apos;11]</a></li>\n</ol></p>\t\t\t\t\t\t\t\t\t\t\t<!--END .entry-content .article-->"
}