{
 "id": 7120,
 "name": "the-belcourt-makes-summer-magical-with-free-outdoor-cinema",
 "title": "The Belcourt Knocks Summer Out Of The Park: Free Outdoor Cinema, Eight First Run Films &amp; More",
 "author": "Morgan Levy",
 "date": "2011-05-13T14:00:00-05:00",
 "tags": [
  "belcourt theatre",
  "first run films",
  "freebies",
  "movies in the park",
  "nashville film festival",
  "second saturday outdoor cinema",
  "theater",
  "theatre"
 ],
 "categories": [],
 "excerpt": "We have an announcement to make: Nashvillest is now going to be spending our entire summer indoors. The Belcourt been announcing their summer lineup piece-by-piece, Bonnaroo style, via Twitter today and it just keeps getting better and better. As you might know, we’re big fans of the freebies here at Nashvillest, so a Second Saturday Outdoor Cinema lineup that includes The Blues Brothers, Destry Rides Again, Wargames and Psycho is music to our ears. But they didn’t stop there, and now […]",
 "contentEncoded": "<p><a href=\"http://www.flickr.com/photos/joelhwilliams/5459906277/\" target=\"blank\"><img class=\"aligncenter\" src=\"http://farm6.static.flickr.com/5017/5459906277_829f4b6f33.jpg\" alt=\"\"></a></p>\n<p>We have an announcement to make: Nashvillest is now going to be spending our entire summer indoors. The Belcourt been announcing their summer lineup piece-by-piece, Bonnaroo style, via <a href=\"http://twitter.com/belcourt\" target=\"_blank\">Twitter</a> today and it just keeps getting better and better.&#xA0;As you might know, we&#x2019;re big fans of the freebies here at Nashvillest, so a <a href=\"http://www.belcourt.org/events?id=75767\" target=\"_blank\">Second Saturday Outdoor Cinema lineup that includes </a><em><a href=\"http://www.belcourt.org/events?id=75767\" target=\"_blank\">The Blues Brothers</a></em><a href=\"http://www.belcourt.org/events?id=75767\" target=\"_blank\">, </a><em><a href=\"http://www.belcourt.org/events?id=75767\" target=\"_blank\">Destry Rides Again, Wargames</a></em><a href=\"http://www.belcourt.org/events?id=75767\" target=\"_blank\"> and</a><em><a href=\"http://www.belcourt.org/events?id=75767\" target=\"_blank\"> Psycho</a></em> is music to our ears. But they didn&#x2019;t stop there, and now it looks like we&#x2019;ll be shelling out a giant chunk of our hard-earned cash on dozens of must-see films this summer.</p>\n<p>We&#x2019;ll reminisce about Conan&#x2019;s Nashville appearance that we couldn&#x2019;t get into (but we&#x2019;re not bitter&#x2026;) at&#xA0;<em><a href=\"http://www.belcourt.org/events?id=75847\" target=\"_blank\">Conan O&#x2019;Brien Can&#x2019;t Stop</a>,</em> screening June 24-30. We&#x2019;ll catch crowd-pleasers from the Nashville Film Festival that we couldn&#x2019;t fit into our crazy schedules last month (<em><a href=\"http://www.belcourt.org/events?id=75762\" target=\"_blank\">Buck</a></em>, opens June 24; <em><a href=\"http://www.belcourt.org/events?id=75761\" target=\"_blank\">Uncle Boonmee Who Can Recall His Past Lives</a></em>, limited June 17-19 run). We&#x2019;ll spend our <a href=\"http://www.belcourt.org/events?id=75765\" target=\"_blank\">Tuesdays reviewing the filmography of acclaimed director Terrance Malick</a> (<em>Badlands, Days of Heaven, The Thin Red Line, The New World</em>), culminating in a full run of his latest effort, the highly anticipated <em>The Trees Of Life</em>. And if we haven&#x2019;t completely morphed into a theatre seat by that point, we&#x2019;ll spend the rest of our summer watching <a href=\"http://www.belcourt.org/events?categories=Repertory%20Films&amp;id=75890\" target=\"_blank\">Road Movies of the 70&#x2019;s and 80&#x2019;s</a> (look out, <em>Pee Wee&#x2019;s Big Adventure</em>).</p>\n<p>That just scratches the surface of what the Belcourt&#x2019;s got up their sleeves for summer. They&#x2019;ll also be showing <a href=\"http://www.belcourt.org/events?id=75763\" target=\"_blank\">the films of Elizabeth Taylor on weekends in June/July</a>, and a <a href=\"http://www.belcourt.org/events?categories=First%20Run%20Films\" target=\"_blank\">bunch more June First Run Films</a> &#x2013; <em>I Am</em>, <em>Queen of the Sun</em>, <em>Incendies</em>, and&#xA0;<em>Memphis Heat</em>.</p>\n<p>But back to the freebies. The Belcourt&#x2019;s annual Second Saturday Outdoor Cinema film series is like a grittier (literally &#x2013; it&#x2019;s in the parking lot) version of the Scene&#x2019;s <a href=\"http://nashvillest.com/2011/05/10/movies-in-the-park-2011-lineup-includes-500-days-of-summer-harry-potter-ferris-buellers-day-off-more/\" target=\"_blank\">Movies in the Park</a>, and we&#x2019;d probably pay to go even if it wasn&#x2019;t free (nobody tell the Belcourt). We know you guys love freebies just as much as we do, so we&#x2019;ve got that full schedule below the cut. For all the rest, follow one of the many links to&#xA0;<a href=\"http://www.belcourt.org/\" target=\"_blank\">Belcourt.org</a> in this post.</p>\n<p><em>Photo by </em><a href=\"http://www.flickr.com/photos/joelhwilliams/5459906277/\" target=\"_blank\"><em>jhwill</em></a><em>.</em></p>\n<p><span id=\"more-7120\"></span></p>\n<p><strong>Saturday, June 11th &#x2013; Sunset 8:03pm<br>\n</strong><em>The Blues Brothers (</em><em>Dir. John Landis, USA, 1980, 133min, Rated R)</em><br>\nJohn Belushi and Dan Akroyd stars as Jake and Elwood Blues, two scheming brothers on a mission from God: to get the band back together in order to save the Catholic home where they were raised. THE&#xA0;BLUES&#xA0;BROTHERS kicks off the Outdoor Cinema in rollicking style! Featuring Aretha Franklin, Ray Charles, Cab Calloway, John Lee Hooker and James Brown as an inquisitive show-stopping preacher. Have you seen the light? You will.</p>\n<p><strong>Saturday, July 9th &#x2013; Sunset 8:07pm<br>\n</strong><em>Destry Rides Again (Dir. George Marshall, USA, 1939, 94min)<br>\n</em> Tom Destry (James Stewart) is a tough lawman who doesn&#x2019;t like guns. And that could pose a problem when a saloon owner and a corrupt mayor plan to rob the local cowpokes blind, with the help of crooked waitress Frenchy (Marlene Dietrich). Dietrich hits a career peak with her rendition of &#x201C;See What the Boys in the Back Room Will Have.&#x201D; When sparks fly between her and Destry, there&#x2019;s no doubt they&#x2019;ll be riding off happily into the sunset.</p>\n<p><strong>Saturday, August 13th &#x2013; Sunset 7:40pm<br>\n</strong><em>Wargames&#xA0;(Dir. John Badham, USA, 1983, 114min)<br>\n</em>&#x201C;Would you like to play a game?&#x201D; &#x2013; It&#x2019;s floppy disks and phone-modem hackery as we relive a classic summer movie of the 80&#x2019;s. After cracking the security of an Air Force supercomputer, young whiz kid David Lightman (Matthew Broderick) opens a seemingly innocent video game which is actually a program intended to mount a preemptive nuclear strike. Driven by Cold War paranoia, this techno-thriller follows Lightman and his girlfriend (Ally Sheedy) as they travel across the country to try and warn the military of the impending launch. Also starring Dabney Coleman and Barry Corbin.</p>\n<p><strong>Saturday, September 10th &#x2013; Sunset 7:02pm<br>\n</strong><em>Psycho (Dir. Alfred Hitchcock, USA, 1960, 109min)<br>\n</em>We&#x2019;ve managed to squeeze a Hitchcock in just about every Outdoor Cinema season in the last 7 years or so, and we&#x2019;ve saved the closing slot for the master&#x2019;s most legendary shocker. When larcenous real estate clerk Marion Crane (Janet Leigh) goes on the lam with a wad of cash and hopes of starting a new life, she ends up at the Bates Motel, where twitchy manager and taxidermist Norman Bates (Anthony Perkins) cares for his housebound mother. The place seems quirky but fine &#x2026; until Marion takes a shower.</p>"
}