{
 "id": 1670,
 "name": "its-showtime-presales-free-shows-and-steve-martin-with-a-banjo-only-in-nashville",
 "title": "It&#x2019;s Showtime: Presales, Free Shows And Steve Martin With A Banjo [Only In Nashville]",
 "author": "Morgan Levy",
 "date": "2009-04-02T09:43:00-05:00",
 "tags": [
  "coldplay opener",
  "death cab for cutie 2nd nashville",
  "death cab for cutie presale",
  "elvis costello presale",
  "free show",
  "grand ole opry",
  "grimey&apos;s",
  "keith urban presale",
  "lightning 100",
  "metallica presale",
  "mutemath",
  "phil vassar",
  "record store day",
  "snow patrol",
  "steve martin",
  "the avett brothers",
  "ti rites of spring"
 ],
 "categories": [],
 "excerpt": "There’s a lot of big-name acts coming through Nashville in the coming weeks. It seems like today is the day for presales, too – We’ve got Elvis Costello, Keith Urban and another round of Death Cab For Cutie tickets going on sale today, and a Metallica presale tomorrow. But along with the presales, this week has also been heavy with big announcements of other music-related stuff. Here’s a quick rundown of concert news & info: Keith Urban with Sugarland presale […]",
 "contentEncoded": "<p style=\"text-align: center;\"><img class=\"aligncenter\" src=\"http://i43.tinypic.com/2s67s6t.jpg\" alt=\"\" width=\"428\" height=\"368\"></p>\n<p>There&#x2019;s a lot of big-name acts coming through Nashville in the coming weeks. It seems like today is the day for presales, too &#x2013; We&#x2019;ve got Elvis Costello, Keith Urban and another round of Death Cab For Cutie tickets going on sale today, and a Metallica presale tomorrow. But along with the presales, this week has also been heavy with big announcements of other music-related stuff. Here&#x2019;s a quick rundown of concert news &amp; info:</p>\n<ul>\n<li><strong>Keith Urban with Sugarland </strong>presale tickets go on sale <strong>today at 10am </strong>for the August 29 show at the Sommet Center. The presale password is <strong>ESCAPE</strong>, and you can use it to <a href=\"http://www.ticketmaster.com/event/1B00427A772A2CE0?artistid=821096&amp;majorcatid=10001&amp;minorcatid=2\" target=\"_blank\">get tickets here</a>.</li>\n<li><strong>Death Cab For Cutie</strong> added a 2nd show at the Ryman after selling out their May 4 date. The new show is May 3, and presale tickets go on sale <strong>today at 10am</strong>. <a href=\"http://lightning100.com/\" target=\"_blank\">Lightning 100 has the password</a> and ticket link.</li>\n<li><strong>Elvis Costello </strong>is playing the Ryman on June 16, and <a href=\"http://lightning100.com/\" target=\"_blank\">Lightning 100 can also hook you up</a> with that presale password and ticket link, <strong>today at 10am</strong>.</li>\n<li><strong>Metallica </strong>presale tickets go on sale <strong>Friday at 10am</strong> for their September 14 show at the Sommet Center. The presale password is <strong>ONE</strong>, and you can use it to <a href=\"http://www.ticketmaster.com/event/1B0042797F7037AA?artistid=735647&amp;majorcatid=10001&amp;minorcatid=200\" target=\"_blank\">get tickets here</a>.</li>\n<li><strong>Phil Vassar </strong>is playing a free show on April 10 outside the Hard Rock Cafe around 10:30pm. So far, <a href=\"http://musiccitytv.com/2009/03/31/word-is-phil-vassar-to-play-free-outdoor-show-april-10/\" target=\"_blank\">reports have been tentative</a>, but let&#x2019;s just say we&#x2019;re very confident that this is going to happen.</li>\n<li><strong>Steve Martin </strong>(yes, that Steve Martin) will be <a href=\"http://www.newschannel5.com/global/story.asp?s=10106363\" target=\"_blank\">playing the Opry on May 30</a>, along with Vince Gill, Amy Grant, Stuart Duncan, Tim O&#x2019;Brien and John McEuen of the Nitty Gritty Dirt Band. Um, we&#x2019;re pretty excited about this.</li>\n<li><a href=\"http://www.nashvillecitypaper.com/news.php?viewStory=67190\" target=\"_blank\"><strong>T.I.</strong> will be playing Rites of Spring</a> on April 17, before he heads to the pen. At least one Nashvillest editor will be there. You can take your best guess as to which one it will be.</li>\n<li><a href=\"http://grimeys.com/news.html\" target=\"_blank\">Grimey&#x2019;s has announced a killer lineup for Record Store Day</a> on April 18, including free outdoor performances by <strong>The Avett Brothers</strong> and <strong>MuteMath</strong>. We&#x2019;re already trying to figure out where we&#x2019;re going to park.</li>\n<li><strong>Snow Patrol </strong>has been announced as the opener for <a href=\"http://nashvillest.com/2009/03/12/coldplay-announces-june-6-nashville-show/\" target=\"_blank\"><strong>Coldplay</strong>&#x2018;s June 6 show at the Sommet Center</a>. We&#x2019;re not really sure if anyone cares, but we thought we&#x2019;d fill you in anyway.</li>\n</ul>\n<p><em>Thanks to C. Sledge for a couple presale tips! </em></p>"
}