{
 "id": 5905,
 "name": "chihuly-at-cheekwood-gets-encore-free-day-comings-goings",
 "title": "Chihuly At Cheekwood Gets Encore, Free Day [Comings &amp; Goings]",
 "author": "Morgan Levy",
 "date": "2010-10-20T15:00:00-05:00",
 "tags": [
  "cheekwood",
  "chihuly",
  "comings &amp; goings",
  "freebies"
 ],
 "categories": [],
 "excerpt": "You’ve waited until the last two weeks of Chihuly at Cheekwood to check out the incredible, mind-blowing glass scultures of Dale Chihuly, and the rest of your October calendar is already filled with all sorts of pumpkin carvings, corn mazes, concerts and a spooky event or two. What to do?! The kind folks at Cheekwood took pity on the many of us in Nashville who have a nasty habit of procrastinating, and announced an Encore Week for Chihuly at Cheekwood […]",
 "contentEncoded": "<p style=\"text-align: center;\"><a href=\"http://www.flickr.com/photos/tncountryfan/5026514008/\" target=\"blank\"><img class=\"aligncenter\" src=\"http://farm5.static.flickr.com/4133/5026514008_cd0d894485.jpg\" alt=\"\"></a></p>\n<p>You&#x2019;ve waited until the last two weeks of <a href=\"http://www.cheekwood.org/Art/Chihuly_at_Cheekwood.aspx\" target=\"_blank\">Chihuly at Cheekwood</a> to check out the incredible, mind-blowing glass scultures of Dale Chihuly, and the rest of your October calendar is already filled with all sorts of pumpkin carvings, corn mazes, concerts and a spooky event or two. What to do?! The kind folks at Cheekwood took pity on the many of us in Nashville who have a nasty habit of procrastinating, and announced an <a href=\"http://www.cheekwood.org/Art/Chihuly_at_Cheekwood.aspx\" target=\"_blank\">Encore Week for Chihuly at Cheekwood from November 2-7.</a> Chihuly will stay put for an extra week, and they&#x2019;re even giving us the 2nd as a free &#x201C;thanks to the community&#x201D; day!</p>\n<p>Cheekwood will be free and open to the public on Tuesday, November 2 from 9am-4:30pm. If you want to see Chihuly at night, you&#x2019;ll still have to pony up the big bucks ($15 for adults, $12 for students and seniors, $8 for kids). Chihuly Nights continue on November 3, 4, 5 and 6 until 10pm, and the final day of the exhibit is 11am-4:30pm Sunday, November 7.</p>\n<p>Who&#x2019;s going with us?</p>\n<p><em>Photo by <a href=\"http://www.flickr.com/photos/tncountryfan/5026514008/\" target=\"_blank\">tncountryfan</a>.</em></p>"
}