{
 "id": 5172,
 "name": "bright-early-friends-in-need-edition",
 "title": "Bright &amp; Early: Friends In Need Edition",
 "author": "Christy Frink",
 "date": "2010-06-11T10:30:00-05:00",
 "tags": [
  "buffalo",
  "bull",
  "butch spyridon",
  "cmapocalypse 2010",
  "cmt",
  "fema",
  "gaylord",
  "karl dean",
  "landslide",
  "lane kiffin",
  "las vegas",
  "mount olivet cemetery",
  "mudslide",
  "naomi judd",
  "nashville convention &amp; visitors bureau",
  "nashville flood",
  "opryland",
  "second harvest food bank",
  "smithfield foods",
  "tsu atlanta",
  "university of tennessee",
  "usc"
 ],
 "categories": [],
 "excerpt": "Good morning, Nashville. Today in CMA news (which is the only kind of news there is), Mayor Dean hopped on the stage at last night’s concert at LP Field and thanked everyone for coming to Nashville despite our mess and helping us get back on our feet. Almost as heartwarming as the Mayor’s speech was the outpouring of donations from both CMT and Smithfield Foods, Inc., who gave $40,000 and 150,000 servings of ham respectively to the Second Harvest Food […]",
 "contentEncoded": "<p style=\"text-align: center;\"><a href=\"http://www.flickr.com/photos/blueshoe/4689543100/in/pool-nashvillest\"><img class=\"aligncenter\" src=\"http://farm5.static.flickr.com/4011/4689543100_fabf497439.jpg\" alt=\"\" width=\"416\" height=\"263\"></a></p>\n<p style=\"text-align: left;\">Good morning, Nashville. Today in CMA news (which is the only kind of news there is), <a href=\"http://www.wkrn.com/global/story.asp?s=12633693\" target=\"_blank\">Mayor Dean hopped on the stage at last night&#x2019;s concert at LP Field and thanked everyone for coming to Nashville despite our mess and helping us get back on our feet</a>. Almost as heartwarming as the Mayor&#x2019;s speech was the <a href=\"http://www.wkrn.com/global/story.asp?s=12632307\" target=\"_blank\">outpouring of donations from both CMT and Smithfield Foods, Inc., who gave $40,000 and 150,000 servings of ham respectively to the Second Harvest Food Bank</a>. On the not-so-happy front, <a href=\"http://www.tennessean.com/article/20100611/NEWS01/6110345/-1/RSS05\" target=\"_blank\">40 CMAers have been treated for heat emergencies</a>; if you&#x2019;re going to be out and about this week, remember to take (and chug) plenty of water!</p>\n<ul>\n<li><strong>That&#x2019;s bull. </strong>A <a href=\"http://www.newschannel5.com/global/story.asp?s=12631867\" target=\"_blank\">13-year old bull named Moses is on the loose after being washed away from his home at TSU during the flood</a>. No one really knows how the 1,400-lb. animal made it all the way in Bordeaux in the rushing water, but some theorize that he swam. TSU is working on luring him into a trailer so he can go back to TSU, but they might need some help from the Nashville Zoo since they don&#x2019;t want to sedate him because of his age. This reminds us: <a href=\"http://blogs.knoxnews.com/silence/archives/2010/05/tennessee_where_1.shtml\" target=\"_blank\">Did we ever find out what happened to Naomi Judd&#x2019;s buffalo</a>?</li>\n<li><span style=\"font-size: 13.2px;\"><strong>Et tu, Atlanta?</strong> Butch Spyridon, head of the Nashville Convention &amp; Visitors Bureau, is calling out Las Vegas and Atlanta for poaching our convention business. <a href=\"http://www.nashvillescene.com/nashville/nashville-floods-and-las-vegas-and-atlanta-waste-no-time-in-poaching-our-convention-business-classy-did-your-mothers-raise-you-in-a-strip-m/Content?oid=1606233\" target=\"_blank\">Some of the conventions that were supposed to be held at Opryland have been moved to the other cities after representatives allegedly amped up efforts to lure them away from Nashville before Gaylord even had the chance to assess the damage</a>. Spyridon said it was &#x201C;B.S.&#x201D; and that it would likely come back to bite them in the end. Also, big props to the Future Business Leaders of America, who are bending over backwards to keep their convention in town.</span></li>\n<li><strong>Bits &amp; pieces</strong>. The <a href=\"http://www.newschannel5.com/global/story.asp?s=12630987\" target=\"_blank\">historic Mount Olivet Cemetery is in some trouble</a> after suffering a hefty amount of flood damage &#x2026; Along with the rest of the UT fans in Tennessee, <a href=\"http://www.tennessean.com/article/20100611/SPORTS0601/100611002/-1/RSS05\" target=\"_blank\">we sure hope Lane Kiffin is enjoying his time at USC</a>, who was just given a two-year bowl ban&#xA0;&#x2026; Folks whose homes were damaged by mudlides and landslides during the flood <a href=\"http://www.tennessean.com/article/20100611/NEWS0202/6110349/-1/RSS05\" target=\"_blank\">aren&#x2019;t getting much help from FEMA</a>.</li>\n</ul>\n<p style=\"text-align: left;\"><em>Photo by </em><a href=\"http://www.flickr.com/photos/blueshoe/4689543100/in/pool-nashvillest\" target=\"_blank\"><em>Jon Erickson</em></a><em>.</em></p>"
}