{
 "id": 1460,
 "name": "for-real-this-time-bye-bye-circuit-city-comings-goings",
 "title": "(For Real This Time) Bye Bye, Circuit City [Comings &amp; Goings]",
 "author": "Morgan Levy",
 "date": "2009-01-16T12:28:00-06:00",
 "tags": [
  "bankrupt",
  "bellevue",
  "circuit city",
  "cool springs",
  "liquidation",
  "madison"
 ],
 "categories": [],
 "excerpt": "We lost a couple of our local Circuit City stores at the end of last year, but it looks like the rest of them will be following. Reports are pouring in from pretty much everywhere that state that Circuit City has filed for court approval to liquidate its remaining 567 stores. That means we can wave goodbye to our remaining three stores in Bellevue, Cool Springs and Madison. Liquidation sales are scheduled to begin Saturday, but watch out! Last time […]",
 "contentEncoded": "<p style=\"text-align: center;\"><img class=\"aligncenter\" src=\"http://farm4.static.flickr.com/3242/3136350335_3b45b24bb1.jpg\" alt=\"\"></p>\n<p>We lost a couple of our local Circuit City stores at the <a href=\"http://nashvillest.com/2008/11/03/bye-bye-circuit-city-comings-goings/\" target=\"_blank\">end of last year</a>, but it looks like the rest of them will be following. Reports are pouring in from pretty much everywhere that state that Circuit City has filed for court approval to liquidate its remaining 567 stores. That means we can <a href=\"http://money.cnn.com/2009/01/16/news/companies/circuit_city/index.htm?postversion=2009011611\" target=\"_blank\">wave goodbye to our remaining three stores</a> in Bellevue, Cool Springs and Madison.</p>\n<p>Liquidation sales are scheduled to begin Saturday, but watch out! Last time they liquidated, some <a href=\"http://consumerist.com/5104893/circuit-city-liquidator-doubles-list-price-before-taking-50-off\" target=\"_blank\">shoppers noticed a little bait &amp; switch</a> going on with the prices. Liquidators have been known to go so far as to double the original price on some items before they slap a 30% discount on it. Let the buyer beware!</p>\n<p>If we have to be honest, we really aren&#x2019;t going to miss Circuit City one bit. The selection and service have left quite a bit to be desired for several years now. But this is putting a lot of folks out of a job at a time when a job is what they need the most, and for that, we&#x2019;re very disappointed.</p>\n<p><em>Photo by <a href=\"http://flickr.com/photos/shelleproductions/3136350335/\" target=\"_blank\">shellEProductions</a>.</em></p>"
}