{
 "id": 1570,
 "name": "truck-comes-complete-with-two-strips-of-rawhide-gems-from-the-nashville-craigslist",
 "title": "Truck Comes Complete With Two Strips Of Rawhide [Gems From The Nashville Craigslist]",
 "author": "Morgan Levy",
 "date": "2009-03-02T09:46:00-06:00",
 "tags": [
  "gems from the nashville craigslist",
  "manly man",
  "redneck",
  "truck for sale"
 ],
 "categories": [],
 "excerpt": "Dealerships take note, THIS is how you sell a truck. (Disclaimer: May be mildly offensive to some, but nothing that will make your eyes bleed.) Thanks to Nathan T. for the tip! 1979 Chevy Truck!! OH MY GOD! THIS TRUCK IS AWESOME! – $6000 (EAST NASHVILLE) OK, let me start off by saying this Silverado is only available for purchase by the manliest of men (or women). My friend, if it was possible for a vehicle to sprout chest hair […]",
 "contentEncoded": "<p>Dealerships take note, THIS is how you sell a truck. (Disclaimer: May be mildly offensive to some, but nothing that will make your eyes bleed.) <em>Thanks to <a href=\"http://twitter.com/nathanrtaylor/status/1260171304\" target=\"_blank\">Nathan T. </a>for the tip! </em></p>\n<p style=\"text-align: center;\"><img class=\"aligncenter\" src=\"http://i41.tinypic.com/155mqh4.jpg\" alt=\"\"></p>\n<p><em></em></p>\n<h3><a href=\"http://nashville.craigslist.org/cto/1050147572.html\" target=\"_blank\">1979 Chevy Truck!! OH MY GOD!  THIS TRUCK IS AWESOME! &#x2013; $6000 (EAST NASHVILLE)</a></h3>\n<p>OK, let me start off by saying this Silverado is only available for purchase by the manliest of men (or women). My friend, if it was possible for a vehicle to sprout chest hair and a five o&#x2019;clock shadow, this Brute of a Chevy would look like Tom Selleck. It is just that manly.</p>\n<p>It was never intended to drive to the mall so you can pick up that adorable shirt at Abercrombie &amp; Fitch that you had your eye on. It wasn&#x2019;t meant to transport you to yoga class or Linens &amp; Things. No, that&#x2019;s what your Prius is for. If that&#x2019;s the kind of truck you&#x2019;re looking for, then just do us all a favor and stop reading right now. I mean it. Just stop.</p>\n<p><span id=\"more-1570\"></span></p>\n<p>This truck was engineered by ELITE American Truck Specialists to serve the needs of the man that cheats death on a daily basis. Made when a truck was built for a REAL man. Back before the times of superfluous nancy boy amenities like navigation systems (real men don&#x2019;t get lost), heated leather seats (a real man doesn&#x2019;t let anything warm his butt), or On Star (real men don&#x2019;t even know what On Star is) and if the technology HAD been around, they wouldn&#x2019;t have put that limp-wristed crap in this baby!.</p>\n<p>No, this brute comes with the things us testosterone-fueled super action junkies need. It has a 400 BIG BLOCK engine to outrun the cops (OR out pull). It&#x2019;s got a special blood/gore resistant seat cover. It even has a first-aid kit in the back. You know what the first aid kit has in it? A pint of whiskey, a stitch-your-own-wound kit and a hunk of leather to bite down on when you&#x2019;re operating on yourself. The Silverado also has an automatic transmission so if you&#x2019;re being chased by Libyan terrorists, you&#x2019;ll still be able to shoot your machine gun out the split window and drive at the same time. It&#x2019;s saved my bacon more than once. This crowning achievement of Detroit also has TWO fuel tanks, for those long runs in the middle of nowhere, with nothing but you and your truck for miles. The bed has been sprayed with protective coating. Rust never had the balls to even consider eating on this stud, you just wont find it.</p>\n<p>It has room for you and the two hotties you picked up on the way to the gym to blast your pecs and hammer your glutes. There&#x2019;s a tow hitch to pull your 50 caliber anti-Taliban, self cooling machine gun. It also has something that is so hard to find (and damn important when you need it if you know what i mean) LARGE BENCH SEAT in PERFECT condition with a seat cover to protect it from love or any carnage that may come your way.</p>\n<p>My price on this bad boy is an incredibly low $6000, but I&#x2019;ll entertain reasonable offers. And by reasonable, I mean don&#x2019;t walk up and tell me you&#x2019;ll give me $4,000 for it. That&#x2019;s liable to earn you a Burmese-roundhouse-sphincter-kick with a follow up three fingered eye-jab . Would it hurt? Hell yeah. Let&#x2019;s just say you won&#x2019;t be the prettiest guy at the Coldplay concert anymore.</p>\n<p>There&#x2019;s only 70,000 ORIGINAL miles on this four-wheeled hellcat from Planet Kickass. Trust me, it will outlive you and the offspring that will carry your name. It will live on as a monument to your machismo.</p>\n<p>Now, go look in the mirror and tell me what you see. If it&#x2019;s a rugged, no holds barred, super brute he-man macho Chuck Norris stunt double, then contact me. I might be out hang-gliding or BASE jumping or just chilling with my ladies, but I&#x2019;ll get back to you. And when I do, we&#x2019;ll talk about a price over a glass of Kentucky Bourbon while listening to Johnny Cash.</p>\n<p>To sweeten the deal a little, I&#x2019;m throwing in two strips of rawhide. I wrap these around my wrists as bracers to keep my hands on the wheel when have to control this monster. Use them for what ever you feel fit, i&#x2019;m just making a suggestion.</p>\n<p>Rock on.</p>"
}