{
 "id": 1930,
 "name": "this-weekend-miss-martha-gets-crankin-a-little-earlier-this-year",
 "title": "This Weekend: Miss Martha Gets Crankin&#x2019; A Little Earlier This Year",
 "author": "Morgan Levy",
 "date": "2009-06-12T13:38:00-05:00",
 "tags": [
  "competition",
  "contest",
  "ice cream social",
  "miss martha&apos;s ice cream crankin",
  "purity dairy",
  "purity flavors",
  "purity ice cream",
  "southwest airlines"
 ],
 "categories": [],
 "excerpt": "It may come as a surprise to hear that the annual community ice cream social is this weekend, unless you’ve seen the signs posted around town. It’s like Ice Cream Christmas came early this year! Formerly in August, Purity’s 24th annual Miss Martha’s Ice Cream Crankin’ will be the same event we know and love, just a few months earlier than usual. Hundreds of ice cream concoctions will be served up and voted upon by the general public (and a panel [...]",
 "contentEncoded": "<p style=\"text-align: center;\"><img class=\"aligncenter\" src=\"http://i41.tinypic.com/2j17nyg.jpg\" alt=\"\" width=\"400\" height=\"200\"></p>\n<p>It may come as a surprise to hear that the annual community ice cream social is this weekend, unless you&#x2019;ve seen the signs posted around town. It&#x2019;s like Ice Cream Christmas came early this year! Formerly in August, Purity&#x2019;s 24th annual&#xA0;<a href=\"http://www.marthaobryan.org/html/crankin.php\" target=\"_blank\">Miss Martha&#x2019;s Ice Cream Crankin&#x2019;</a> will be the same event we know and love, just a few months earlier than usual. Hundreds of ice cream concoctions will be served up and voted upon by the general public (and a panel of judges), and the winning flavor will become an official Purity flavor sold in stores (along with some free Southwest Airlines tickets).&#xA0;</p>\n<p>Tickets to the Ice Cream Crankin&#x2019; are $13 ($7 for kids) and they include more ice cream samples than you could ever possibly consume. If you wish to enter the competition, <a href=\"http://www.marthaobryan.org/html/Crankin09/contest.php\" target=\"_blank\">click here for rules &amp; regulations</a>, and show up between 2-3pm on Sunday! If you&#x2019;re just an ice cream fan or a wandering Nashvillian looking for something interesting to do, the Crankin&#x2019; goes down from 4pm-6pm, followed by a concert from Ashley Cleveland from 6pm-7pm. <em>First Presbyterian Church, 4815 Franklin Road</em>.&#xA0;</p>"
}