{
 "id": 299,
 "name": "sob-stories-hey-georgia-leave-copperhill-alone",
 "title": "Sob Stories: Hey Georgia, Leave Copperhill Alone",
 "author": "Christy Frink",
 "date": "2008-06-04T15:04:00-05:00",
 "tags": [
  "copperhill",
  "fannin county",
  "georgia",
  "Nashville",
  "tennessee",
  "water crisis"
 ],
 "categories": [],
 "excerpt": "Over the past few months, we’ve all become pretty well acquainted with Georgia’s crazy attempts to run off with a chunk of our state because they’re running out of water or something. We’ve become so desensitized to such state-on-state violence that we forget what all is at stake. Thankfully the Tennessean brought the plight of one Tennessee town to our attention yesterday. Copperhill, Tennessee is an Appalachian community that sits near the border between the motherland and Georgia, and all […]",
 "contentEncoded": "<p style=\"text-align: center;\"><a href=\"http://www.flickr.com/photos/crashmattb/2507139365/in/pool-nashvillest\" target=\"_blank\"><img class=\"size-full wp-image-300\" title=\"2507139365_d332146f43\" src=\"http://nashvillest.com/wp-content/uploads/2008/06/2507139365_d332146f43.jpg\" alt=\"\" width=\"500\" height=\"500\"></a></p>\n<p>Over the past few months, we&#x2019;ve all become pretty well acquainted with Georgia&#x2019;s crazy attempts to run off with a chunk of our state because they&#x2019;re running out of water or something. We&#x2019;ve become so desensitized to such state-on-state violence that we forget what all is at stake. Thankfully the <em>Tennessean</em> brought the plight of <a href=\"http://www.tennessean.com/apps/pbcs.dll/article?AID=/20080603/NEWS05/80603014/-1/RSS05\" target=\"_blank\">one Tennessee town</a> to our attention yesterday.</p>\n<p>Copperhill, Tennessee is an Appalachian community that sits near the border between the motherland and Georgia, and all they really want to do is drink. See, if Georgia ends up getting their way and seizes part of Tennessee, Copperhill will become part of Fannin County, GA, and Fannin County is a dry county. That means that Copperhill residents would have to drive at least 40 miles to find a functional bar.</p>\n<p>We understand they&#x2019;re pretty upset. There are 500 people in that town, and they need their watering holes.</p>\n<p>Brothers and sisters of Copperhill: Nashvillest is committed to fighting the injustice, and we want you to know you&#x2019;re welcome up here anytime. We&#x2019;ve got your back.</p>\n<p><em>Photo by <a href=\"http://www.flickr.com/photos/crashmattb/2507139365/in/pool-nashvillest\" target=\"_blank\">crashmattb</a>.</em></p>"
}