{
 "id": 1444,
 "name": "the-green-wagon-nashvilles-first-green-general-store",
 "title": "The Green Wagon: Nashville&#x2019;s First &#x201C;Green&#x201D; General Store",
 "author": "Morgan Levy",
 "date": "2009-01-14T11:00:00-06:00",
 "tags": [
  "carbon footprint",
  "environmentally friendly",
  "general store",
  "green",
  "local",
  "recycle",
  "sylvan park",
  "the green wagon"
 ],
 "categories": [],
 "excerpt": "Entrepreneur Jennifer Casale is opening what she calls “Nashville’s first green general store” this Friday in Sylvan Park, and we’re loving the idea. We love the idea of a neighborhood general store, and we love it even more for being sustainable and environmentally friendly. And Jen herself is the real deal – She even drives a station wagon that runs on the waste vegetable oil from local restaurants.  The Green Wagon will house a classic collection of general store merchandise, […]",
 "contentEncoded": "<p><a href=\"http://nashvillest.com/wp-content/uploads/2009/01/final-logo-2.jpg\"><img class=\"aligncenter size-full wp-image-1445\" title=\"final-logo-2\" src=\"http://nashvillest.com/wp-content/uploads/2009/01/final-logo-2.jpg\" alt=\"\" width=\"500\" height=\"210\"></a></p>\n<p>Entrepreneur Jennifer Casale is opening what she calls &#x201C;Nashville&#x2019;s first green general store&#x201D; this Friday in Sylvan Park, and we&#x2019;re loving the idea. We love the idea of a neighborhood general store, and we love it even more for being sustainable and environmentally friendly. And Jen herself is the real deal &#x2013; She even drives a station wagon that runs on the waste vegetable oil from local restaurants.&#xA0;</p>\n<blockquote><p>The Green Wagon will house a classic collection of general store merchandise, with everything from cleaning supplies to clothing to shampoo to crib mattresses. The store will feature a &#x201C;refilling station&#x201D; where customers can refill their bottles with certain products at a discounted price, instead of buying new containers. A large portion of the products in The Green Wagon inventory are made locally, therefore reducing the business&#x2019; and customers&#x2019; carbon footprint that would normally occur during the shipping process. Since the notion of &#x201C;green&#x201D; is relatively new and somewhat undefined, Jen uses a standardized assessment that will evaluate products based on their environmental footprint across the product&#x2019;s lifecycle stages.  This standard purchasing process will give The Green Wagon customers peace of mind and allow them the freedom to walk in and feel confident about any item they purchase. The Green Wagon hopes that defining its standards of &#x201C;green&#x201D; will simplify and enhance the shopping experience for customers.</p>\n</blockquote>\n<p><a href=\"http://profile.myspace.com/index.cfm?fuseaction=user.viewProfile&amp;friendID=209499966\" target=\"_blank\">The Green Wagon</a> is located at 4429 Murphy Road and opens this Friday. It will be open from 10am-7pm every day. While you&#x2019;re down there, stop at the <a href=\"http://www.produceplace.com/v3/\" target=\"_blank\">Produce Place</a> and grab some local produce. We&#x2019;re definitely jealous of Sylvan Park right now.&#xA0;</p>"
}