{
 "id": 1733,
 "name": "spins-top-indie-record-stores-in-the-country-grimeys-makes-the-cut",
 "title": "SPIN&#x2019;s Top Indie Record Stores In The Country: Grimey&#x2019;s Makes The Cut",
 "author": "Morgan Levy",
 "date": "2009-04-17T19:40:00-05:00",
 "tags": [
  "best independent record stores",
  "grimey&apos;s",
  "record store day",
  "spin magazine"
 ],
 "categories": [],
 "excerpt": "We love Grimey’s, and SPIN does too! In honor of Record Store Day tomorrow, SPIN magazine picked their top 15 favorite independent record stores in the United States, and not only did Grimey’s make the top 15 cut, they made it into the top 10 at number 8! Here’s what SPIN has to say about Grimey’s:   Why It Rocks: Five years ago, Grimey’s Records outgrew their space and moved into its current stylized, three-pedimented building, which it shares with Thirty […]",
 "contentEncoded": "<p style=\"text-align: center;\"><img class=\"aligncenter\" src=\"http://farm4.static.flickr.com/3002/2368645585_385149d0dc.jpg\" alt=\"\"></p>\n<p>We love Grimey&#x2019;s, and <a href=\"http://www.spin.com/blog/americas-15-best-indie-record-stores?page=0%2C2\" target=\"_blank\">SPIN does too</a>! In honor of <a href=\"http://nashvillest.com/2009/04/16/saturday-grimeys-record-store-day/\" target=\"_blank\">Record Store Day</a> tomorrow, SPIN magazine picked their top 15 favorite independent record stores in the United States, and not only did Grimey&#x2019;s make the top 15 cut, they made it into the top 10 at number 8! Here&#x2019;s what SPIN has to say about Grimey&#x2019;s:</p>\n<blockquote><p>&#xA0;</p>\n<p><strong>Why It Rocks:</strong>&#xA0;Five years ago, Grimey&#x2019;s Records outgrew their space and moved into its current stylized, three-pedimented building, which it shares with Thirty Tigers music marketing and distribution upstairs and popular venue the Basement downstairs. Grimey&#x2019;s is definitely the meat of this sandwich, with an amazingly broad selection (for its size), very affordable prices, and history as a stalwart of indie cool in a town that&#x2019;s known for a very different kind of music scene.</p>\n<p><strong>Fans Say:</strong>&#xA0;&#x201C;Best store in Nashville (that doesn&#x2019;t deal exclusively in country music). They&#x2019;ve got a real good selection of new/used vinyl, indie and import CDs, DVDs, and books. And they probably do some of the best in-stores anywhere. Pound for pound, it&#x2019;s one of the best in the country.&#x201D; &#x2014; Bob Mehr (music writer,&#xA0;<em>The Commercial Appeal</em>)</p>\n<p>&#xA0;</p></blockquote>\n<p>Congratulations Grimey&#x2019;s, and well-earned, we say.&#xA0;</p>\n<p><em>Photo by </em><a href=\"http://www.flickr.com/photos/studiomobile/2368645585/\" target=\"_blank\"><em>StudioMobile</em></a><em>.</em></p>"
}