{
 "id": 2781,
 "name": "duck-duck-who-the-silly-goose-entering-eastland-nashville-newcomers",
 "title": "Duck, Duck, Who? The Silly Goose Lands On Eastland [Nashville Newcomers]",
 "author": "Morgan Levy",
 "date": "2009-09-24T17:30:00-05:00",
 "tags": [
  "east nashville",
  "eastland ave",
  "fresh blends",
  "the silly goose"
 ],
 "categories": [],
 "excerpt": "We’re pretty jealous of East Nashville these days, as we watch creative new dining options pop up everywhere we turn our eyes. Moving into the recently vacated Fresh Blends building on Eastland Ave is yet another one of said creative new dining options: The Silly Goose. From the name, it’s not immediately obvious that The Silly Goose will serve a to-go menu of fresh, healthy, locally-sourced gourmet foods. Owner Roderick Bailey wants to create a fun community atmosphere while serving […]",
 "contentEncoded": "<p><img class=\"alignnone\" style=\"margin: 5px;\" src=\"http://i36.tinypic.com/i6a0ya.png\" alt=\"\" width=\"400\" height=\"241\"></p>\n<p>We&#x2019;re pretty jealous of East Nashville these days, as we watch creative new dining options pop up everywhere we turn our eyes. Moving into the <a href=\"http://nashvillest.com/2009/08/18/fresh-blends-exits-east-comings-goings/\" target=\"_blank\">recently vacated Fresh Blends building</a> on Eastland Ave is yet another one of said creative new dining options: The Silly Goose.</p>\n<p>From the name, it&#x2019;s not immediately obvious that The Silly Goose will serve a to-go menu of fresh, healthy, locally-sourced gourmet foods. Owner Roderick Bailey wants to create a fun community atmosphere while serving the best food possible, and will include unique options such as soda from fresh homemade syrups, homemade ice cream, and an extensive menu of couscous. All meals are priced in the $8-12 range.</p>\n<p>A bit of &#x201C;silly&#x201D; is sprinkled throughout the entire venture, from the witty monikers for menu items that include &#x201C;Goose Juice&#x201D; and a &#x201C;Hot Johnson&#x201D; sandwich to the interior mural &#x2013; not surprisingly, featuring a goose &#x2013; painted by local artists.</p>\n<p>The Silly Goose plans to begin serving up its artisan sandwiches, wraps, salads and couscous by October 13&#x2026; You can probably guess where we&#x2019;ll be that night.</p>"
}