{
 "id": 7083,
 "name": "bright-early-big-hearts-big-money-edition",
 "title": "Bright &amp; Early: Big Hearts, Big Money Edition",
 "author": "Morgan Levy",
 "date": "2011-05-09T10:00:00-05:00",
 "tags": [],
 "categories": [],
 "excerpt": "Good morning, Nashville. We’re a year removed from historic flooding in Nashville, but tensions are rising as some people question why more of the donated money for flood victims has not yet been distributed. Metro Councilman Bo Mitchell says that the Community Foundation of Middle Tennessee has over $4 million in undistributed donations that should be going to help flood victims who are still struggling to rebuild. Community Foundation president Ellie Lehman says that some funds have been reserved for […]",
 "contentEncoded": "<p><a href=\"http://www.flickr.com/photos/denisemattox/5701807067/in/pool-715021@N24/\" target=\"blank\"><img class=\"aligncenter\" src=\"http://farm4.static.flickr.com/3342/5701807067_8871bc9bee.jpg\" alt=\"\"></a></p>\n<p>Good morning, Nashville. We&#x2019;re a year removed from historic flooding in Nashville, but tensions are rising as some people question why more of the donated money for flood victims has not yet been distributed. <a href=\"http://www.tennessean.com/article/20110508/NEWS/305080020/2275/rss05\" target=\"_blank\">Metro Councilman Bo Mitchell says that the Community Foundation of Middle Tennessee has over $4 million in undistributed donations that should be going to help flood victims who are still struggling to rebuild</a>. Community Foundation president Ellie Lehman says that some funds have been reserved for long-term recovery, and joins other nonprofit leaders in saying that it has been difficult to identify who needs the funds.</p>\n<p>A new case management system called the Flood Recovery Network will hopefully close the gap between those with the money and flood victims in need, and charitable organizations who raised flood funds are required by a new law to report how the funds were spent to the&#xA0;Secretary of State&#x2019;s Office. The Community Foundation also stays accountable to the public through their <a href=\"http://www.cfmtfloodresponse.org/where-the-money-is-going/\" target=\"_blank\">Flood Response website</a>, where they have been posting breakdowns of flood funds and grants distributed for several months now.</p>\n<ul>\n<li><strong>T. Swifty shines again</strong>. We&#x2019;re kind of in awe of Taylor Swift at this point. Whether it&#x2019;s signing autographs for 13 hours or <a href=\"http://www.wkrn.com/story/14596092/taylor-swifts-final-tour-rehearsal-to-benefit-tornado-victims\" target=\"_blank\">opening her final tour rehearsal at the Bridgestone Arena to 13,000 fans to raise money for the southeastern US states devastated by tornadoes in recent weeks</a>, is there anything this girl doesn&#x2019;t do? The open rehearsal, dubbed &#x201C;Speak Now&#x2026; Help Now&#x201D; will be May 21, and ticket information should be released today at <a href=\"http://www.taylorswift.com/news\" target=\"_blank\">taylorswift.com</a>.</li>\n<li><strong>Hanging on</strong>. <a href=\"http://www.wkrn.com/story/14595732/preds-return-to-music-city-after-win-over-vancouver\" target=\"_blank\">The Preds triumphed over the Canucks on Saturday night, closing Game 5 at 4-3</a> (in regulation time, no less!), and they&#x2019;re bringing the battle back home. A win for the Preds in tonight&#x2019;s game will settle the series at 3-3 and force a Game 7. Our fingers and toes are crossed for you, boys.</li>\n<li><strong>Gettin&#x2019; toasty</strong>. After temperatures last week in the 30&#x2019;s, <a href=\"http://nashvillewx.com/2011/05/feeling-like-summer-the-next-three-days/\" target=\"_blank\">we&#x2019;ll be seeing high 80&#x2019;s and 90&#x2019;s in the first half of this week</a>, potentially setting another record high. We aren&#x2019;t packing up our sweaters again though.</li>\n<li><strong>Bits &amp; pieces</strong>. <a href=\"http://www.wkrn.com/story/14587576/13-year-cicadas-emerge-in-middle-tenn\" target=\"_blank\">They&#x2019;re heeeeeeeeere</a> &#x2026;&#xA0;<a href=\"http://www.tennessean.com/article/20110508/NEWS08/305080089/2275/RSS05\" target=\"_blank\">Gas prices are expected to drop</a> by up to 50 cents in the coming weeks, hooray! &#x2026;&#xA0;Someone on the Shelby Street Pedestrian Bridge spotted a&#xA0;<a href=\"http://www.wsmv.com/news/27815195/detail.html\" target=\"_blank\">human body floating in the Cumberland</a> this past weekend &#x2026; <a href=\"http://www.tennessean.com/article/20110509/NEWS04/305090031/2275/RSS05\" target=\"_blank\">Trevecca is raising chickens</a> to provide eggs for the campus and the surrounding neighborhoods.</li>\n</ul>\n<p><em>Photo by </em><a href=\"http://www.flickr.com/photos/denisemattox/5701807067/in/pool-715021@N24/\" target=\"_blank\"><em>niseag03</em></a><em>. </em></p>"
}