{
 "id": 7804,
 "name": "check-out-new-exhibits-at-the-frist-centers-free-egypt-family-day",
 "title": "Check Out New Exhibits At The Frist Center&#x2019;s Free Egypt Family Day",
 "author": "Morgan Levy",
 "date": "2011-10-13T13:00:00-05:00",
 "tags": [
  "egypt",
  "free admission",
  "freebies",
  "frist center"
 ],
 "categories": [],
 "excerpt": "This weekend is your chance to check out one of the newest exhibits at the Frist Center – To Live Forever: Egyptian Treasures from the Brooklyn Museum – for free! The Frist will host a free Family Day on Sunday, and in keeping with the Egypt theme, there will be Egyptian storytelling, music and folk dancing. Round out the day by making an amulet, trying on a pharaoh’s headdress, sculpting a mummy has, going on an archeology dig or sailing […]",
 "contentEncoded": "<p><a href=\"http://nashvillest.com/wp-content/uploads/2011/10/Egypt-Sarcophagus-700x450.jpg\"><img class=\"size-full wp-image-7805 aligncenter\" title=\"Egypt-Sarcophagus-700x450\" src=\"http://nashvillest.com/wp-content/uploads/2011/10/Egypt-Sarcophagus-700x450.jpg\" alt=\"\" width=\"490\" height=\"315\"></a></p>\n<p>This weekend is your chance to check out one of the newest exhibits at the <a href=\"http://fristcenter.org/\" target=\"_blank\">Frist Center</a> &#x2013; <em>To Live Forever: Egyptian Treasures from the Brooklyn Museum </em>&#x2013; for free! The Frist will host a free Family Day on Sunday, and in keeping with the Egypt theme, there will be Egyptian storytelling, music and folk dancing. Round out the day by making an amulet, trying on a pharaoh&#x2019;s headdress, sculpting a mummy has, going on an archeology dig or sailing a reed boat down the Nile. If you&#x2019;re curious about the new exhibits or just wondering how on earth you&#x2019;re going to sail a reed boat down the Nile in a museum in Nashville, TN, you should probably check it out.</p>\n<p><strong>Egypt Family Day at the Frist Center, Sunday, October 16 from 1-5:30pm, free</strong>.</p>"
}