{
 "id": 1476,
 "name": "captain-ds-introduces-irefusetoceaseanddesistcom",
 "title": "Captain D&#x2019;s Introduces IRefuseToCeaseAndDesist.com",
 "author": "Morgan Levy",
 "date": "2009-01-22T11:13:00-06:00",
 "tags": [
  "captain d&apos;s",
  "cease and desist",
  "free t-shirts",
  "irefusetoceaseanddesist.com",
  "prices",
  "red lobster",
  "seafood"
 ],
 "categories": [],
 "excerpt": "You may have previously been unaware that Captain D’s is a Nashville-based company, but boy, are we proud of them right now! Anyway, Captain D’s is having a little wrestling match with that OTHER seafood chain over some advertising that compares their prices to that OTHER seafood chain’s (hint:  Starts with “Red” and ends with “Lobster”) prices. That OTHER seafood chain send Captain D’s a cease-and-desist letter, to which our feisty hometown friends have responded: Well, we’re not going to […]",
 "contentEncoded": "<p style=\"text-align: center;\"><img class=\"aligncenter\" src=\"http://i39.tinypic.com/x1lfd3.jpg\" alt=\"\"></p>\n<p>You may have previously been unaware that Captain D&#x2019;s is a Nashville-based company, but boy, are we proud of them right now! Anyway, Captain D&#x2019;s is having a little wrestling match with that OTHER seafood chain over some advertising that compares their prices to that OTHER seafood chain&#x2019;s (hint:&#xA0; Starts with &#x201C;Red&#x201D; and ends with &#x201C;Lobster&#x201D;) prices. That OTHER seafood chain send Captain D&#x2019;s a cease-and-desist letter, to which our feisty hometown friends have <a href=\"http://www.captainds.com/irefusetoceaseanddesist/\" target=\"_blank\">responded</a>:</p>\n<blockquote><p><em>Well, we&#x2019;re not going to Cease and Desist, and we hope you&#x2019;ll join us by visiting irefusetoceaseanddesist.com, where you can watch our response to Red Lobster&#x2019;s Cease and Desist letter. And the first 1,000 visitors also get a free &#x201C;I Refuse to Cease and Desist&#x201D; t-shirt. Wear it with jeans, wear it with slacks, but most importantly, wear it with pride. For more information, visit <a href=\"http://www.irefusetoceaseanddesist.com/\" target=\"_new\">http://www.irefusetoceaseanddesist.com</a> or <a href=\"http://www.captainds.com/\" target=\"_new\">http://www.captainds.com</a>.</em></p></blockquote>\n<p>Unfortunately, we missed the boat on the first 1,000 t-shirts. But we&#x2019;re proud of these locals for being innovative, bold and for jumping at the chance for a great marketing schtick. Way to go, Captain D&#x2019;s!</p>\n<p><a href=\"http://www.irefusetoceaseanddesist.com\" target=\"_blank\">IRefuseToCeaseAndDesist.com</a><br>\n(via <a href=\"http://business.nashvillepost.com/2009/01/20/captain-ds-has-competitor-seeing-red-over-ad/\" target=\"_blank\">Post Business</a>)</p>"
}