{
 "id": 1523,
 "name": "fiction-family-at-the-belcourt-on-january-30-guest-posts",
 "title": "Fiction Family At The Belcourt On January 30 [Guest Posts]",
 "author": "Morgan Levy",
 "date": "2009-02-09T15:46:00-06:00",
 "tags": [
  "belcourt theatre",
  "fiction family",
  "jon foreman",
  "nickel creek",
  "sean watkins",
  "switchfoot"
 ],
 "categories": [],
 "excerpt": "Guest post by our friend Jon Arnold. Jon has been a guest blogger for Nashvillest in the past, writing about CREMA’s Coffee Classes. I found out I had tickets to the Fiction Family show about two hours before it started.  I collected my wife and hurried over to the Belcourt, where I found a few co-workers (music business people) standing in line to get in.  We exchanged some pleasantries, discovered I was on the meet-and-greet list, and headed inside. As […]",
 "contentEncoded": "<div style=\"text-align: center;\"><img class=\"aligncenter\" src=\"http://farm2.static.flickr.com/1370/3267821232_8206809864.jpg\" alt=\"\"></div>\n<div></div>\n<div><em>Guest post by our friend <a href=\"http://www.fruittreemusic.com/\" target=\"_blank\">Jon Arnold</a>. Jon has been a guest blogger for Nashvillest in the past, writing about <a href=\"http://nashvillest.com/2008/10/01/crema-coffee-classes-guest-posts/\" target=\"_blank\">CREMA&#x2019;s Coffee Classes</a>. </em></div>\n<div></div>\n<div>I found out I had tickets to the Fiction Family show about two hours before it started. &#xA0;I collected my wife and hurried over to the Belcourt, where I found a few co-workers (music business people) standing in line to get in. &#xA0;We exchanged some pleasantries, discovered I was on the meet-and-greet list, and headed inside.</div>\n<div></div>\n<div>As the show started I realized I had seen Thad Cockrell once before, for a label showcase my wife&#x2019;s company had put on. &#xA0;He&#x2019;s great, really; a hometown mixture of country &#x2014; REAL country, mind you &#x2014; and some deeply complex lyrics about love. &#xA0;Basically, he&#x2019;s comprised of a lot of what&#x2019;s right with music in this town.</div>\n<div></div>\n<div>He performed a short but respectable set with a competent group of musicians behind him. &#xA0;The crowd was familiar, polite, but were really there to see Fiction Family; you could start to feel the anticipation in the room growing. &#xA0;Between sets we stood talking up friends for a while, but quickly quieted down when the theatre lights dimmed.</div>\n<div></div>\n<div>When Jon Foreman, Sean Watkins, and the rest of the band entered the stage, Foreman smiled and greeted the audience with, &#x201C;Hello! Tonight we are your Fictional Family!&#x201D;</div>\n<div></div>\n<div>It was true: that night, we did not watch Jon Foreman deliver epic rock anthems from the stage, or Sean Watkins perform brooding, heartfelt bluegrass. Instead, we saw smiling, affable musicians just up there having a good time and not worrying about impressing us, the crowd.</div>\n<div></div>\n<div>Their set was tight, with a musical ability that was nothing short of effortless, and yet it never felt like we were watching a &#x201C;show.&#x201D; &#xA0;It really did feel like we were watching someone play songs with some friends in a living room, especially during the point in the set when Foreman invited the crowd up on the stage.</div>\n<div></div>\n<div>With people seated all around them, Fiction Family played a well-rounded set of their own material (including a Nickel Creek song and a solo Foreman tune) and a slew of covers. &#xA0;We heard some Radiohead, Arcade Fire, but the true culmination was Sean&#x2019;s solo cover of &#x201C;Pink Triangle&#x201D;, a song about unrequited lesbian love by Weezer. &#xA0;Foreman sat on the ground and just chuckled through the whole tune, which Watkins played totally straight-faced.</div>\n<div></div>\n<div>Fiction Family&#x2019;s music is light, sure, but the content of the songs can be pretty intense. &#xA0;Twice, Foreman made light of that fact by asking the crowd to give it up for the topic of the song:</div>\n<div></div>\n<div></div>\n<div>&#x201C;Let&#x2019;s hear it for murder!!&#x201D; &#x2026;which later gave way to, &#x201C;Let&#x2019;s hear it for the darkest day of your life!&#x201D;</div>\n<div></div>\n<div>They always carried a little half-smile about everything, despite the fact that this Sean-Jon pair seems really quite world weary and worn. Keep in mind they&#x2019;re both barely thirty and have been performing music professional nearly half their lives; a project like this must be a welcome relief.</div>\n<div></div>\n<div>After performing most of their album, they closed their set with their single, &#x201C;When She&#x2019;s Near&#x201D;, a great amalgamation of their distinctly different styles. &#xA0;Their encore was quality and ended with the album closer, &#x201C;Look For Me Baby,&#x201D; a rollicking bluegrass tune played on a banjolin. &#xA0;And then, just like that, it was over. &#xA0;The band bowed and left the stage, and everyone on the stage just sort of got up and started walking towards the exit.</div>\n<div></div>\n<div>My wife and I met up with our friends and walked into the precarious Belcourt basement, where a sweaty and grinning Foreman explained how glad he was to have so much fun on stage. He loved pulling some of the crowd up there with him and felt that it was such a great change of pace. &#xA0;Watkins was busy getting things ready to leave and never stayed still, similar to how he behaved on stage (I could not get a clear photo of that guy for anything!).</div>\n<div></div>\n<div>Overall, the show was totally not what I expected: two guys known for their emotionally charged music get up on stage and have a good time for two hours. That being said, it&#x2019;s obvious the emotion is still there, mostly in the form of the lyrics. &#xA0;As we left and braved the cold night, the words of their songs is what bounced around in my head. Some of these songs betray their upbeat nature and point to severe emotional strife; I mean, just look at these lines from &#x201C;War in My Blood&#x201D;:</div>\n<div></div>\n<div><em>My baby&#x2019;s soft and sweet, somewhere between a flower and a gun</em></div>\n<div><em>Where my girl is now, someday that&#x2019;s where I want to be from</em></div>\n<div><em>But love is a dollar that&#x2019;s already spent, love is a song that we&#x2019;ve sung</em></div>\n<div><em>There&#x2019;s war in my blood, love ain&#x2019;t the tune in my lungs</em></div>\n<div><em>So here&#x2019;s my consolation:</em></div>\n<div><em>It takes two to go to war, and only one to fall in love.</em></div>\n<div></div>\n<div><em>Photo (and more <a href=\"http://www.flickr.com/photos/nashvillest/sets/72157613565115792/\" target=\"_blank\">here</a>) by Jon Arnold. </em></div>"
}