{
 "id": 7314,
 "name": "food-truck-bites-happy-eating-riffs-fine-street-food-barbie-burgers-bangin-tacos",
 "title": "Food Truck Bites: Happy Eating, Riff&#x2019;s, Barbie Burgers, Bangin&#x2019; Tacos",
 "author": "Morgan Levy",
 "date": "2011-06-08T12:00:00-05:00",
 "tags": [
  "bangin tacos",
  "barbie burgers",
  "fish tacos",
  "food trucks",
  "happy eating",
  "riff&apos;s fine street food",
  "street food"
 ],
 "categories": [],
 "excerpt": "We’re not sure how it happened, but we managed to eat from food trucks all weekend long. It probably had something to do with Food Network Canada’s Eat Street taping here in town, but even before that we spent our Friday night hopping from brewery to food truck to brewery to food truck. Here’s a few quick “bites” about some of Nashville’s newest food trucks. Happy Eating Happy Japan’s Happy Eating food truck opened less than two weeks ago, but […]",
 "contentEncoded": "<p><a href=\"http://nashvillest.com/wp-content/uploads/2011/06/photo_500.jpg\"><img class=\"size-full wp-image-7323 aligncenter\" title=\"photo_500\" src=\"http://nashvillest.com/wp-content/uploads/2011/06/photo_500.jpg\" alt=\"\" width=\"500\" height=\"373\"></a></p>\n<p>We&#x2019;re not sure how it happened, but we managed to eat from food trucks all weekend long. It probably had something to do with <a href=\"http://nashvillest.com/2011/06/03/nashville-eats-on-the-teevee-eat-street-taping-this-weekend-man-vs-food-airs-next-week/\" target=\"_blank\">Food Network Canada&#x2019;s </a><em><a href=\"http://nashvillest.com/2011/06/03/nashville-eats-on-the-teevee-eat-street-taping-this-weekend-man-vs-food-airs-next-week/\" target=\"_blank\">Eat Street</a></em><a href=\"http://nashvillest.com/2011/06/03/nashville-eats-on-the-teevee-eat-street-taping-this-weekend-man-vs-food-airs-next-week/\" target=\"_blank\"> taping here in town</a>, but even before that we spent our Friday night hopping from brewery to food truck to brewery to food truck. Here&#x2019;s a few quick &#x201C;bites&#x201D; about some of Nashville&#x2019;s newest food trucks.</p>\n<p><strong>Happy Eating</strong></p>\n<p><a href=\"http://nashvillest.com/2011/05/27/happy-eating-happy-japan-debuts-japanese-food-truck-tonight-in-five-points/\" target=\"_blank\">Happy Japan&#x2019;s Happy Eating food truck opened less than two weeks ago</a>, but it&#x2019;s already making the rounds like a seasoned pro. You won&#x2019;t be able to miss the eye-catching truck parked around town. On our first trip we tried just a few snacks &#x2013; curry fries, gyoza and mochi. The curry fries had a great subtle curry flavor, if a bit overly-salty and a little lukewarm. The vegetable gyoza were average, and mochi&#x2026; Well, mochi is mochi (a Japanese ice cream novelty). Did we mention that our first trip was on their first night in business? We&#x2019;ll cut &#x2019;em some slack!</p>\n<p>Hence the second trip. The second time around we ordered full meals, which turned out to be exactly the right choice. Our Japanese rice burgers (slider-style hamburgers with sticky rice patties for buns) just might have been life changing, and they came with an ample amount of curry fries for $8. Our Japanese curry over rice was generously portioned for $6 and came topped with two cute little carrot flowers. The curry flavor was mild, but otherwise delicious. Happy Eating&#x2019;s service is also lightning fast &#x2013; we&#x2019;d hardly signed our credit card receipt before the food was packed up and handed to us in convenient take out containers.</p>\n<p>Yes, we said &#x201C;credit card receipt.&#x201D; The best thing about Happy Eating is that they&#x2019;re currently the only food truck we know of that takes credit cards (UPDATE: We hear that Pizza Buds and The Latin Wagon also take cards). Seriously, Nashville&#x2019;s food trucks need to get on the <a href=\"https://squareup.com/\" target=\"_blank\">Square bandwagon</a> pronto.</p>\n<p>Find Happy Eating&#x2019;s location on Twitter at @<a href=\"http://twitter.com/#!/Happy_Eating\" target=\"_blank\">Happy_Eating</a>.</p>\n<p><strong>Riff&#x2019;s Fine Street Food</strong></p>\n<p><a href=\"http://nashvillest.com/2011/05/05/riffs-fine-street-food-crafts-creative-caribbean-asian-flavors-on-wheels/\" target=\"_blank\">We had high expectations for the debut of Riff&#x2019;s after chatting with owner BJ Lofback about a month ago</a>. An ever-changing menu of &#x201C;fine street food&#x201D;? Count us in. Over three trips, we&#x2019;ve sampled just about everything on the menu, and it all gets an A+ from us. Chef Carlos Davis hails from Barbados, and his authentic jerk seasoning on just about anything would make us happy. Riff&#x2019;s signature jerk chicken dish comes wrapped in flatbread and topped with a bright fruit salsa, and is accompanied by red beans and coconut rice. The fish tacos are a twist on the usual fish taco, but still delicious &#x2013; Heavily spiced shredded fish topped with a fresh slaw and accompanied, again, by those red beans and rice. All dishes are $6-10 (at the upper end, you get a combo of them all). Perhaps the best decision we made was topping off our meals with honey ginger tea and &#x201C;conkies,&#x201D; a dessert made of pumpkin, sweet potato, coconut and topped with caramel, wrapped up and ready to go in a banana leaf. Hungry yet?</p>\n<p>Find Riff&#x2019;s Fine Street Food&#x2019;s location on Twitter at @<a href=\"http://twitter.com/#!/riffstruck\" target=\"_blank\">riffstruck</a>.</p>\n<p><strong>Barbie Burgers</strong></p>\n<p>Nashville&#x2019;s burger truck opened quietly without fanfare, but this weekend we found out that we&#x2019;d waited far, far too long to try it out. As we wandered through the Eat St. taping on Sunday, we heard person after person raving about their burgers and shakes. The menu is surprisingly inventive &#x2013; We tried the Hounddog, which was a bacon cheeseburger with peanut butter on it. Weird, but awesome. And the burgers are great, but the milkshakes could bring us to Barbie Burgers on their own. Whew.</p>\n<p>Find Barbie Burgers&#x2019; location on Twitter at @<a href=\"http://twitter.com/#!/barbieburgers\" target=\"_blank\">BarbieBurgers</a>.</p>\n<p><strong>Bangin&#x2019; Tacos</strong></p>\n<p>Okay, so maybe we went to Bangin&#x2019; Tacos with a chip on our shoulder about trendy taco trucks (nothing can be as good as Mas Tacos, right?). Maybe we gasped at the $4/taco price tag. And maybe we begged the food gods for forgiveness after we had our first Bangin&#x2019; Taco. Totally worth the $4, the Cajun spiced fish taco was a dinner-sized filet of tilapia that could barely be contained in the flour tortilla it was served in. The cajun seasoning was packing some serious heat, but the slaw and crumbles of queso fresco cooled it down perfectly. It took quite a while to receive our taco, but it was worth the wait.</p>\n<p>Find Bangin&#x2019; Tacos&#x2019; location on Twitter at @<a href=\"http://twitter.com/#!/bangintacos\" target=\"_blank\">BanginTacos</a>.</p>\n<p><strong>Coming Soon&#x2026;</strong></p>\n<p>We also tried a new food truck that&#x2019;s coming soon called the Love Shack. The food was great, the bus is a must-see, and you can expect to hear more from us about the Love Shack soon.</p>"
}