{
 "id": 1551,
 "name": "you-think-we-dont-do-paparazzi-in-nashville-kings-of-leon-beg-to-differ",
 "title": "You Think We Don&#x2019;t Do Paparazzi In Nashville? Kings Of Leon Beg To Differ",
 "author": "Morgan Levy",
 "date": "2009-02-20T15:01:00-06:00",
 "tags": [
  "kings of leon",
  "nicole kidman",
  "paparazzi",
  "stalkers"
 ],
 "categories": [
  "Music City"
 ],
 "contentEncoded": "<p>Nicole Kidman often waxes poetic about how <a href=\"http://nashvillest.com/2008/11/24/keith-nicole-remind-us-why-were-awesome-aw-shucks/\" target=\"_blank\">she loves Nashville</a> because no one bothers her here, but Kings of Leon seem to have a different viewpoint on the subject of living as celebrities in Nashville. <a href=\"http://www.spin.com/articles/kings-leon-are-being-stalked\" target=\"_blank\">SPIN</a> reports on a recent interview done with <a href=\"http://www.thesun.co.uk/sol/homepage/showbiz/bizarre/article2247393.ece\" target=\"_blank\">The Sun</a>:</p>\n<blockquote>\n<p class=\"article\"><em>&#x201C;It&#x2019;s getting crazy going home to Nashville now. I&#x2019;m having to sell my house because they&#x2019;ve put it on some celebrity homes&#x2019;  map. There are kids from the UK who go to Nashville and leave me presents.  My cousin, who looks after the house, hides them from me &#x2014; he said I&#x2019;d be  scared. The other day I was there and left the house for a second, and when I got  back there were four playing cards, four kings, with all of our names on  them in the door. There is an apartment complex across the street and there are people renting  the place out and watching&#x2026; We&#x2019;ve got a farm in the middle of nowhere. It&#x2019;s so hard to find. But we pulled up and by the mailbox were two girls in go-go boots, little  outfits, just waiting.&#x201D; </em></p>\n</blockquote>\n<p class=\"article\">Well, well, well, Kings of Leon. Leave it to you to bring the crazies to town. Thanks for all you&#x2019;ve done for our city.</p>\n\n\n\n\n<p>No related posts.</p>\t\t\t\t\t\t\t\t\t\t\t<!--END .entry-content .article-->"
}