{
 "id": 3716,
 "name": "happy-hour-fire-in-the-hole",
 "title": "Happy Hour: Fire In The Hole",
 "author": "Christy Frink",
 "date": "2010-01-22T18:12:00-06:00",
 "tags": [
  "american animal hospital association",
  "cumberland river",
  "michael wall",
  "music city center",
  "nashville fire department",
  "nashville technology council",
  "sewanee",
  "sgt. ballz",
  "steve ballmer",
  "tornado",
  "water main break"
 ],
 "categories": [],
 "excerpt": "Since several downtown fire hydrants are out of commission following that disastrous series of water main breaks a few weeks back, the Nashville Fire Department has set up temporary camp by Riverfront Park so they can tap into the Cumberland to fight any fires that might arise. Here’s hoping that whatever pollutants are in the Cumberland aren’t flammable! [WSMV] A kitty named Sgt. Ballz strutted into the Nashville Airport today fresh off the plane from Washington, DC and before that, […]",
 "contentEncoded": "<div style=\"text-align: center;\"><a href=\"http://www.flickr.com/photos/7653512@N03/4288320145/in/pool-nashvillest\"><img class=\"alignnone\" src=\"http://farm5.static.flickr.com/4030/4288320145_9b7c52d7d8.jpg\" alt=\"\" width=\"375\" height=\"500\"></a></div>\n<ul>\n<li>Since several downtown fire hydrants are out of commission following that disastrous series of water main breaks a few weeks back, the Nashville Fire Department has set up temporary camp by Riverfront Park so they can tap into the Cumberland to fight any fires that might arise. Here&#x2019;s hoping that whatever pollutants are in the Cumberland aren&#x2019;t flammable! [<a href=\"http://www.wsmv.com/news/22316288/detail.html\" target=\"_blank\">WSMV</a>]</li>\n<li>A kitty named Sgt. Ballz strutted into the Nashville Airport today fresh off the plane from Washington, DC and before that, Iraq. Members of the Tennessee National Guard rescued the feline from a military base that was going to close and now Sgt. Ballz will live happily ever after in Smyrna with his best friend, Staff Sgt. Michael Wall. [<a href=\"http://www.wkrn.com/global/story.asp?s=11866177\" target=\"_blank\">WKRN</a>]</li>\n<li>Some blessed soul went to the Nashville Tech Council&#x2019;s annual meeting at Trevecca on Wednesday and had Microsoft CEO Steve Ballmer sign his Mac. The video then made its way around the web and we are Very Proud to see Nashville represented on the internet in such a way. [<a href=\"http://www.nashvilleistalking.com/2010/01/microsoft-ceo-steve-ballmer-signs-a-macbook-in-nashville/\" target=\"_blank\">Nashville Is Talking</a>]</li>\n<li>The American Animal Hospital Association has committed to holding its 2014 and 2018 conferences at the new Music City Center, making it one of the first booked events for the center. [<a href=\"http://www.wkrn.com/global/story.asp?s=11862845\" target=\"_blank\">WKRN</a>]</li>\n<li>And thanks to tipster Matthew S. for pointing us to <a href=\"http://www.picturestoryblog.com/2010/01/tornado-sewanee-tennessee-using-the-camera-you-have.html\" target=\"_blank\">another impressive/terrifying shot of yesterday&#x2019;s tornado</a> in Sewanee!</li>\n</ul>\n<p><em>Photo by </em><a href=\"http://www.flickr.com/photos/7653512@N03/4288320145/in/pool-nashvillest\" target=\"_blank\"><em>jodestick</em></a><em>.</em></p>"
}