{
 "id": 7224,
 "name": "happy-eating-happy-japan-debuts-japanese-food-truck-tonight-in-five-points",
 "title": "Happy Eating: Happy Japan Debuts Japanese Food Truck Tonight In Five Points",
 "author": "Morgan Levy",
 "date": "2011-05-27T13:00:00-05:00",
 "tags": [
  "food trucks",
  "happy eating",
  "happy japan",
  "japanese food",
  "street food"
 ],
 "categories": [],
 "excerpt": "Get ready for yet another addition to Nashville’s rapidly growing food truck scene. If all goes well at final inspection (Update: it did), “yummy Japanese food” purveyor Happy Eating will hit the streets tonight in East Nashville’s Five Points around 5 or 6pm. Tomorrow they’ll be parked at Happy Japan in Berry Hill before a repeat evening performance in Five Points, and from there on out you can keep tabs on their location via Twitter. Our eyes went wide at [...]",
 "contentEncoded": "<p><a href=\"http://nashvillest.com/wp-content/uploads/2011/05/happy_eating.jpg\"><img class=\"size-full wp-image-7225 aligncenter\" title=\"Happy Eating Japanese Street Food\" src=\"http://nashvillest.com/wp-content/uploads/2011/05/happy_eating.jpg\" alt=\"\" width=\"450\" height=\"249\"></a></p>\n<p>Get ready for yet another addition to Nashville&#x2019;s rapidly growing food truck scene. If all goes well at final inspection (Update: it did), &#x201C;yummy Japanese food&#x201D; purveyor <a href=\"http://happy-eating-happy-japan.blogspot.com/\" target=\"_blank\"><strong>Happy Eating</strong></a> will hit the streets tonight in East Nashville&#x2019;s Five Points around 5 or 6pm. Tomorrow they&#x2019;ll be parked at Happy Japan in Berry Hill before a repeat evening performance in Five Points, and from there on out you can <a href=\"https://twitter.com/#!/Happy_Eating\" target=\"_blank\">keep tabs on their location via Twitter</a>.</p>\n<p>Our eyes went wide at Happy Eating&#x2019;s menu, which reads more like an authentic Japanese restaurant menu than a food truck. You&#x2019;ll be able to order Japanese rice burgers with curry fries, Japanese curry, Udon, Onigiri, Gyoza, Dango, Japanese crepes, ice cream mochi and lots of fun drinks from the brightly colored cartoonish truck. They promise us that all of their food is &#x201C;really yummy.&#x201D; <a href=\"http://nashvillest.com/wp-content/uploads/2011/05/20110527-071350.jpg\">Click here</a> for a peek at the regular menu, and expect off menu specials as well. </p>\n<p>Happy Eating&#x2019;s mothership &#x2013; <a href=\"http://www.happyjapan.net/index.php\" target=\"_blank\"><strong>Happy Japan</strong></a> &#x2013; recently reopened in Berry Hill after being tucked away in an awkward location on Gallatin Road for the past year. Check out their new space at 2817 Bransford Avenue for fun Japanese novelty toys, kitchen equipment and cookbooks, snacks and drinks, anime, fun classes (sushi making, anyone?) and more. It&#x2019;s been one of our favorite secret places to shop, but now that they&#x2019;re in a bigger location with a truck rolling around town, we just can&#x2019;t keep it to ourselves any longer.</p>\n<p><em>Photo from <a href=\"http://happy-eating-happy-japan.blogspot.com/\" target=\"_blank\">Happy Japan</a>. </em></p>"
}