{
 "id": 1735,
 "name": "nashville-film-festival-2009-beyond-opening-weekend",
 "title": "Nashville Film Festival 2009: Beyond Opening Weekend",
 "author": "Morgan Levy",
 "date": "2009-04-19T02:08:00-05:00",
 "tags": [
  "naff09",
  "nashville film festival"
 ],
 "categories": [],
 "excerpt": "We’ve survived Thursday, Friday and Saturday of the Nashville Film Festival, heavy-hitting days packed full of premieres, red carpet events, Q&A sessions and afterparties. So what’s next? Most of the films have already premiered, which leaves their repeat screenings over the next five days. There are several great reasons to be really excited about not catching the first showing of a film – Namely, it will be less crowded, and there’s a giant audience of pre-screeners out there ready to [...]",
 "contentEncoded": "<p><img class=\"alignleft\" style=\"float: left; margin-left: 5px; margin-right: 5px;\" src=\"http://i39.tinypic.com/2vb7p7m.jpg\" alt=\"\" width=\"200\" height=\"250\"></p>\n<p>We&#x2019;ve survived Thursday, Friday and Saturday of the Nashville Film Festival, heavy-hitting days packed full of premieres, red carpet events, Q&amp;A sessions and afterparties. So what&#x2019;s next? Most of the films have already premiered, which leaves their repeat screenings over the next five days. There are several great reasons to be really excited about not catching the first showing of a film &#x2013; Namely, it will be less crowded, and there&#x2019;s a giant audience of pre-screeners out there ready to tell you if you&#x2019;re about to waste your time and money. We can&#x2019;t claim to be film experts, but from what we&#x2019;ve seen and heard so far in the first three days, these are our picks for Sunday through Thursday. All <a href=\"http://prod1.agileticketing.net/WebSales/Pages/VerboseEventList.aspx?epguid=99c8a21d-1aca-4a6c-b3f8-f94b5122ab67&amp;\" target=\"_blank\">tickets can be purchased online</a> or at the box office, but we STRONGLY recommend advance purchase.</p>\n<p style=\"text-align: center;\"><strong>SUNDAY</strong></p>\n<p><strong><em>That Evening Sun</em></strong>. 12:15pm. Academy Award nominee Hal Holbrook carries this film at age 84, as an aging farmer who refuses to go down without a fight. <em>That Evening Sun</em> received rave reviews at SXSW this year, and its Eastern Tennessee setting makes it feel like home. [<a href=\"http://www.thateveningsun.com/\" target=\"_blank\">more...</a>]</p>\n<p><em><strong>Sita Sings The Blues</strong></em>. 12:30pm. A delightful animated Hindu story with an equally-delightful soundtrack. And even more delightful, the Creative Commons license that animator Nina Paley has slapped on it, allowing anyone to take the film and share it with friends. [<a href=\"http://www.sitasingstheblues.com/\" target=\"_blank\">more...</a>]</p>\n<p><strong><em>Noble Things</em></strong>. 2:45pm. So &#x201C;Nashville&#x201D; that it hurts, <em>Noble Things</em> tells the story of a country artist struggling to &#x201C;make it in the biz,&#x201D; a tale that we&#x2019;ve seen play out off the screen more times than we&#x2019;d like to count. Michael Parks (of <em>Kill Bill</em> and <em>Grindhouse</em> fame) stars alongside Ryan Hurst, Brett Moses, Dominique Swain, Lee Ann Womack and Tracy Byrd.&#xA0;[<a href=\"http://www.noblethingsmovie.com/\" target=\"_blank\">more...</a>]</p>\n<p><em><strong>House of Numbers</strong></em>. 5:00pm; also showing Thursday at 1pm. From the hands of a young Nashville filmmaker, <em>House of Numbers</em> promises to provide a look at the AIDS &amp; HIV epidemic that most will never have access to.&#xA0;[<a href=\"http://houseofnumbers.com/\" target=\"_blank\">more...</a>]</p>\n<p><strong><em>Films Without Borders: Experimental Shorts</em></strong>. 9:00pm. One can rarely go wrong with a collection of short films, each brief segment of the screening offering something completely different from the next. This particularly interesting-sounding collection features seven shorts from several different countries.</p>\n<p style=\"text-align: center;\"><strong>MONDAY</strong></p>\n<p><strong><em>Prodigal Sons</em></strong>. 1:15pm. As indicated by the standing ovation it received at the first screening on Saturday, <em>Prodigal Sons </em>is a powerfully raw and painfully realistic look at families and relationships. [<a href=\"http://www.prodigalsonsfilm.com/\" target=\"_blank\">more...</a>]</p>\n<p><strong><em>The Other Side Of The Lens</em></strong>. 3:30pm. Salt Lake City television anchor Reed Cowan directs this autobiographical piece documenting the tragic loss of his 4-year-old son, and follows him as he wrestles with being on &#x201C;the other side of the lens.&#x201D; [<a href=\"http://www.wesleysmiles.org/theothersideofthelens/\" target=\"_blank\">more...</a>]</p>\n<p><strong><em>Big River Man</em></strong>. 8:30pm; Also showing Tuesday, 5:30pm. <em>Big River Man</em> documents the feats of&#xA0;Marin Strel, a quirky Slovenian swimmer with some incredible accomplishments to his name. Strel is known for downing two bottles of wine a day, and if that gives any indication of the personality of this movie, we don&#x2019;t want to miss it.</p>\n<p><strong><em>Crossing Borders &#x2013; Shorts</em></strong>. 9:45pm. With a very self-explanatory title, this collection of&#xA0;short films addresses the ins and outs of immigration, and well, &#x201C;crossing borders.&#x201D;</p>\n<p style=\"text-align: center;\"><strong>TUESDAY</strong></p>\n<p><strong><em>Pressure Cooker</em></strong>. 1pm. Follow a group of students enrolled in a Careers Through Culinary Arts program at their inner-city high school in Philadelphia, and see a side of competitive cooking that you won&#x2019;t get from Bobby Flay. [<a href=\"http://www.takepart.com/pressurecooker/\" target=\"_blank\">more...</a>]</p>\n<p><em><strong>Prince Of Broadway</strong></em>. 1:15pm. Set in New York, <em>Prince Of Broadway </em>follows two men&#x2019;s separate, yet intertwined lives.<em> </em>Both are immigrants who skirt around New York&#x2019;s fashion black market, yet both are more than criminals, with complicated family situations.&#xA0;&#xA0;[<a href=\"http://www.princeofbroadway.com/\" target=\"_blank\">more...</a>]</p>\n<p><strong><em>Children Of Invention</em></strong>. 4:45pm. A 2009 Sundance selection, <em>Children Of Invention</em> is bound to be a tear-jerker, as we watch two young immigrant children left to care for themselves when their mother is unable to provide for them. [<a href=\"http://www.childrenofinvention.com/\" target=\"_blank\">more...</a>]</p>\n<p><strong><em>Tennessee Film Night 1 &#x2013; Tennessee Treasures</em></strong>. 6:15pm. Four short documentaries, all with roots in Tennessee. Of notable interest is <em>The Book Lady</em>, a 20-minute documentary on Dolly Parton&#x2019;s Imagination Library.</p>\n<p><strong><em>I&#x2019;m Gonna Explode (Voy a explotar)</em></strong>. 7:30pm. A Mexican film featured at the 2008 New York Film Festival, <em>I&#x2019;m Gonna Explode</em> is a far cry from what you might expect of an American film featuring 15-year-olds in detention. &#xA0;[<a href=\"http://www.voyaexplotar.com/\" target=\"_blank\">more...</a>]</p>\n<p><strong><em>Tennessee Film Night 2: Shorts</em></strong>. 8:45pm. Another bunch of shorts, this time from several Tennessee filmmakers.</p>\n<p><strong><em>Any Day Now</em></strong>. 9:30pm; also showing Wednesday at 1pm. For any Nashvillian, <em>Any Day Now</em> is a must-see, following the Ten Out Of Tenn tour documentary-style as they travel the US, and the familiar faces on the big screen are guaranteed to fill you with pride.</p>\n<p style=\"text-align: center;\"><strong>WEDNESDAY</strong></p>\n<p><strong><em>Crips &amp; Bloods: Made In America</em><span style=\"font-weight: normal;\">. 6pm. The reality of LA gangs, documentary-style. <em>Crips &amp; Bloods</em> hits some pretty difficult points, even attempting to solve the problems of gang culture. From an outsider&#x2019;s perspective, <em>Crips &amp; Bloods </em>is as fascinating as it is educational.&#xA0;[<a href=\"http://www.cripsandbloodsmovie.com/\" target=\"_blank\">more...</a>]</span></strong></p>\n<p><strong><em>Family Ties: Shorts</em></strong>. 8pm. Nearly everyone can identify with family issues, and there&#x2019;s really no better way to address it than to grab the bull by the horn and make a short film about it, right?</p>\n<p><strong><em>Big Man Japan</em></strong>. 10pm. The one constant review of <em>Big Man Japan</em> is that it&#x2019;s weird. Really weird. And we&#x2019;re usually willing to try something weird, especially when critics can&#x2019;t stop singing its praise. So if you&#x2019;re in the mood to try something weird, <em>Big Man Japan</em> is your best bet.</p>\n<p style=\"text-align: center;\"><strong>THURSDAY</strong></p>\n<p><em><strong>Living In Emergency: Stories of Doctors Without Borders</strong></em>. 3:45pm. A documentary on Doctors Without Borders volunteers that includes a native Nashvillian, <em>Living In Emergency</em> is an uncomfortably revealing look into the lives that these volunteers live every day.&#xA0;[<a href=\"http://www.livinginemergency.com/\" target=\"_blank\">more...</a>]</p>\n<p><strong><em>We Live In Public</em></strong>. 6:30pm. If winning the 2009 Sundance Grand Jury Prize isn&#x2019;t convincing enough, a brief glimpse at the synopsis of this film will have you waiting in line immediately. <em>We Live In Public</em> took 10 years to make, and focuses on the bizarre world of the internet, where 10 years can seem more like 100 years.&#xA0;[<a href=\"http://www.weliveinpublicthemovie.com/\" target=\"_blank\">more...</a>]</p>\n<p><strong><em>$5 Cover</em></strong>. 8:30pm. MTV&#x2019;s <em>$5 Cover</em> from Craig Brewer, the director of <em>Hustle &amp; Flow</em>, is actually a television show starring real-life young musicians from Memphis, scrounging to make something of themselves. The screening at the Nashville Film Festival features multiple excerpts from the show. [<a href=\"http://www.mtv.com/fivedollarcover/\" target=\"_blank\">more...</a>]</p>"
}