{
 "id": 1464,
 "name": "collect-those-free-cosmetics-nashville-freebies",
 "title": "Collect Those Free Cosmetics, Nashville [Freebies]",
 "author": "Morgan Levy",
 "date": "2009-01-20T08:00:00-06:00",
 "tags": [
  "class action lawsuit",
  "cosmetics",
  "cosmetics settlement",
  "department stores",
  "dillards",
  "free",
  "freebies",
  "macy&apos;s",
  "malls"
 ],
 "categories": [],
 "excerpt": "Given the big events of today, a trip to the mall may be the last thing on your mind. So we’ll make this short and sweet – Basically, a bunch of department stores are settling a class-action lawsuit today by giving away 175 million dollars in free cosmetic products. You’re a member of the class if you’ve purchased a product from a very long list of cosmetic products between 1994 and 2003. As with all class-action lawsuits, you’re entitled to […]",
 "contentEncoded": "<p style=\"text-align: center;\"><img class=\"aligncenter\" src=\"http://farm1.static.flickr.com/89/205658946_8d5720641e.jpg\" alt=\"\"></p>\n<p>Given the big events of today, a trip to the mall may be the last thing on your mind. So we&#x2019;ll make this short and sweet &#x2013; Basically, a bunch of department stores are settling a class-action lawsuit today by giving away 175 million dollars in free cosmetic products. You&#x2019;re a member of the class if you&#x2019;ve purchased a product from a very long list of cosmetic products between 1994 and 2003. As with all class-action lawsuits, you&#x2019;re entitled to your (tiny) piece of the settlement. Collect by showing up at one of the qualifying stores (Macy&#x2019;s and Dillards, in the Nashville area) and head to the cosmetics department, where you will grab a product valued at $25 for free. You may be asked to sign a form stating that you purchased a covered product between&#xA0;May 29, 1994 and July 16, 2003. And that&#x2019;s it! It&#x2019;s really that simple. [<a href=\"http://consumerist.com/5133811/mark-your-calendars-massive-cosmetics-giveaway-set-for-inauguration-day\" target=\"_blank\">Consumerist</a>, <a href=\"http://www.cosmeticssettlement.com/\" target=\"_blank\">CosmeticsSettlement.com</a>]</p>\n<p><em>Photo by </em><a href=\"http://flickr.com/photos/tzofia/205658946/\" target=\"_blank\"><em>BrittneyBush</em></a><em>.</em></p>"
}