{
 "id": 1665,
 "name": "bright-early-we-kind-of-hate-april-fools-day-edition",
 "title": "Bright &amp; Early: We Kind Of Hate April Fools Day Edition",
 "author": "Christy Frink",
 "date": "2009-04-01T09:32:00-05:00",
 "tags": [
  "april fools day",
  "ash spill",
  "coal ash",
  "congress",
  "driver&apos;s license",
  "eggs",
  "english only",
  "epa",
  "federal funds",
  "gmail",
  "health insurance",
  "joke",
  "mismanagement",
  "mnps",
  "phil bredesen",
  "prank",
  "second harvest",
  "spring",
  "stimulus",
  "tva",
  "uninsured",
  "weather",
  "youtube"
 ],
 "categories": [],
 "excerpt": "Good morning, Nashville! Because we know that the internet is a virtual minefield of obnoxiousness on April Fools Day, we aim to provide a safe haven for you by not actually fooling you at all. That means no rickrolling, no flipping your page upside down (we’re looking at you, Youtube) no making up the news, no ridiculous ha-ha-just-kidding new features (Gmail)–just some straight-up Nashvillest lovin’. And anyway, it’s shaping up to be gorgeous outside today and that sounds like the […]",
 "contentEncoded": "<p style=\"text-align: center;\"><a href=\"http://www.flickr.com/photos/62565854@N00/3383667929/in/pool-nashvillest\" target=\"_blank\"><img class=\"aligncenter\" src=\"http://farm4.static.flickr.com/3574/3383667929_793cdaf100.jpg?v=0\" alt=\"\" width=\"500\" height=\"334\"></a></p>\n<p>Good morning, Nashville! Because we know that the internet is a virtual minefield of obnoxiousness on April Fools Day, we aim to provide a safe haven for you by not actually fooling you at all. That means no rickrolling, no flipping your page upside down (we&#x2019;re looking at you, <a href=\"http://www.youtube.com\" target=\"_blank\">Youtube</a>) no making up the news, no ridiculous ha-ha-just-kidding new features (<a href=\"http://mail.google.com/mail/help/autopilot/index.html\" target=\"_blank\">Gmail</a>)&#x2013;just some straight-up Nashvillest lovin&#x2019;. And anyway, it&#x2019;s shaping up to be gorgeous outside today and that sounds like the perfect opportunity to unplug for a bit and <a href=\"http://nashvillewx.com/2009/04/01/nice-today-storms-tomorrow-2/\" target=\"_blank\">enjoy the weather before it gets gross and stormy tomorrow</a>.</p>\n<ul>\n<li><strong>Mo&#x2019; money mo&#x2019; problems.</strong> If anyone could use a stimulus, it&#x2019;s Metro Nashville Public Schools. Trouble is, they&#x2019;ve got a proven track record of mismanaging federal funds so <a href=\"http://www.nashvillecitypaper.com/news.php?viewStory=67189\" target=\"_blank\">their stimulus money is frozen until they can prove that they won&#x2019;t screw it up</a>.</li>\n<li><strong>We wish we were fooling. </strong>A couple of TVA officials field-tripped to DC yesterday to explain to Congress how their <a href=\"http://www.newschannel5.com/global/story.asp?s=10106981\" target=\"_blank\">multiple toxic sludge spills have actually done a service to the community</a> by highlighting the need for new regulations. Funny!</li>\n<li><strong>Bits &amp; pieces.</strong> 1.7 million (about a third of us) Tennesseans <a href=\"http://www.wkrn.com/global/story.asp?s=10102903\" target=\"_blank\">haven&#x2019;t had health insurance</a> or have lost their health insurance in the past two years &#x2026; Governor Phil will be announcing a <a href=\"http://www.newschannel5.com/global/story.asp?s=10108459\" target=\"_blank\">new initiative to get our infant mortality rates down</a> since we have one of the highest in the nation &#x2026; The Easter bunny <a href=\"http://www.newschannel5.com/global/story.asp?s=10106813\" target=\"_blank\">delivered 144,000 eggs to Second Harvest Food Bank</a> yesterday, donated from some company in Kentucky &#x2026; A bill that would require all driver&#x2019;s license tests <a href=\"http://www.newschannel5.com/global/story.asp?s=10103300\" target=\"_blank\">to be administered in English</a> is one step closer to passing the state Senate.</li>\n</ul>\n<p><em>Photo by <a href=\"http://www.flickr.com/photos/62565854@N00/3383667929/in/pool-nashvillest\" target=\"_blank\">jasonsbytes</a>.</em></p>"
}