{
 "id": 178,
 "name": "gems-from-the-nashville-craigslist",
 "title": "Gems From The Nashville Craigslist: YOU ATE MY CALZONE",
 "author": "Morgan Levy",
 "date": "2008-05-26T11:00:00-05:00",
 "tags": [
  "craigslist",
  "jerk chicken calzone",
  "mellow mushroom",
  "Nashville",
  "nashville craigslist",
  "vanderbilt"
 ],
 "categories": [
  "News"
 ],
 "contentEncoded": "<p>We&#x2019;re back with the second installment of <em>Gems From The Nashville Craigslist</em>, where we sit around all day sifting through the Craigslist personals so you don&#x2019;t have to. This time, we bring you&#x2026; a <em>different</em> kind of personal.</p>\n<blockquote>\n<h3>To the Jerk Chicken Calzone Burglar at Vanderbilt</h3>\n<p>Dear Calzone Burglar,<br>\nPlease Forgive Me&#xE2;&#x20AC;&#xA6;</p>\n<p>Had I known you were hungry for my HALF-EATEN, very tasty, jerk chicken calzone (with special pineapple), I would have gladly helped you sort through the labeled boxes above and below this delectable treat, warm it up in the microwave, cut it into bite-sized pieces, and enjoy at your leisure. Indeed, I would not have eaten half of it, had I known you would be in need later in the day. I would have left the whole shebang just for you to find in your search for unlabeled foodstuffs which you did not place in the fridge. I could just as easily have gone to mellow mushroom, ordered my calzone to go, walked it up the street, and deposited it in the refrigerator for you to find, mistake as yours, and then devour. I apologize.</p>\n<p>Ordinarily, I don&#xE2;&#x20AC;&#x2122;t think many of us find true necessity in the supplementation of our diets with calorie-rich foods. The media of late would have us believe that the calorie hogs among us reside at the root of many global problems. I doubt our societal ills are so easily identified, but I do understand very well that over-consumption is a trend which is out of control and must be curbed. Indeed, my own diet has been recently amended to include more food in order for me to maintain the high level of physical activity necessary in ironman training. I am a profligate eater in the face of hunger around the globe. Lesson learned. I will eat less as soon as I am able. Thank you for so adroitly making this apparent to me. I apologize.</p>\n<p>I shouldn&#xE2;&#x20AC;&#x2122;t expect you to have known my calzone was mine&#xE2;&#x20AC;&#xA6;it was unlabeled, of course, and so you were in the right by taking it. My fault. I know the rules just as well as you do. When you put a foodstuff in the fridge, you should label it as yours. Otherwise it could be mistaken as a half-eaten, very tasty, jerk chicken calzone which someone else put in the fridge and left unlabeled. My trust in the deductive reasoning of a hungry human was (now, so obviously) misplaced (as has been my calzone&#xE2;&#x20AC;&#xA6;it&#xE2;&#x20AC;&#x2122;s in your belly&#xE2;&#x20AC;&#xA6;or your colon by now). Between you and me, the first half gave me a little indigestion. I hope that was not your experience after you ate MY CALZONE. If it was, I apologize.</p>\n<p>I offer my most heartfelt apology to you now. I offer this not because YOU ATE MY CALZONE. That would be stupid. The same as if I would apologize to you after you kicked my dog or gave me bad directions or spit in my media when I wasn&#xE2;&#x20AC;&#x2122;t looking. I offer them because I have a RAGING outbreak of MOUTH HERPES right now (simplex 2, I believe, although I do not have serological or genetic evidence to make this claim absolute&#xE2;&#x20AC;&#xA6;better for you to seek an outlet for testing and therapy&#xE2;&#x20AC;&#xA6;I have references). It is quite possible that the saliva which I deposited generously on the leading edge of the eat zone of my calzone is certain to contain active virus capable of infecting your oral cavity with a dreadful (and incurable, I might add) viral infection. For this, I apologize.</p>\n<p>Very best regards,<br>\nA very hungry grad student</p>\n<p>It would make me feel better to apologize in person.</p></blockquote>\n<p>We feel your pain, Hungry Grad Student. If you&#x2019;re reading us out there somewhere, we&#x2019;ll buy you a new Jerk Chicken Calzone.</p>\n\n\n\n\n<p>Related posts:<ol><li><a href=\"http://nashvillest.com/2008/07/29/that-just-might-work-gems-from-the-nashville-craigslist/\" rel=\"bookmark\" title=\"Permanent Link: That Just Might Work [Gems From The Nashville Craigslist]\">That Just Might Work [Gems From The Nashville Craigslist]</a></li>\n<li><a href=\"http://nashvillest.com/2008/06/02/gems-from-the-nashville-craigslist-superheroes-get-lonely-too/\" rel=\"bookmark\" title=\"Permanent Link: Gems From The Nashville Craigslist: Superheroes Get Lonely Too\">Gems From The Nashville Craigslist: Superheroes Get Lonely Too</a></li>\n<li><a href=\"http://nashvillest.com/2008/07/21/gems-from-the-nashville-craigslist-haiku-hotel/\" rel=\"bookmark\" title=\"Permanent Link: Gems From The Nashville Craigslist: Haiku Hotel\">Gems From The Nashville Craigslist: Haiku Hotel</a></li>\n<li><a href=\"http://nashvillest.com/2008/08/25/no-need-to-be-pc-gems-from-the-nashville-craigslist/\" rel=\"bookmark\" title=\"Permanent Link: No Need To Be PC [Gems From The Nashville Craigslist]\">No Need To Be PC [Gems From The Nashville Craigslist]</a></li>\n<li><a href=\"http://nashvillest.com/2009/06/16/very-ugly-painting-for-sale-gems-from-the-nashville-craigslist/\" rel=\"bookmark\" title=\"Permanent Link: Very Ugly Painting For Sale [Gems From The Nashville Craigslist]\">Very Ugly Painting For Sale [Gems From The Nashville Craigslist]</a></li>\n</ol></p>\t\t\t\t\t\t\t\t\t\t\t<!--END .entry-content .article-->"
}