{
 "id": 7905,
 "name": "wheres-the-love-nashville-instagram-ers",
 "title": "Where&#x2019;s The Love, Nashville Instagram-ers?",
 "author": "Morgan Levy",
 "date": "2011-10-25T12:00:00-05:00",
 "tags": [
  "instagram",
  "worldwide instameet"
 ],
 "categories": [],
 "excerpt": "This Wednesday is Worldwide Instameet Day, but there’s a problem – Nashville has exactly four people signed up to attend, and as of this posting, a location has yet to be set. Now, we know you people love your Instagram. We see you shuffling down the street trying to get that perfect artsy photo. And we see you standing in the middle of that parking lot, not moving an inch as you choose between Earlybird and Toaster. Okay, we’re guilty […]",
 "contentEncoded": "<p><a href=\"http://instagr.am/p/Q3Nlf/\"><img class=\"size-full wp-image-7907 aligncenter\" title=\"88b67ab406404bdf9d2f69883bbc0023_7\" src=\"http://nashvillest.com/wp-content/uploads/2011/10/88b67ab406404bdf9d2f69883bbc0023_7.jpg\" alt=\"\" width=\"428\" height=\"428\"></a></p>\n<p>This Wednesday is <a href=\"http://blog.instagram.com/post/11876219742/reminder-the-next-worldwide-instameet-is-this\" target=\"_blank\">Worldwide Instameet Day</a>, but there&#x2019;s a problem &#x2013; <a href=\"http://www.meetup.com/Instagram/Nashville/\" target=\"_blank\">Nashville has exactly four people signed up to attend, and as of this posting, a location has yet to be set</a>. Now, we know you people love your Instagram. We see you shuffling down the street trying to get that perfect artsy photo. And we see you standing in the middle of that parking lot, not moving an inch as you choose between Earlybird and Toaster. Okay, <a href=\"http://twitter.com/#!/nashvillest/status/127806220982681600\" target=\"_blank\">we&#x2019;re guilty too</a>. We love us some Instagram.</p>\n<p>So why is no one observing Worldwide Instameet Day in Nashville? With iPhones aplenty, we&#x2019;d expect Nashville to be topping the list of meet ups. Do we have any volunteers to save Nashville&#x2019;s Instameet?</p>\n<p><em>Photo by <a href=\"http://www.bradblackman.com/\" target=\"_blank\">bradblackman</a>.</em></p>"
}