{
 "id": 224,
 "name": "looking-ahead-whats-in-store-for-the-tennessee-state-fair",
 "title": "Looking Ahead: What&#x2019;s In Store For The Tennessee State Fair?",
 "author": "Christy Frink",
 "date": "2008-05-28T21:54:00-05:00",
 "tags": [
  "buck dozier",
  "nascar",
  "tennessee state fair",
  "tennessee state fairgrounds"
 ],
 "categories": [
  "News"
 ],
 "contentEncoded": "<p><a href=\"http://nashvillest.com/wp-content/uploads/2008/05/1395092839_bf841cfb0d.jpg\"><img class=\"alignleft size-full wp-image-225\" style=\"border: 0pt none; margin: 3px 8px; float: left;\" title=\"1395092839_bf841cfb0d\" src=\"http://nashvillest.com/wp-content/uploads/2008/05/1395092839_bf841cfb0d.jpg\" alt=\"\" width=\"216\" height=\"272\"></a>Earlier this evening, city officials and concerned Nashvillians gathered to hear from a firm hired by the city to figure out what the heck we should do with the struggling Tennessee State Fair and Fairgrounds. Since January, the group has been meeting with members of the community, tossing ideas around with developers, and taking a look at what other states are doing to give their state fairgrounds a 21st-century makeover. The Fair, which has been going on for almost 100 years, is a big part of Nashville&#x2019;s history. However, residents are concerned that the space has become an eyesore that, among other things, leads to unnecessary parking and traffic congestion and noise for surrounding areas. City officials are facing pressure from developers who want to create a mixed-use residential and retail space that may breathe life back into the neighborhood. Both sides also make the point that over 50 of the fairgrounds&#x2019; 118 acres are nearly unusable due to hills and floodplains.</p>\n<p><span id=\"more-224\"></span></p>\n<p>At the meeting, the firm laid out a few options for the future of the Fairgrounds. If it stays, one priority would be dealing with the racetrack, which is NASCAR&#x2019;s only sanctioned weekly series track in the state and also one of the main complaints of the neighbors. There was also talk of adding an arena, amphitheater, additional livestock facilities for horse shows, soccer fields, or partnering with carnival operators to add permanent rides and entertainment options.</p>\n<p>If the Fair and Fairgrounds are relocated, the existing land could be used as a regional sports and entertainment complex. Another option would be converting it into a town-centerish space with residential and a shopping areas. They&#x2019;re not sure yet where they would move the Fair.</p>\n<p>The research, which was originally set to wrap up in August, will continue with community surveys and closed-door meetings with developers until they narrow it down to 4 or 5 options and present them at a public hearing later on this summer. We probably won&#x2019;t know the final fate of the land until the end of the year.</p>\n<p>For now, they&#x2019;re taking suggestions. For more details about tonight&#x2019;s meeting or to submit some ideas of your own, head over <a href=\"http://www.markinconsulting.com/TSFStudy.htm\" target=\"_blank\">here</a> and fill out the comment form.</p>\n<p><em>Photo by <a href=\"http://flickr.com/photos/brent_nashville/1395092839/\" target=\"_blank\">Brent and MariLynn</a>.</em></p>\n\n\n\n\n<p>Related posts:<ol><li><a href=\"http://nashvillest.com/2010/03/01/happy-hour-revenge-of-the-tennessee-state-fair/\" rel=\"bookmark\" title=\"Permanent Link: Happy Hour: Revenge Of The Tennessee State Fair\">Happy Hour: Revenge Of The Tennessee State Fair</a></li>\n<li><a href=\"http://nashvillest.com/2009/09/11/fresh-faced-tennessee-state-fair-opens-tonight-with-free-admission/\" rel=\"bookmark\" title=\"Permanent Link: Fresh-Faced Tennessee State Fair Opens Tonight With Free Admission\">Fresh-Faced Tennessee State Fair Opens Tonight With Free Admission</a></li>\n<li><a href=\"http://nashvillest.com/2008/09/09/state-fair-say-wha/\" rel=\"bookmark\" title=\"Permanent Link: State Fair: Say Wha?\">State Fair: Say Wha?</a></li>\n<li><a href=\"http://nashvillest.com/2009/10/07/bright-early-take-us-out-to-the-fair-edition/\" rel=\"bookmark\" title=\"Permanent Link: Bright &amp; Early: Take Us Out To The Fair Edition\">Bright &amp; Early: Take Us Out To The Fair Edition</a></li>\n<li><a href=\"http://nashvillest.com/2009/02/25/you-tell-us-whats-really-tennessees-official-state-beverage/\" rel=\"bookmark\" title=\"Permanent Link: You Tell Us: What&#x2019;s REALLY Tennessee&#x2019;s Official State Beverage?\">You Tell Us: What&#x2019;s REALLY Tennessee&#x2019;s Official State Beverage?</a></li>\n</ol></p>\t\t\t\t\t\t\t\t\t\t\t<!--END .entry-content .article-->"
}