{
 "id": 1917,
 "name": "now-taking-submissions-2009-cmapocalypse-bingo-nashvillest-contests-cmapocalypse-2009",
 "title": "Now Taking Submissions: 2009 CMApocalypse Bingo [Nashvillest Contests] [CMApocalypse 2009]",
 "author": "Morgan Levy",
 "date": "2009-06-09T15:55:00-05:00",
 "tags": [
  "cmapocalypse 2009",
  "cmapocalypse bingo",
  "tourists"
 ],
 "categories": [],
 "excerpt": "Last year, in what might be our all-time favorite post on Nashvillest, we posted a reader-submitted Fan Fair Bingo card for a little chuckle at the expense of CMA Fest tourists. It’s become nothing short of a legend, but we’re going to try our hands at the impossible and see if we can top it. Well, that’s not entirely accurate. We’re going to see if one of YOU can top it.  Readers, this is where you come in. Send us […]",
 "contentEncoded": "<p style=\"text-align: center;\"><img src=\"http://nashvillest.com/wp-content/uploads/2008/06/fanfairbingo.jpg\" alt=\"\" width=\"500\" height=\"600\"></p>\n<p>Last year, in what might be our <a href=\"http://nashvillest.com/2008/06/04/fan-fair-bingo-when-youre-done-counting-tube-tops-cmapocalypse-2008/\" target=\"_blank\">all-time favorite post on Nashvillest</a>, we posted a reader-submitted Fan Fair Bingo card for a little chuckle at the expense of CMA Fest tourists. It&#x2019;s become nothing short of a legend, but we&#x2019;re going to try our hands at the impossible and see if we can top it. Well, that&#x2019;s not entirely accurate. We&#x2019;re going to see if one of YOU can top it.&#xA0;</p>\n<p>Readers, this is where you come in. <strong>Send us your best shot at 2009 CMApocalypse Bingo (leave a link in the comments, or email it to tips(at)nashvillest(dot)com. We even have an awesome yet-to-be-determined prize for our winner</strong><strong>.</strong>&#xA0;Submissions must be in by noon on Wednesday (tomorrow). We&#x2019;ll post the winner for all to enjoy as the official 2009 bingo card, along with any other submissions that tickle our funny bones. Feel free to use last year&#x2019;s bingo card as a template.</p>\n<p><em>Disclaimer: We love our tourists, but we need a little fun to get the locals through the week!</em></p>"
}