{
 "id": 6630,
 "name": "nashville-film-festival-announces-2011-feature-films-tickets-on-sale-april-7",
 "title": "Nashville Film Festival Announces 2011 Feature Films, Tickets On Sale April 7",
 "author": "Morgan Levy",
 "date": "2011-03-02T13:00:00-06:00",
 "tags": [
  "naff11",
  "nashville film festival"
 ],
 "categories": [],
 "excerpt": "The 2011 Nashville Film Festival is just around the corner and we have a feeling that our expectations for the best fest ever are right on track. The festival announced this year’s feature films in competition and major categories today, including Apichatpong Weerasethakul’s “Uncle Boonmee Who Can Recall His Past Lives” (Winner of the Palm d’Or at Cannes 2010), Cindy Meehl’s “Buck” (Audience Award for Best Documentary at Sundance 2011) and Alrick Brown’s “Kinyarwanda” (Audience Award for Best Narrative Feature […]",
 "contentEncoded": "<p style=\"text-align: center;\"><a href=\"http://www.flickr.com/photos/scribebytrade/4653200374/\" target=\"blank\"><img class=\"aligncenter\" src=\"http://farm5.static.flickr.com/4050/4653200374_5b9a3dce56.jpg\" alt=\"\"></a></p>\n<p>The 2011 Nashville Film Festival is just around the corner and we have a feeling that our expectations for the best fest ever are right on track. The festival announced this year&#x2019;s feature films in competition and major categories today, including Apichatpong Weerasethakul&#x2019;s &#x201C;Uncle Boonmee Who Can Recall His Past Lives&#x201D; (Winner of the Palm d&#x2019;Or at Cannes 2010), Cindy Meehl&#x2019;s &#x201C;Buck&#x201D; (Audience Award for Best Documentary at Sundance 2011) and Alrick Brown&#x2019;s &#x201C;Kinyarwanda&#x201D; (Audience Award for Best Narrative Feature at Sundance 2011). <a href=\"http://nashvillefilmfestival.org/press/2011-nashville-film-festival-presented-nissan-announces-feature-films-competition-and-major-ca\" target=\"_blank\">Straight from the horse&#x2019;s mouth</a>:</p>\n<blockquote>\n<p style=\"text-align: left;\">Winner of the Palm d&#x2019;Or at Cannes, Thai filmmaker Apichatpong Weerasethakul&#x2019;s &#x201C;Uncle Boonmee Who Can Recall His Past Lives,&#x201D; a natural, free-wheeling, pensive and dryly funny film combining Buddhist belief, cinematic history, and Northern Thailand folklore, will join more than a dozen international films in the World Cinema category. Joining &#x201C;Uncle Boonmee&#x2026;&#x201D; in the category will be &#x201C;Buck,&#x201D; American director Cindy Meehl&#x2019;s portrait of Buck Brannaman, the inspiration for &#x201C;The Horse Whisperer.&#x201D; The film picked up the Audience Award for Best Documentary at this year&#x2019;s Sundance Film Festival. Also of note in World Cinema is veteran Japanese filmmaker Takashi Mikke&#x2019;s &#x201C;13 Assassins&#x201D; and Italian filmmaker Michelangelo Frammartino&#x2019;s &#x201C;Le Quattro Volte (The Four Times).&#x201D;</p>\n<p style=\"text-align: left;\">In the Narrative Competition Presented by Bridgestone, director Alrick Brown&#x2019;s &#x201C;Kinyarwanda,&#x201D; winner of the Audience Award from Best Narrative Feature at Sundance, is based on true accounts from survivors during the 1994 Rwandan genocide who took refuge at the Grand Mosque of Kigali and the Imams who opened their doors to give refuge to the Tutsi and to those Hutu who refused to participate in the killing.</p>\n</blockquote>\n<p style=\"text-align: left;\">Check out the full list of selected films (many are regional and world premieres) in the World Cinema, Narrative Competition, New Directors Competition, Documentary Competition, Music City Competition and Graveyard Shift categories after the jump or in the <a href=\"http://nashvillefilmfestival.org/press/2011-nashville-film-festival-presented-nissan-announces-feature-films-competition-and-major-ca\" target=\"_blank\">official press release</a>. Keep an eye out in the coming weeks for more films to be announced, including opening and closing night films (previous opening day premieres include &#x201C;500 Days of Summer&#x201D; and &#x201C;Nowhere Boy&#x201D;).</p>\n<p style=\"text-align: left;\">If you haven&#x2019;t experienced the Nashville Film Festival yet, make 2011 your first. The fest kicks off April 14 and runs through the 21st, and it&#x2019;s become a major highlight of every year for us (it only gets better as the years pass). <a href=\"http://nashvillefilmfestival.org/buy-laminate\" target=\"_blank\">Patron-level festival laminates are on sale now</a> for $250, and include tickets for up to 40 films and access to food &amp; drink in the VIP tent. Ticketing for individual films begins on April 5 for laminate holders and April 7for the general public.</p>\n<p style=\"text-align: left;\"><strong>2011 Nashville Film Festival</strong>, <em>April 14-21 at Regal Green Hills Stadium 16.</em></p>\n<p style=\"text-align: left;\"><em>Photo by </em><a href=\"http://www.flickr.com/photos/scribebytrade/4653200374/\" target=\"_blank\"><em>christyfrink</em></a><em>.</em></p>\n<p style=\"text-align: left;\"><span id=\"more-6630\"></span></p>\n<p><span style=\"text-decoration: underline;\"><strong>World Cinema</strong></span></p>\n<p>A vibrant, esoteric sampling of some of the finest cinema the world has to offer.</p>\n<p><em><strong>13 Assassins</strong></em> (Takashi Miike / Japan)<br>\nTakashi Miike (Audition, Ichi the Killer) has more than 80 films under his belt, but none quite like &#x201C;13 Assassins.&#x201D; The year is 1844, and a young lord reigns over his village with an iron fist. The era of the samurai is coming to a close, but one honest government official secretly enlists thirteen swordsmen to bring an end to the sadistic lord&#x2019;s power before it spreads. While reverently paying homage to samurai classics of the past, this is not a tongue-in-cheek take on an old genre.&#xA0; This is good old-fashioned film-making, with a gloriously blood-soaked climactic battle scene that will be remembered for years to come.&#xA0;<em>Starring Koji Yakusho, Takayuki Yamada, Yusuke Iseya and Goro Inagaki.</em></p>\n<p><em><strong>The Arbor</strong></em> (Clio Barnard / United Kingdom)<br>\nClio Barnard&#x2019;s debut feature is, at its core, a documentary about the life of British playwright Andrea Dunbar, whose writings chronicled her grim years living in West Yorkshire.&#xA0; However, Barnard &#x2013; by blending archival material about her subject&#x2019;s life with the staging of the titular play &#x2013; creates a beautiful blend of fact and fiction, earning her a British Academy Award nomination for Best New Director and six British Independent Film Award nominations.</p>\n<p><em><strong>Buck</strong></em> (Cindy Meehl / USA)<br>\nAudience Award-winner for Best Documentary at the Sundance Film Festival, &#x201C;Buck&#x201D; follows living legend Buck Brannaman &#x2013; the inspiration for &#x201C;The Horse Whisperer.&#x201D; To this true cowboy, horses are a mirror into the human soul.&#xA0; By teaching people to communicate with their animals through instinct, not punishment or violence, he frees the spirit of the horse and its human comrade. First-time director Cindy Meehl creates a strikingly cinematic portrait of a man who transforms his clients&#x2019; souls.</p>\n<p><em><strong>Bhutto</strong></em> (Duane Baughman, Johnny O&#x2019;Hara / USA, Pakistan)<br>\nPakistan&#x2019;s first democratically-elected prime minister&#x2019;s daughter, Benazir Bhutto, challenged Muslim views of women as authority figures when she returned to her homeland in 2007, hoping to run for office and reassert the power of free elections after decades of military dictatorship.&#xA0; Her assassination in December of that year brought that dream to an end.&#xA0; Bhutto is a film about&#xA0; the history of Pakistani politics, the role of her family in the nation&#x2019;s independence, and the controversies that surrounded her. It is a complete portrait of a compelling woman leader. Free screening as part of ITVS Community Cinema Nashville.</p>\n<p><em><strong>Caterpillar </strong></em>(K&#xF4;ji Wakamatsu / Japan)<br>\nDuring the second Sino-Japanese War, a village woman is given the grueling task of looking after (and fulfilling the sexual needs of) her quadruple-amputee husband- a decorated soldier tortured by memories of his war crimes.&#xA0; Based on a short story by Edogawa Rampo, Koji Wakamatsu&#x2019;s film is a fascinating, deeply affecting indictment of right-wing militarist-nationalism, which is a partner-piece to his previous work, the left-wing extremism portrayed in &#x201C;United Red Army.&#x201D;&#xA0;<strong>Starring&#xA0; Shinobu Terajima, Keigo Kasuya, Emi Masuda and Sabu Kawahara.</strong></p>\n<p><em><strong>The Human Resources Manager</strong> </em>(Eran Riklis / Israel)<br>\nWhen the well-meaning but selfish human resources manager at Israel&#x2019;s largest bakery finds his career threatened upon the death of a young immigrant employee, he takes it upon himself to escort her corpse back to her small Russian village.&#xA0; Along the way, he meets characters &#x2013; both helpful and not &#x2013; who remind him of where humanity truly lies.&#xA0; This quirky tragicomedy from director Eran Riklis (&#x201C;The Lemon Tree&#x201D;) was the Israeli submission to the Academy Awards.&#xA0; Presented by the Nashville Jewish Film Festival.&#xA0;<em>Starring Mark Ivanir and Gila Almagor.</em></p>\n<p><em><strong>My Joy</strong></em> (Sergei Loznitsa / Ukraine)<br>\nWhen a kind-hearted trucker turns onto a dirt road to bypass a highway auto accident, he encounters a motley crew of characters &#x2013; an old hitchhiker, a young prostitute, and a pair of rowdy soldiers &#x2013; who will darken his worldview. Disturbing, outlandish, occasionally hilarious, and always a little dangerous, Sergei Loznitsa&#x2019;s harsh depiction of the Russian hinterland is the rare debut feature to be selected for competition at the Cannes Film Festival.&#xA0;<em>Starring Viktor Memets, Olga Shuvalova and Vladimir Golovin.</em></p>\n<p><em><strong>N&#xE9;nette</strong> </em>(Nicolas Philibert / France)<br>\nN&#xE9;nette is a 40-year-old orangutan born in Borneo and raised in the Paris Zoo that is her home to this day. She&#x2019;s raised four children (one still lives with her in her habitat); outlived three mates; and bonds with very few of her keepers.&#xA0; N&#xE9;nette is also the star of a beautifully-composed documentary from the director of 2003&#x2019;s &#x201C;To Be and to Have.&#x201D;</p>\n<p><em><strong>Le Quattro Volte</strong></em> (The Four Times) (Michelangelo Frammartino / Italy)<br>\nInspired by Pythagoras&#x2019;s belief in four-fold transmigration &#x2013; by which the soul is passed from human to animal to vegetable to mineral&#xA0; &#x2014; Michelangelo Frammartino&#x2019;s wondrous docu-essay traces the four cycles through the daily rituals of the inhabitants of a small village in the Calabria region of Italy.&#xA0; Although it sounds overly-philosophical, &#x201C;Le Quattro Volte&#x201D; is a winner (literally taking home a prize in the Cannes Director&#x2019;s Fortnight) because it approaches its subject with a sense of adventure and a surprising wit.</p>\n<p><em><strong>The Red Chapel</strong></em> (Mads Br&#xFC;gger / Denmark)<br>\nWinner of the World Cinema Jury Prize at the 2010 Sundance Film Festival, Mads Br&#xFC;gger&#x2019;s documentary follows a trio of Danish comedians as they pretend to be regime of sympathizers and mount an absurd variety show in North Korea. Combining the muckraking spirit of Michael Moore with the confrontational comedy of &#x201C;Borat,&#x201D; &#x201C;The Red Chapel&#x201D; is an unconventional, hilarious and damning peek behind the curtain of a totalitarian regime.</p>\n<p><em><strong>The Robber</strong></em> (Benjamin Heisenberg / Austria )<br>\nBased on the true story of Johann Rettenberger- a champion marathoner, &#x201C;The Robber&#x201D; is part action film and part fascinating character study.&#xA0; Rettenberger leads a double life by winning international medals by day, and serially robbing banks by night.&#xA0; Lean and visceral, &#x201C;The Robber&#x201D; is a riveting study of pathological compulsion featuring a sizzling lead performance by Andreas Lust (of the 2009 Academy Award-nominee, &#x201C;Revanche&#x201D;).&#xA0;<em>Starring Andreas Lust.</em></p>\n<p><em><strong>The Sleeping Beauty</strong></em> (Catherine Breillat / France)<br>\nFollowing last year&#x2019;s &#x201C;Blue Beard,&#x201D; Catherine Breillat returns with another fractured take on a classic fairy tale with &#x201C;The Sleeping Beauty.&#x201D;&#xA0; A young princess finds herself the subject of a tug-of-war among witches, but as the story ensues, Breillat uses fantasy (in every sense of the word &#x2013; dark, sensual, sexual, and foreboding) to create a beguiling tale of girls in trouble who find their way, through imagination, and sheer force of will.&#xA0;<em>Starring Carla Besnainou. Julia Artamonov, Kerian Mayan and David Chausse.</em></p>\n<p><strong>Tuesday, After Christmas</strong> (Radu Muntean / Romania)<br>\nSelected for Cannes and the New York Film Festival, &#x201C;Tuesday, After Christmas&#x201D; is yet another shining example of the Romanian new wave. Paul loves two women. Adriana his wife and mother of their daughter- who is the woman with whom he&#x2019;s shared the thrills of the past ten years; and Raluca the woman who has made him redefine himself.&#xA0; He has to leave one of them before Christmas. In some hands this would be the stuff of slapstick and mayhem.&#xA0; In the hands of Muntean and his pitch-perfect cast, it&#x2019;s a moving portrayal of the directions modern life takes us.&#xA0;<em>Starring Dragos Bucur, Maria Popistasu and Mimi Branescu.</em></p>\n<p><em><strong>Uncle Boonmee Who Can Recall His Past Lives</strong></em> (Apichatpong Weerasethakul / Thailand)<br>\nUncle Boonmee is dying of kidney failure and wants to spend his final days on his farm.&#xA0; He is joined not only by living relatives who will care for him, but also by his late wife, lost son, and other visitors from the spirit world.&#xA0; But this is no monster movie.&#xA0; Winner of the 2010 Palme D&#x2019;Or at Cannes, &#x201C;Uncle Boonmee Who Can Recall His Past Lives&#x201D; is a natural, free-wheeling, pensive, and dryly funny film based on Buddhist belief, cinematic history, and the folk legends from the northern region of Thailand that was the boyhood home of director Weerasethakul.&#xA0; Shot entirely on film (a rarity these days), &#x201C;Uncle Boonmee&#x201D; is a visual masterpiece not to be missed.&#xA0;<em>Starring Sakda Kaewbuadee, Matthieu Ly and Thanapat Saisaymar.</em></p>\n<p><em><strong>!Women Art Revolution</strong></em> (Directed by Lynn Hershman-Leeson / USA)<br>\nIt was only a generation ago that it was rare to find works of art by women in a major gallery or museum. Director Lynn Hershman-Leeson was a proud participant in the revolution that changed that terrain, and thankfully, she spent the past forty years documenting and interviewing the vibrant women who changed our artistic culture and questioned art, politics, equality and freedom of expression.<em>Starring Yoko Ono, B. Ruby Rich, Miriam Schapiro and Yvonne Rainer.</em></p>\n<p><span style=\"text-decoration: underline;\"><strong>Narrative Competition presented by Bridgestone</strong></span></p>\n<p><em><strong>Dog Sweat</strong></em> (Hossein Keshavarz/ Iran).<br>\nShot clandestinely in Tehran in the months leading up to the 2009 elections and the Green Wave that followed, &#x201C;Dog Sweat&#x201D; follows the lives of six young Iranians&#xA0; &#x2013; a gay male, a female pop singer, a feminist, a grief-stricken son, and two young lovers.&#xA0; Filled with portraits of individuals both misunderstood by their families, and oppressed by the conservative Islamic regime, &#x201C;Dog Sweat&#x201D; provides a portrait of a new generations of Iranians. TENNESSEE PREMIERE.</p>\n<p><em><strong>Domain </strong></em>(Patric Chiha, France)<br>\nNamed by John Waters as his favorite film of 2010, Patric Chiha&#x2019;s elliptical and teasing tale of an unusual family relationship.&#xA0; Pierre is a shy good-looking lad who has a decent relationship with his mother.&#xA0; But, as he becomes aware of his homosexuality, he grows close to his free-wheeling, heavy-drinking aunt Nadia (French legend Beatrice Dalle). SOUTHEAST PREMIERE.</p>\n<p><em><strong>Kinyarwanda</strong></em> (Alrick Brown, Rwanda / USA)<br>\nKINYARWANDA interweaves six different tales (of a Tutsi/Hutu couple, a small child, a soldier, a pair of teenage lovebirds, a priest, and an Imam) that together form one grand narrative providing the most complex and real depiction yet presented of human resilience and life during the Rwandan genocide.&#xA0; Kinyarwanda plumbs the shades of gray to find humanity in every perspective and offers a rich understanding of what it means to survive unimaginable terror, and the astounding resilience of the human spirit to find ways to heal and forgive. TENNESSEE PREMIERE.</p>\n<p><em><strong>The Last Ride</strong></em> (Harry Thomason, USA)<br>\nInspired by the mysterious final days of Hank Williams&#x2019; mercurial life, &#x201C;The Last Ride&#x201D; is a look into the final days of country music legend, Hank Williams, and his relationship with the young man hired to drive the troubled star and his Cadillac from Alabama to Ohio in the dead of winter, around New Year&#x2019;s Eve, 1952.&#xA0; Sparse and contemplative, the story takes us inside the heart of a man who knows he&#x2019;s dying, and a dreamless boy whose fate seems already determined. And yet, the all too human connection of two souls needing just one friend leave us with an ending of hope, optimism, and ultimately, redemption on one man&#x2019;s last ride into eternity. WORLD PREMIERE.</p>\n<p><em><strong>The Last Summer of La Boyita</strong></em> (Julia Solomonoff, Argentina)<br>\nYoung Jorgelina feels estranged from her boy-crazy older sister, who has entered adolescence and doesn&#x2019;t want to hang around with little kids anymore. Finding refuge in their Boyita camper-van, Jorgelina travels with her father to the countryside, where her lifelong playmate Mario is undergoing some unexpected changes of his own. SOUTHEAST PREMIERE.</p>\n<p><em><strong>Septien</strong></em> (Michael Tully, USA)<br>\nEighteen years after disappearing without a trace, Cornelius Rawlings returns to his family&#x2019;s farm. While his parents are long deceased, Cornelius&#x2019;s brothers Ezra and Amos continue to live in isolation. Wilbur, their farmhand, sleeps in a tractor tire out back. One day, the toilet breaks. A plumber is called. That man, Red &#x2018;Rooster&#x2019; Rippington, shares his bed with a pretty, vaguely underage girl named Savannah. He also turns out to be a figure from Cornelius and Amos&#x2019;s past. It will take the efforts of a mysterious drifter, Jackson, to smother the Rawlings Brothers&#x2019; demons once and for all. TENNESSEE PREMIERE.</p>\n<p><em><strong>Summer of Goliath</strong></em> (Nicol&#xE1;s Pereda, Mexico, Canada)<br>\nShocked by her husband&#x2019;s sudden departure, Teresa embarks on a mission to find out what happened. Instead of finding answers, her mission becomes a journey through the streets and homes of the people she meets. Blending fiction and documentary, her wanderings portray the town and its inhabitants. Constructed through characters and the village&#x2019;s corporeal landscape, we drift with Teresa through spaces and people suffering the effects of lost loved ones, broken promises, disconnection and eternal longing. SOUTHEAST PREMIERE.</p>\n<p><em><strong>Weekend</strong></em> (Andrew Haigh, United Kingdom)<br>\nOn a Friday night after a drunken house party with his straight mates, Russell heads out to a gay club. Just before closing time he picks up Glen but what&#x2019;s expected to be just a one-night stand becomes something else&#x2026;something special. That weekend, in bars and in bedrooms, getting drunk, telling stories and having sex, the two men get to know each other. It is a brief encounter that will resonate throughout their lives.&#xA0; &#x201C;Weekend&#x201D; is both an honest and unapologetic love story between two guys and a film about the universal struggle for an authentic life in all its forms.&#xA0; SOUTHEAST PREMIERE.</p>\n<p><em><strong>The Wolf Knife</strong></em> (Laurel Nakadate, USA)<br>\nFleeing her mom&#x2019;s creepy fianc&#xE9; and the suffocating boredom of Florida in the summer, Chrissy enlists best friend, June, to help find her estranged father. The Wolf Knife follows the girls on a digressive road trip to Nashville &#x2013; encountering dirty old men and kitschy tourist attractions along the way &#x2013; a journey fraught with sexual mystery and danger. TENNESSEE PREMIERE.</p>\n<p><span style=\"text-decoration: underline;\"><strong>Documentary Competition Presented by Documentary Channel</strong></span></p>\n<p><em><strong>An African Election</strong></em> (Jarreth Merz / Ghana , USA)<br>\nThe 2008 presidential elections in Ghana, serve as a backdrop for this behind-the-scenes look at the complex, political machinery of a third world democracy struggling to legitimize itself to its first world contemporaries. At stake in this race are the fates of two political parties that will do almost anything to win. Director Merz follows the key players for months to provide an unprecedented view of the political, economic and social forces at work in Ghana, and takes strides in answering the question &#x2013; will democracy work in Africa?</p>\n<p><em><strong>Autumn Gold </strong></em>(Jan Tenhaven / Austria)<br>\n&#x201C;Autumn Gold&#x201D; tells the life-affirming stories of five senior athletes&#xA0; &#x2013; all between the ages of 80 and 100 &#x2013; from across Europe who all share one goal: to take part in the 2009 track and field World Masters Championships in Lahti, Finland. Each is in a race against time and the natural degradation of their bodies &#x2013; but each possesses a drive beyond age to achieve their goals of reaching the medal podium.</p>\n<p><em><strong>The Big Uneasy</strong></em> (Harry Shearer / USA)<br>\nActor, humorist and New Orleans resident, Harry Shearer, (&#x201C;This Is Spinal Tap,&#x201D; &#x201C;A Mighty Wind&#x201D;) gets the inside story of a disaster that could have been prevented from the people who were there. You meet the investigators who poked through the muck as the water receded, and a whistle-blower from the Army Corps of Engineers. They reveal that some of the same flawed methods responsible for the catastrophic levee failures during Katrina are being used to rebuild the system and are expected to protect New Orleans from future peril. Harry Shearer will attend.</p>\n<p><em><strong>Connected: An Autobiography about Love, Death and Technology</strong></em> (Tiffany Shlain / USA)<br>\nTiffany Shlain&#x2019;s vibrant and insightful documentary, &#x201C;Connected,&#x201D;&#xA0; explores the visible and invisible connections linking major issues of our time such as&#x2014;the environment, consumption, population growth, technology, human rights, and the global economy&#x2014; all while searching for her place in the world during a transformative time in her life. Employing a splendidly imaginative combination of animation and archival footage, plus several surprises, Shlain constructs a chronological tour of Western modernization through the work of her late father, Leonard Shlain, a brain surgeon and best-selling author of Art and Physics and The Alphabet Versus the Goddess.</p>\n<p><em><strong>If a Tree Falls: A Story of the Earth Liberation Front</strong></em> (Marshall Curry / USA)<br>\nFocusing on Oregon-based activist Daniel McGowan, Curry presents the tale of a mild-mannered, middle-class citizen driven to extremes and brought to trial on charges of terrorism for his participation in ELF-related arson plots. Detailing activists&#x2019; past disillusionment with public protest, and the police brutality and inertia that often followed, `the film poses difficult questions about the possibility of effecting change from either within or without the system, and examines the changed stakes for revolutionaries today in a world fixated on branding all dissenters as terrorists.</p>\n<p><em><strong>The Interrupters</strong></em> (Steve James / USA)<br>\nMeet the Interrupters&#x2014;former gang members who disrupt violence in their neighborhoods as it happens. Acclaimed director Steve James (&#x201C;Hoop Dreams,&#x201D; &#x201C;Stevie&#x201D;) recounts the gripping stories of men and women who, with bravado, humility, and humor, strive to protect their communities from the brutality they once employed. With his signature style, James follows these individuals over the course of a year as they attempt to intervene in disputes before they turn violent:&#xA0; two brothers who threaten to shoot each other, an angry teenage girl who just came home from prison, and a young man on a warpath of revenge. Both a voyage into the stubborn persistence of bloodshed in our cities today and a beacon of light, James&#x2019;s unforgettable documentary captures each Interrupter&#x2019;s inspired work, transporting us on a powerful journey from crime, to trust, to redemption.</p>\n<p><em><strong>Just Like Us</strong></em> (Ahmed Ahmed / USA)<br>\nIs there comedy in the Middle East? Despite there being no easy way to describe stand-up comedy in Arabic, a group of &#x201C;comedy ambassadors&#x201D; travel from Dubai to Beirut, Riyadh to Cairo with a double mission: to disrupt the pervasive image of Muslims as solemn, threatening, and inhuman, and deliver some much-needed relief and laughter to the intense reality of everyday life in the Middle East. As thoughtful as it is entertaining, the Egyptian-American comic&#x2019;s directorial debut, &#x201C;Just like Us,&#x201D; shows us the Middle East like most Americans have never seen it before. Featuring the talented antics of Maz Jobrani, Tom Papa, Ted Alexandro, Tommy Davidson, Omid Djalili (&#x201C;The Infidel&#x201D;), Whitney Cummings, and Ahmed Ahmed himself, this documentary offers an incredibly timely glimpse into a world the West is only beginning to understand.</p>\n<p><em><strong>Most Valuable Players</strong></em> (Matthew D. Kallis / USA)<br>\nAs budget cuts eviscerate various art programs in America&#x2019;s schools, theater departments struggle to put on the school musical hoping for some attention of their own.&#xA0; It&#x2019;s no different in Lehigh Valley, PA, except for the &#x2018;Freddy Awards&#x2019;-&#xA0; a live television event that recognizes excellence in local high school musical theater.&#xA0; Illustrating that arts education encourages the same teamwork, camaraderie, and confidence as sports, &#x201C;Most Valuable Players&#x201D; follows three theater troupes on their creative journey to the elaborate award ceremony &#x2013; the &#x2018;Super Bowl&#x2019; of high school musical theater. The film reminds us why the performing arts remain vital in the lives of young people. In the face of shrinking budgets, schools, parents, and communities must band together to preserve and nurture arts education.</p>\n<p><em><strong>One Lucky Elephant</strong></em> (Lisa Leeman / USA)<br>\nNine years in the making, &#x201C;One Lucky Elephant&#x201D; follows the poignant journey of circus producer David Balding as he tries to find a nurturing and permanent home for Flora, the 18-year-old African elephant that he rescued as an infant, raised as his &#x201C;daughter&#x201D; and made the star of his circus. David&#x2019;s love for Flora is put to the ultimate test when he realizes he made a terrible mistake keeping her as a solo elephant.&#xA0; Knowing Flora will outlive him, David sets off on a quest to find a home where Flora can live freely with other elephants.&#xA0; &#x201C;One Lucky Elephant&#x201D; raises vital questions regarding mans&#x2019; relationship to, and love for, wild animals.</p>\n<p><em><strong>The Sons of Tennessee Williams </strong></em>(Tim Wolff / USA)<br>\n&#x201C;The Sons of Tennessee Williams&#x201D; tells the story of the gay men of New Orleans who created a vast and fantastic culture of wildly popular &#x2018;drag balls&#x2019; starting in the late 1950s. These men worked with the traditions of Mardi Gras to bring gay culture into public settings in the early 1960s.&#xA0; By the 1969 Stonewall Riots, there were four gay Mardi Gras clubs legally chartered by the state of Louisiana, throwing yearly extravaganzas at civic venues around the city and bringing down the laws that targeted gay people during this period. They staged a flamboyant, costumed revolution without politics, and won freedoms during a time, as now, when laws and people fought against them.</p>\n<p><span style=\"text-decoration: underline;\"><strong>New Directors Competition</strong></span></p>\n<p><em><strong>Aardvark</strong></em> (Kitao Sakurai / USA, Argentina)<br>\n&#x201C;Aardvark&#x201D; is perhaps the first narrative film to star a man who has been blind since birth. In a role inspired by his own life, Larry Lewis plays a solitary man recovering from alcoholism and working towards stability. When he joins a Jiu Jitsu academy, he finds a close friend in his young, hard-partying instructor, Darren. But, as disturbing aspects of Darren&#x2019;s life are revealed, Larry soon finds himself alone and faced with the consequences of a horrific act of violence.&#xA0;<em>Starring Larry Lewis, Jr. and Darren Branch.</em></p>\n<p><em><strong>A Bag of Hammers </strong></em>(Brian Crano / USA)<br>\n&#x201C;A Bag of Hammers&#x201D; revolves around the friendship of two charming grifters, Ben and Alan (Ritter and Sandvig), who have built a life posing as valets, only to steal cars instead of parking them.&#xA0; However, everything changes when they meet their twelve-year-old neighbor boy, Kelsey.&#xA0; Neglected by his mother, Kelsey becomes part mascot, part prot&#xE9;g&#xE9; for their petty criminal operation. Ultimately, though, his presence forces Alan and Ben to choose between a life of crime and fun, and the opportunity to grow up and deal with the emotional consequences that come along with entering adulthood.<em>Starring Jason Ritter, Jake Sandvig, Carrie Preston, Rebecca Hall and Amanda Seyfried.</em></p>\n<p><em><strong>Bloomington</strong></em> (Fernanda Cardoso / USA)<br>\n&#x201C;Bloomington&#x201D; is a coming-of-age drama about Jackie, a former child actress attending a Midwestern college in search of independence away from &#x201C;Neptune 26&#x201D;, the show that made her a star. During a mixer, she meets professor Catherine Stark, and over time becomes romantically involved with her. Their relationship thrives until an opportunity to return to acting forces her to make life-altering decisions.&#xA0;<em>Starring Allison McAtee, Sarah Stouffer, Katherine Ann McGregor.</em></p>\n<p><em><strong>Chance</strong></em> (Abner Benaim / Panama)<br>\nThis hilarious comedy tells the story of To&#xF1;a and Paquita, the housekeepers for the aristocratic Gonz&#xE1;lez-Dubois family. These domestic employees have been mistreated for quite some time and they are tired of their situation.&#xA0; So when the family plans a shopping trip to Miami, the maids have a plan of their own &#x2013; to take control of the mansion.&#xA0; Unexpectedly, they will also discover a long-held family secret.&#xA0;<em>Starring Francisco Gattorno, Rosa Isabel Lorenzo, Aida Morales and Maria Alejandra Palacios.</em></p>\n<p><em><strong>Days of Harvest </strong></em>(Marco Righi / Italy)<br>\nIt&#x2019;s 1984 in sultry, sunny, rural Italy. Teenager Elia lives with his Marxist father, devoutly Catholic mother, and the ghost of his brother &#x2013; who left the family more than a year ago.&#xA0; Emilia, granddaughter of a neighboring elderly couple, arrives on the family plantation to help with the grape harvest.&#xA0; A little conceited and nonchalant about sexual matters, she brings a true revolution into the life of one young provincial teenage boy.&#xA0;<em>Starring Lavinia Longhi, Marco D&#x2019;Agostin and Gian Marco Tavani. </em></p>\n<p><em><strong>Inuk</strong></em> (Mike Magidson / Greenland, France)<br>\nIn Greenland&#x2019;s capital, Nuuk, sixteen year-old Inuk lives a troubled life with his alcoholic mother and violent step-father. One morning, after pulling the half-frozen boy out of an abandoned car, the social services decide to send Inuk north, to a children&#x2019;s home on a tiny island in the middle of the arctic sea-ice. Shortly after arriving, Inuk meets Ikuma, a local polar bear hunter, who has his own share of problems. Ikuma takes Inuk on his annual seal-hunting trip.&#xA0; She is certain that despite the risks of such a long and dangerous voyage, Inuk will undoubtedly learn that he has both a valiant past and a hopeful future.<em> Starring Julunnguaq Amossen, Ann Andreasen, Hans Gundel, Ole Jorgen Hammeken.</em></p>\n<p><em><strong>Jess + Moss </strong></em>(Clay Jeter / USA)<br>\nComing from the Sundance and Berlin Film Festivals, &#x201C;Jess + Moss&#x201D; is the story of second cousins who have spent their summers together as long as either of them can remember.&#xA0; With no immediate families that they can relate to, and lacking friends their own age (she&#x2019;s 18; he&#x2019;s 12), all they have is each other and the abandoned farm house where they store the souvenirs of their lives.&#xA0; Through a series of memories and vignettes, &#x201C;Jess + Moss&#x201D; recounts the events of their final summer together.<em>Starring Sarah Hagan and Austin Vickers.</em></p>\n<p><em><strong>Stranger Things</strong></em> (Eleanor Burke, Ron Eyal / United Kingdom, USA)<br>\nOona, a young woman dealing with the loss of her mother, reaches out to a stranger, Mani, a mysterious homeless man of Middle-Eastern origin, whom she invites to stay in her garden shed. Despite the space between them, Oona and Mani gradually form an unusual intimacy. This delicate and compelling film, set on the south coast of England, explores themes of responsibility, friendship and human vulnerability.&#xA0;<em>Starring Bridget Collins and Adeel Akhtar</em>.</p>\n<p><em><strong>Dvojka (Twosome)</strong></em> (Jaroslav Fuit / Czech Republic)<br>\nA five-year relationship between Michal and Veronika has come to a crossroad. While he is thinking about family life, she feels that she has not yet experienced enough and wants to enjoy herself.&#xA0; Michal comes up with an idea of a mystery holiday in Scandinavia for Veronika.&#xA0; However, from the very beginning everything is completely different than the very thorough Michal had prepared. A run-in with drifter and petty thief, Simon, prompts an unexpected reflection on their lives and their relationship and enables them to move on into directions they never could have predicted.</p>\n<p><em><strong>The Year Dolly Parton was My Mom</strong></em> (Tara Johns / Canada)<br>\nElizabeth Alison Gray is just your average suburban 11-year old waiting for adolescence to arrive when she finds out her whole life has been a lie. With only her imagination, a Ouija Board, and her love of her favorite musician to guide her, she runs away to find the truth.&#xA0; Featuring a rousing collection of Dolly Parton&#x2019;s classic tunes, &#x201C;The Year Dolly Parton Was My Mom&#x201D; is a Canadian coming-of-age tale with a Tennessee heart.&#xA0;<em>Starring Julia Stone, Gil Bellows, Macha Grenon, Trevor Hayes, Rebecca Windheim and Rebecca Croll.</em></p>\n<p><span style=\"text-decoration: underline;\"><strong>Music Films / Music City Competition Presented by Gibson</strong></span></p>\n<p><em><strong>Ain&#x2019;t In It for My Health: A Film About Levon Helm</strong></em> (Jacob Hatley / USA)<br>\nLevon Helm finds himself thrust into the musical spotlight for the first time in a quarter century, but a Grammy nomination and ever-growing audiences force him to confront the dark times that have haunted him since The Band&#x2019;s demise. Win or lose, Levon is an artist who will not go quietly into the night.&#xA0;<em>Starring Levon Helm, Larry Campbell, Teresa Williams, Amy Helm and Billy Bob Thornton.</em>TENNESSEE PREMIERE</p>\n<p><em><strong>Better Than Something: Jay Reatard</strong></em> (Alex Hammond, Ian Markiewicz / USA)<br>\n&#x201C;Better Than Something&#x201D; is an exciting and intimate portrait of Memphis-based punk musician, Jay Reatard, who toured the world and released dozens of records over the course of a 15 year career that began in his mid-teens. Original and never-before-seen footage documents his self-made journey into an iconic, garage rock star, with colleagues, friends, and family speaking candidly about Jay&#x2019;s vibrant and complicated life. Jay Reatard himself, filmed just nine months before his untimely death at the age of twenty-nine, shares his experiences both on and off stage, with all the humor, savvy, and pathos one can expect from such a prolific and vital artist. WORLD PREMIERE</p>\n<p><em><strong>Bob and the Monster</strong></em> (Keirda Bahruth / USA)<br>\nSix years in the making, &#x201C;Bob and the Monster&#x201D; follows outspoken indie-rock hero, Bob Forrest, through his life-threatening struggle with addiction, to his transformation into one of the most influential and controversial drug counselors in the US today.&#xA0; Testimony from his peers, including &#x2013; Courtney Love, Anthony Kiedis and Flea, add texture, but it&#x2019;s the depth of Bob&#x2019;s music, interwoven throughout the film, that illuminates this unforgettable and inspirational story.&#xA0;<em>Starring Bob Forrest, Anthony Kiedis, Flea, Courtney Love, Fishbone and Jane&#x2019;s Addiction.</em></p>\n<p><em><strong>Broke*</strong></em> (Will I. Gray / USA)<br>\nIs it possible for an artist to break? Following on-the-verge artist Will Gray through the recording and release of his debut album (featuring production by Grammy Award-winning producer, T Bone Burnett). &#x201C;Broke*&#x201D; chronicles the stories of artists and executives searching for ways to thrive in the face of today&#x2019;s music industry challenges. Featuring candid interviews with industry insiders and intimate profiles of some of the brightest emerging musical talent in the country, the film digs beneath the clich&#xE9;s and standard story-lines to reveal an industry struggling to find a new identity and an artist who&#x2019;s simply trying to establish one. WORLD PREMIERE</p>\n<p><em><strong>Everyday Sunshine: The Story of Fishbone </strong></em>(Lev Anderson, Chris Metzler / USA)<br>\nFrom the shifting faultlines of Hollywood fantasies and the economic and racial tensions of Reagan&#x2019;s America, Fishbone rose and became one of the most original bands of the last 25 years. With a blistering combination of punk and funk they demolished the walls of genre and challenged the racial stereotypes and the political order of the music industry and of the nation. &#x201C;Everyday Sunshine&#x201D; is about music, history, fear, courage and overcoming adversity.<em> Starring Fishbone, Ice-T, Gwen Stefani, Flea and George Clinton.</em> TENNESSEE PREMIERE</p>\n<p><em><strong>Happy on the Ground: 8 Days at GRAMMY Camp</strong></em> (Jay Lee / USA)<br>\n&#x201C;Happy on the Ground: 8 Days at GRAMMY Camp&#x201D; captures the heartwarming personalities and passion of a group of talented teenage musicians (including 3 from Nashville) whose sole wish is to live a life filled with music. Within 8 glorious and exhausting days, the teens meet one another for the first time, and collaborate on and create music.&#xA0; Despite the mountain of obstacles they face- lack of music funding in schools, an uphill battle to find a music related career, and an industry in turmoil, the teens remain hopeful and &#x2018;Happy on the Ground.&#x2019;&#xA0;<em>Starring Barry Manilow, Gavin Rossdale and Dave Koz.</em>WORLD PREMIERE</p>\n<p><em><strong>Heavy Metal Picnic</strong></em> (Jeff Krulik / USA)<br>\nThe film focuses on the 1985 Full Moon Jamboree, a weekend field party bacchanal that took place at &#x201C;The Farm,&#x201D; home to a cast of colorful characters who lived and partied alongside unamused neighbors in the McMansions of Potomac. The Full Moon Jamboree, an affair so raucous that it made the evening news, was the farm party to end all farm parties, and much of it was recorded using a home video camera and a stolen CBS News microphone swiped from the Reagan Inauguration earlier that year. Twenty-five years later, we revisit the scene and meet the people behind the party, as well as the musicians who performed there, including mid-Atlantic doom metal icons Asylum. Preceded by the cult classic short<em> </em>&#x201C;Heavy Metal Parking Lot.&#x201D; TENNESSEE PREMIERE</p>\n<p><em><strong>How to Grow a Band</strong></em> (Mark Meatto / USA)<br>\n&#x201C;How to Grow A Band&#x201D; is a musical coming of age story that begins as Chris Thile&#x2019;s new group, Punch Brothers, embark on their first tour, six weeks before the release of their debut album. The film&#x2019;s four chapters mirror the four movements of Thile&#x2019;s new piece, &#x201C;The Blind Leaving the Blind,&#x201D; and follow the growth of a man, a band, and a piece of music.&#xA0; With a single camera, filmmaker, Mark Meatto, traces Punch Brothers&#x2019; evolution as musicians, artists, and friends-&#xA0; from their shaky start at a Scottish folk festival to their triumph at New York&#x2019;s Lincoln Center.&#xA0;<em>Starring Chris Thile, Gabe Witcher, Chris Eldridge, Greg Garrison, Paul Kowert and Noam Pikelny.</em> WORLD PREMIERE</p>\n<p><em><strong>Hurry Up and Wait</strong></em> (Justin Malone / USA)<br>\nJustin Malone follows Atlanta-based musicians Gringo Star on their European Tour (opening for And You Will Know Us By The Trail Of Dead), a tour that sees them at once rise to heights of confidence and growing fans. But when things start to go awry in the UK, they begin to question the worth of their pursuits, despite years of hard work.</p>\n<p><em><strong>It&#x2019;s About Yo</strong></em>u (Kurt Markus / USA)<br>\n&#x201C;It&#x2019;s About You&#x201D; is a personal journey film about singer/songwriter John Mellencamp. It was made during his summer 2009 tour with Bob Dylan and Willie Nelson; Mellencamp also recorded his new album in three historical locations during the month and a half tour. The story is told through the eyes of the father/son filmmaking team of Kurt and Ian Markus.&#xA0; Shot entirely on super8, to stunning effect, &#x201C;It&#x2019;s About You&#x201D; is not your typical career-retrospective film. Instead it&#x2019;s a very of-the-moment story of a particular time in a long and storied career.&#xA0;<em>Starring John Mellencamp and T Bone Burnett.</em>TENNESSEE PREMIERE</p>\n<p><em><strong>Music from the Big House</strong></em> (Bruce McDonald / Canada)<br>\nRita Chiarelli, an award winning recording artist, takes a pilgrimage to the birthplace of the blues, Louisiana State Maximum Security Penitentiary, a.k.a Angola Prison. She never imagined that her love for the blues would lead her to raise the roof in a collaborative jailhouse performance with inmates serving life sentences for murder, rape and armed robbery. Music has given these inmates something to live for behind the bars of what was once the bloodiest prison in America. It is their only escape. Steeped with hope, these remarkable voices guide us on a journey of men on a quest for forgiveness. One woman, four bands, and two hours of the blues.</p>\n<p><span style=\"text-decoration: underline;\"><strong>Graveyard Shift</strong></span></p>\n<p>A mash-up of the strange, the funny, the patently offensive, the gross, and the bizarre.&#xA0; Do not say you weren&#x2019;t warned.</p>\n<p><em><strong>Bellflower</strong></em> (Evan Glodell / USA)<br>\n&#x201C;Bellflower&#x201D; follows two friends as they venture out into the world to begin their adult lives. Literally all their free time is spent building flame-throwers and weapons of mass destruction in hopes that a global apocalypse will occur and clear the runway for their imaginary gang Mother Medusa. While waiting for the world to end, their call to excitement comes unexpectedly when one of them meets a charismatic young woman and falls hard in love. Quickly integrated into a new group of friends, they set off on a journey of betrayal, love, hate, infidelity and extreme violence more devastating and fiery than any of their apocalyptic fantasies. Often life&#x2019;s simplest and most obvious truths are the hardest to see, but once you&#x2019;ve burned everything to the ground it may be the only thing left standing.<em> Starring Evan Glodell, Jessie Wiseman, Tyler Dawson and Rebekah Brandes.</em></p>\n<p><em><strong>The Catechism Cateclysm</strong></em> (Todd Rohal / USA)<br>\nFather William Smoortster (Steve Little from &#x201C;Eastbound and Down&#x201D; in a beautifully warped performance), a young priest whose calling may be fading, is forced to take a sabbatical to find his way.&#xA0; He tracks down his old high-school friend Robbie (really, his older sister&#x2019;s ex-boyfriend), and convinces him to take a canoe trip.&#xA0; Together, the two reminisce about days that Robbie would really rather forget.&#xA0; When the two men get lost, the night really begins to get weird, frightening &#x2013; and hilarious!<em><strong>Starring Steve Little, Robert Longstreet, Walter Dalton, Miki Ann Maddox and Koko Lanham.</strong></em></p>\n<p><em><strong>Codependent Lesbian Space Alien Seeks Same</strong></em> (Madeleine Olnek / USA)<br>\nIf you&#x2019;ve been wondering what it would be like if Ed Wood lived long enough to direct the lesbian new-wave cinema of the early 1990s, you&#x2019;ve finally got your answer!&#xA0; &#x201C;Codependent Lesbian Space Alien&#x201D; is an homage to hand-held cinema, DIY special effects, and those bad sci-fi movies that would greet us on local TV back before there were 500+ channels to choose from.&#xA0; When three lesbian aliens are sent to earth to have their hearts broken (their emotions are so strong, they&#x2019;re destroying their home planet&#x2019;s ozone layer), they find the travails of New York City dating scene to be&#x2026;well&#x2026;alien!&#xA0;<em>Starring Lisa Haas, Susan Ziegler, Jackie Monahan, Cynthia Kaplan and Alex Karpovsky.</em></p>\n<p><em><strong>The Last Circus</strong></em> (Alex de la Iglecia / Spain)<br>\nNot since Todd Browning&#x2019;s &#x201C;Freaks&#x201D; has the circus been home to this much horror!&#xA0; Winner of Best Director and Best Screenplay at the 2010 Venice Film Festival, de la Iglecia has crafted a violent cabaret where two clowns fight over love of the same woman &#x2013; and over the aftermath of the Spanish Civil War.&#xA0; When his father is imprisoned by Franco, Javier is charged with avenging him. Cut to Madrid, 1973 and Javier has taken his father&#x2019;s place in the circus and has fallen in love with Sergio, a violent man&#x2019;s girlfriend &#x2013; and the revenge begins. Starring Santiago Segura, Antonio de la Torre and Raul Arevalo.</p>\n<p><em><strong>The Troll Hunter</strong></em> (Andr&#xE9; &#xD8;vredal / Norway)<br>\nThree student filmmakers venture into the remote forests of northern Norway to make a documentary about bear poachers, and all signs point to a mysterious man named Hans.&#xA0; Eager to get their story, they follow Hans deep into territory cordoned off by the government &#x2013; and it&#x2019;s there they discover that Hans isn&#x2019;t a poacher-&#xA0; he&#x2019;s The Troll Hunter &#x2013; a secret government agent charged with protecting the citizenry from the gargantuan horrors that lurk in the desolate reaches of the far north! Starring Hans Morten Hansen, Tomas Alf Larsen, Johanna M&#xF8;rck and Knut N&#xE6;rum.</p>"
}