{
 "id": 6999,
 "name": "little-filipino-egg-rolls-onto-the-nashville-food-truck-scene",
 "title": "Little Filipino [Egg] Rolls Onto The Nashville Food Truck Scene",
 "author": "Morgan Levy",
 "date": "2011-04-28T10:00:00-05:00",
 "tags": [
  "filipino food",
  "food trucks",
  "little filipino"
 ],
 "categories": [],
 "excerpt": "Forgive us for the terrible pun, but another brand new food truck is preparing to throw open its doors (or windows, whatever) in Nashville and we just couldn’t help ourselves. Little Filipino will hit the streets next week, putting that magical street food twist on egg rolls, noodles and other traditional Filipino dishes. Owner Nate Lampa grew up eating traditional Filipino cooking, and he’s been working toward his dream of bringing that same Filipino food in Nashville for the past […]",
 "contentEncoded": "<p><a href=\"http://nashvillest.com/wp-content/uploads/2011/04/sunraygraphic-08-34-05-08-34-25.jpg\"><img class=\"size-large wp-image-7000 aligncenter\" title=\"sunraygraphic 08-34-05 08-34-25\" src=\"http://nashvillest.com/wp-content/uploads/2011/04/sunraygraphic-08-34-05-08-34-25-1024x351.jpg\" alt=\"\" width=\"491\" height=\"169\"></a></p>\n<p>Forgive us for the terrible pun, but another brand new food truck is preparing to throw open its doors (or windows, whatever) in Nashville and we just couldn&#x2019;t help ourselves. <a href=\"http://twitter.com/#!/little_filipino\" target=\"_blank\">Little Filipino</a> will hit the streets next week, putting that magical street food twist on egg rolls, noodles and other traditional Filipino dishes. Owner Nate Lampa grew up eating traditional Filipino cooking, and he&#x2019;s been working toward his dream of bringing that same Filipino food in Nashville for the past two years. Now he&#x2019;s finally ready to give the city a taste of what&#x2019;s in store.</p>\n<p>Little Filipino will serve&#xA0;Filipino Lumpia (egg rolls) and Pancit (noodles), along with a rotating menu of specials like&#xA0;Filipino Adobo, tropical fruit cocktails, sweet rice porridge, and unique rolls with out of the ordinary fillings.</p>\n<p>The truck will make its debut next Friday, May 6 at 8pm at the&#xA0;<a href=\"http://www.ticketweb.com/t3/sale/SaleEventDetail?dispatch=loadSelectionData&amp;eventId=3628165\" target=\"_blank\">People Loving Nashville benefit show</a> at 12th &amp; Porter. It&#x2019;s a great cause in and of itself, but throw in some egg rolls and noodles and we&#x2019;re sold! For the time being, Little Filipino won&#x2019;t have a regular schedule, but will instead be experimenting with different locations to see how Nashville reacts to the food. You can follow Little Filipino on <a href=\"http://twitter.com/#!/little_filipino\" target=\"_blank\">Twitter</a> or <a href=\"https://www.facebook.com/littlefilipinonashville\" target=\"_blank\">Facebook</a> to keep tabs on their location, and give them a shout if you have an event you think they should serve at!</p>\n<p>&#xA0;</p>"
}