{
 "id": 3317,
 "name": "world-aids-day",
 "title": "Knowing The Facts: HIV/AIDS In Nashville [World AIDS Day]",
 "author": "Christy Frink",
 "date": "2009-12-01T10:15:00-06:00",
 "tags": [
  "hiv/aids",
  "nashville cares",
  "red",
  "volunteering",
  "world AIDS day"
 ],
 "categories": [
  "Culture &amp; Arts",
  "News"
 ],
 "excerpt": "If you've made a trip or two around the internet this morning, you probably know that it's World AIDS Day. Though we'll see a great deal of focus today on",
 "contentEncoded": "<p style=\"text-align: center;\"><a href=\"http://www.flickr.com/photos/burningkarma/2913007586/in/set-72157607740318789/\"><img class=\"aligncenter\" src=\"http://farm4.static.flickr.com/3184/2913007586_6bb58b9183.jpg\" alt=\"\" width=\"500\" height=\"375\"></a></p>\n<p>If you&#x2019;ve made a trip or two around the internet this morning, you probably know that it&#x2019;s <a href=\"http://www.worldaidsday.org/\" target=\"_blank\">World AIDS Day</a>. Though we&#x2019;ll see a great deal of focus today on the HIV/AIDS crisis in the third world, we want to take a moment to remember the folks living with the disease right here in Nashville.</p>\n<p>There are plenty of ways to help out around Middle Tennessee.  Keep an eye out for 2010&#x2019;s <a href=\"http://www.diningoutforlife.com/Nashville\" target=\"_blank\">Dining Out for Life</a> event and help your favorite restaurants give back. Get a team together and join up with the <a href=\"http://www.nashvilleaidswalk.com/faf/home/default.asp?ievent=316635\" target=\"_blank\">Nashville AIDS Walk</a>. Spend an evening with <a href=\"http://www.artrageous.org/\" target=\"_blank\">Artrageous</a>. For year-round opportunities to <a href=\"http://www.nashvillecares.org/volunteering/getting_started\" target=\"_blank\">volunteer</a> and <a href=\"http://www.nashvillecares.org/fundraising/events/fundraising/donation\" target=\"_blank\">donate</a>, check out&#xA0; <a href=\"http://www.nashvillecares.org/\" target=\"_self\">Nashville CARES</a>&#x2013;a local organization that provides support for Nashvillians living with HIV/AIDS, community education, and advocacy. And finally, know the facts:</p>\n<ul>\n<li>As of December 2007, almost 7,500 Middle Tennesseans have been reported with AIDS or HIV infection since the epidemic began.&#xA0; This represents 35% of the 21,400 Tennesseans diagnosed statewide.</li>\n<li> About 5,100 Middle Tennesseans are currently living with HIV or AIDS (69% of diagnosed).</li>\n<li>These are diagnosed individuals; experts believe that another 20% are HIV-infected but do not know it. (Total = 6,100.)</li>\n<li>Although the majority (72%) live in Davidson County, cases have been reported in every county in the region (and the state).</li>\n<li>About 300-370 new cases of HIV and AIDS are reported for Middle Tennessee annually.</li>\n<li>Women are 20% of new HIV infections in Middle Tennessee and 28% of new HIV infections in the Nashville MSA.</li>\n<li>18% of new HIV infections are among teenagers or youth under age 25.</li>\n<li>Older Middle Tennesseans are not immune.&#xA0; About 5% of new HIV infections are among people age 55 or older.</li>\n<li>Unsafe sexual behavior (both homosexual and heterosexual) are the main transmission factors, accounting for 70%+ of new infections.</li>\n<li>Although people with HIV/AIDS are living longer, last year someone in Middle Tennessee still died from AIDS every 4-5 days.</li>\n</ul>\n<p><em> </em></p>\n<p><em>Data provided by the Tennessee Department of Health. Compiled by <a href=\"http://www.nashvillecares.org\">Nashville CARES</a>.</em></p>\n<p><em>Photo by <a href=\"http://www.flickr.com/photos/burningkarma/2913007586/in/set-72157607740318789/\" target=\"_blank\">burningkarma</a>.<br>\n</em></p>\n\n\n\n\n<p>No related posts.</p>\t\t\t\t\t\t\t\t\t\t\t<!--END .entry-content .article-->"
}