{
 "id": 5521,
 "name": "bright-early-as-we-walk-in-fields-of-green-edition",
 "title": "Bright &amp; Early: As We Walk In Fields Of Green Edition",
 "author": "Christy Frink",
 "date": "2010-08-10T09:30:00-05:00",
 "tags": [
  "bna",
  "dea",
  "disaster recovery",
  "disposal",
  "drug bust",
  "flood debris",
  "flood relief",
  "louisiana",
  "marijuana",
  "metro animal control",
  "metro council",
  "metro courthouse",
  "murfreesboro",
  "nashville flood",
  "nashville international airport",
  "nudity",
  "public demonstrations",
  "tva",
  "young buck"
 ],
 "categories": [
  "News"
 ],
 "contentEncoded": "<p style=\"text-align: center;\"><a href=\"http://www.flickr.com/photos/flickravatar/2646808865/\"><img class=\"aligncenter\" src=\"http://farm4.static.flickr.com/3038/2646808865_88daff829d.jpg\" alt=\"\" width=\"416\" height=\"277\"></a></p>\n<p>Good morning, Nashville. Picture this: You&#x2019;re on a plane just sitting in one of those little seats with your complimentary beverage, snacking on some lightly-salted peanuts while eagerly reading&#xA0;<em>Twilight</em> on your Kindle&#x2122;, and the flight attendants begin preparing the cabin for landing. They chatter over the loudspeaker, maybe do a little song and dance routine if you&#x2019;re flying that one airline, and you begin to stretch as the plane taxis happily into the terminal at BNA. &#x201C;Welcome to Nashville,&#x201D; the flight attendant exclaims, &#x201C;where marijuana grows in fields like wildflowers!&#x201D; Turning your head to the left to gaze out the tiny airplane window, you spot that beautiful field of green rippling in the warm Tennessee breeze. You smile, for you are home. <a href=\"http://www.newschannel5.com/global/story.asp?s=12952372\" target=\"_blank\">Actually, this is more or less what just happened at BNA yesterday (though perhaps we embellished a bit) when several of the Drug Enforcement Agency&#x2019;s finest found an actual &#x201C;field of pot growing in an open area of the airport,&#x201D; tended to by one Mr. Mark Vining who is 51 years of age</a>. Having already racked up a few drug charges in his day, Mr. Vining was not actually an airport employee, which makes us wonder how he ended up with enough airport access to grow all that pot in the first place.</p>\n<ul>\n<li><strong>Protesting the protests. </strong>City officials are <a href=\"http://www.tennessean.com/article/20100810/NEWS0202/8100334/-1/rss05\" target=\"_blank\">putting some additional regulations on folks gathering in and around the courthouse to protest or rally at Metro Council meetings</a>, such as requiring the gatherings to end 30 minutes before the meetings start, which kind of defeats the purpose of a protest. However, officials are concerned about disruptive noise levels and the safety of gathering in the mezzanine area with stairs that are easy to fall down.</li>\n<li><strong>Debris disposal extended. </strong>Metro is<a href=\"http://nashvillecitypaper.com/content/city-news/metro-extends-free-flood-debris-disposal?utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed:+NashvilleCityPaper-CityNews+(Nashville+City+Paper+-+City+News)&amp;utm_content=Google+Reader\" target=\"_blank\"> extending free flood debris disposal services through the end of September because so many folks are still rebuilding</a>. You just have to present a building permit (which is free for flood victims) proving that you&#x2019;re doing the repairs and construction yourself.</li>\n<li><strong>Bits &amp; pieces.</strong> Two young women were arrested for <a href=\"http://www.newschannel5.com/global/story.asp?s=12954056\" target=\"_blank\">running around Murfreesbroo naked and ringing people&#x2019;s doorbells</a> &#x2026; Metro Animal Control wants to <a href=\"http://www.wkrn.com/global/story.asp?s=12951498\" target=\"_blank\">pass an ordinance limiting the number of pets we can have</a> to prevent conditions that are unsanitary or harmful to the pets &#x2026; Louisiana is <a href=\"http://www.newschannel5.com/global/story.asp?s=12953364\" target=\"_blank\">sending us some help in the way of disaster recovery experts</a> &#x2026; The TVA predicts that <a href=\"http://www.newschannel5.com/global/story.asp?s=12953393\" target=\"_blank\">energy demand is going to be the highest it&#x2019;s been in years this week</a>, so be smart about how you use it lest we end up with power outages &#x2026; <a href=\"http://www.tennessean.com/article/20100810/NEWS03/8100322/-1/rss05\" target=\"_blank\">Young Buck officially owes the IRS $164,000</a>.</li>\n</ul>\n<p><em>Photo by </em><a href=\"http://www.flickr.com/photos/flickravatar/2646808865/\" target=\"_blank\"><em>Flickr Avatar</em></a><em>.</em></p>\n\n\n\n\n<p>No related posts.</p>\t\t\t\t\t\t\t\t\t\t\t<!--END .entry-content .article-->"
}